#![allow(non_camel_case_types, non_upper_case_globals, non_snake_case)]
#![allow(dead_code)]
/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {

pub const _deviceButton5Motion: u32 = 5;
pub const _deviceButtonMotion: u32 = 6;
pub const _deviceButtonGrab: u32 = 7;
pub const _deviceOwnerGrabButton: u32 = 8;
pub const _noExtensionEvent: u32 = 9;
pub const _devicePresence: u32 = 0;
pub const _deviceEnter: u32 = 0;
pub const _deviceLeave: u32 = 1;
pub const DeviceAdded: u32 = 0;
pub const DeviceRemoved: u32 = 1;
pub const DeviceEnabled: u32 = 2;
pub const DeviceDisabled: u32 = 3;
pub const DeviceUnrecoverable: u32 = 4;
pub const DeviceControlChanged: u32 = 5;
pub const XI_BadDevice: u32 = 0;
pub const XI_BadEvent: u32 = 1;
pub const XI_BadMode: u32 = 2;
pub const XI_DeviceBusy: u32 = 3;
pub const XI_BadClass: u32 = 4;
pub const _deviceKeyPress: u32 = 0;
pub const _deviceKeyRelease: u32 = 1;
pub const _deviceButtonPress: u32 = 0;
pub const _deviceButtonRelease: u32 = 1;
pub const _deviceMotionNotify: u32 = 0;
pub const _deviceFocusIn: u32 = 0;
pub const _deviceFocusOut: u32 = 1;
pub const _proximityIn: u32 = 0;
pub const _proximityOut: u32 = 1;
pub const _deviceStateNotify: u32 = 0;
pub const _deviceMappingNotify: u32 = 1;
pub const _changeDeviceNotify: u32 = 2;
pub const _propertyNotify: u32 = 6;

pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_connection_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_iterator_t {
    pub data: *mut ::std::os::raw::c_void,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_iterator_t"][::std::mem::size_of::<xcb_generic_iterator_t>() - 16usize];
    ["Alignment of xcb_generic_iterator_t"]
        [::std::mem::align_of::<xcb_generic_iterator_t>() - 8usize];
    ["Offset of field: xcb_generic_iterator_t::data"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, data) - 0usize];
    ["Offset of field: xcb_generic_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_generic_iterator_t::index"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_reply_t"][::std::mem::size_of::<xcb_generic_reply_t>() - 8usize];
    ["Alignment of xcb_generic_reply_t"][::std::mem::align_of::<xcb_generic_reply_t>() - 4usize];
    ["Offset of field: xcb_generic_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_generic_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_reply_t::length"]
        [::std::mem::offset_of!(xcb_generic_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub pad: [u32; 7usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_event_t"][::std::mem::size_of::<xcb_generic_event_t>() - 36usize];
    ["Alignment of xcb_generic_event_t"][::std::mem::align_of::<xcb_generic_event_t>() - 4usize];
    ["Offset of field: xcb_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_event_t, pad0) - 1usize];
    ["Offset of field: xcb_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_event_t::pad"]
        [::std::mem::offset_of!(xcb_generic_event_t, pad) - 4usize];
    ["Offset of field: xcb_generic_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_generic_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_raw_generic_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub pad: [u32; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_raw_generic_event_t"][::std::mem::size_of::<xcb_raw_generic_event_t>() - 32usize];
    ["Alignment of xcb_raw_generic_event_t"]
        [::std::mem::align_of::<xcb_raw_generic_event_t>() - 4usize];
    ["Offset of field: xcb_raw_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_raw_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, pad0) - 1usize];
    ["Offset of field: xcb_raw_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_raw_generic_event_t::pad"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, pad) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ge_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub event_type: u16,
    pub pad1: u16,
    pub pad: [u32; 5usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ge_event_t"][::std::mem::size_of::<xcb_ge_event_t>() - 36usize];
    ["Alignment of xcb_ge_event_t"][::std::mem::align_of::<xcb_ge_event_t>() - 4usize];
    ["Offset of field: xcb_ge_event_t::response_type"]
        [::std::mem::offset_of!(xcb_ge_event_t, response_type) - 0usize];
    ["Offset of field: xcb_ge_event_t::pad0"]
        [::std::mem::offset_of!(xcb_ge_event_t, pad0) - 1usize];
    ["Offset of field: xcb_ge_event_t::sequence"]
        [::std::mem::offset_of!(xcb_ge_event_t, sequence) - 2usize];
    ["Offset of field: xcb_ge_event_t::length"]
        [::std::mem::offset_of!(xcb_ge_event_t, length) - 4usize];
    ["Offset of field: xcb_ge_event_t::event_type"]
        [::std::mem::offset_of!(xcb_ge_event_t, event_type) - 8usize];
    ["Offset of field: xcb_ge_event_t::pad1"]
        [::std::mem::offset_of!(xcb_ge_event_t, pad1) - 10usize];
    ["Offset of field: xcb_ge_event_t::pad"][::std::mem::offset_of!(xcb_ge_event_t, pad) - 12usize];
    ["Offset of field: xcb_ge_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_ge_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub resource_id: u32,
    pub minor_code: u16,
    pub major_code: u8,
    pub pad0: u8,
    pub pad: [u32; 5usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_error_t"][::std::mem::size_of::<xcb_generic_error_t>() - 36usize];
    ["Alignment of xcb_generic_error_t"][::std::mem::align_of::<xcb_generic_error_t>() - 4usize];
    ["Offset of field: xcb_generic_error_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_error_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_error_t::error_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, error_code) - 1usize];
    ["Offset of field: xcb_generic_error_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_error_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_error_t::resource_id"]
        [::std::mem::offset_of!(xcb_generic_error_t, resource_id) - 4usize];
    ["Offset of field: xcb_generic_error_t::minor_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, minor_code) - 8usize];
    ["Offset of field: xcb_generic_error_t::major_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, major_code) - 10usize];
    ["Offset of field: xcb_generic_error_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_error_t, pad0) - 11usize];
    ["Offset of field: xcb_generic_error_t::pad"]
        [::std::mem::offset_of!(xcb_generic_error_t, pad) - 12usize];
    ["Offset of field: xcb_generic_error_t::full_sequence"]
        [::std::mem::offset_of!(xcb_generic_error_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_void_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_void_cookie_t"][::std::mem::size_of::<xcb_void_cookie_t>() - 4usize];
    ["Alignment of xcb_void_cookie_t"][::std::mem::align_of::<xcb_void_cookie_t>() - 4usize];
    ["Offset of field: xcb_void_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_void_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_char2b_t {
    pub byte1: u8,
    pub byte2: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_char2b_t"][::std::mem::size_of::<xcb_char2b_t>() - 2usize];
    ["Alignment of xcb_char2b_t"][::std::mem::align_of::<xcb_char2b_t>() - 1usize];
    ["Offset of field: xcb_char2b_t::byte1"][::std::mem::offset_of!(xcb_char2b_t, byte1) - 0usize];
    ["Offset of field: xcb_char2b_t::byte2"][::std::mem::offset_of!(xcb_char2b_t, byte2) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_char2b_iterator_t {
    pub data: *mut xcb_char2b_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_char2b_iterator_t"][::std::mem::size_of::<xcb_char2b_iterator_t>() - 16usize];
    ["Alignment of xcb_char2b_iterator_t"]
        [::std::mem::align_of::<xcb_char2b_iterator_t>() - 8usize];
    ["Offset of field: xcb_char2b_iterator_t::data"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, data) - 0usize];
    ["Offset of field: xcb_char2b_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_char2b_iterator_t::index"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, index) - 12usize];
};
pub type xcb_window_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_window_iterator_t {
    pub data: *mut xcb_window_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_window_iterator_t"][::std::mem::size_of::<xcb_window_iterator_t>() - 16usize];
    ["Alignment of xcb_window_iterator_t"]
        [::std::mem::align_of::<xcb_window_iterator_t>() - 8usize];
    ["Offset of field: xcb_window_iterator_t::data"]
        [::std::mem::offset_of!(xcb_window_iterator_t, data) - 0usize];
    ["Offset of field: xcb_window_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_window_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_window_iterator_t::index"]
        [::std::mem::offset_of!(xcb_window_iterator_t, index) - 12usize];
};
pub type xcb_pixmap_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_pixmap_iterator_t {
    pub data: *mut xcb_pixmap_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_pixmap_iterator_t"][::std::mem::size_of::<xcb_pixmap_iterator_t>() - 16usize];
    ["Alignment of xcb_pixmap_iterator_t"]
        [::std::mem::align_of::<xcb_pixmap_iterator_t>() - 8usize];
    ["Offset of field: xcb_pixmap_iterator_t::data"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, data) - 0usize];
    ["Offset of field: xcb_pixmap_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_pixmap_iterator_t::index"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, index) - 12usize];
};
pub type xcb_cursor_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_cursor_iterator_t {
    pub data: *mut xcb_cursor_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_cursor_iterator_t"][::std::mem::size_of::<xcb_cursor_iterator_t>() - 16usize];
    ["Alignment of xcb_cursor_iterator_t"]
        [::std::mem::align_of::<xcb_cursor_iterator_t>() - 8usize];
    ["Offset of field: xcb_cursor_iterator_t::data"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, data) - 0usize];
    ["Offset of field: xcb_cursor_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_cursor_iterator_t::index"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, index) - 12usize];
};
pub type xcb_font_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_font_iterator_t {
    pub data: *mut xcb_font_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_font_iterator_t"][::std::mem::size_of::<xcb_font_iterator_t>() - 16usize];
    ["Alignment of xcb_font_iterator_t"][::std::mem::align_of::<xcb_font_iterator_t>() - 8usize];
    ["Offset of field: xcb_font_iterator_t::data"]
        [::std::mem::offset_of!(xcb_font_iterator_t, data) - 0usize];
    ["Offset of field: xcb_font_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_font_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_font_iterator_t::index"]
        [::std::mem::offset_of!(xcb_font_iterator_t, index) - 12usize];
};
pub type xcb_gcontext_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_gcontext_iterator_t {
    pub data: *mut xcb_gcontext_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_gcontext_iterator_t"][::std::mem::size_of::<xcb_gcontext_iterator_t>() - 16usize];
    ["Alignment of xcb_gcontext_iterator_t"]
        [::std::mem::align_of::<xcb_gcontext_iterator_t>() - 8usize];
    ["Offset of field: xcb_gcontext_iterator_t::data"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, data) - 0usize];
    ["Offset of field: xcb_gcontext_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_gcontext_iterator_t::index"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, index) - 12usize];
};
pub type xcb_colormap_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_colormap_iterator_t {
    pub data: *mut xcb_colormap_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_colormap_iterator_t"][::std::mem::size_of::<xcb_colormap_iterator_t>() - 16usize];
    ["Alignment of xcb_colormap_iterator_t"]
        [::std::mem::align_of::<xcb_colormap_iterator_t>() - 8usize];
    ["Offset of field: xcb_colormap_iterator_t::data"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, data) - 0usize];
    ["Offset of field: xcb_colormap_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_colormap_iterator_t::index"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, index) - 12usize];
};
pub type xcb_atom_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_atom_iterator_t {
    pub data: *mut xcb_atom_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_atom_iterator_t"][::std::mem::size_of::<xcb_atom_iterator_t>() - 16usize];
    ["Alignment of xcb_atom_iterator_t"][::std::mem::align_of::<xcb_atom_iterator_t>() - 8usize];
    ["Offset of field: xcb_atom_iterator_t::data"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, data) - 0usize];
    ["Offset of field: xcb_atom_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_atom_iterator_t::index"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, index) - 12usize];
};
pub type xcb_drawable_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_drawable_iterator_t {
    pub data: *mut xcb_drawable_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_drawable_iterator_t"][::std::mem::size_of::<xcb_drawable_iterator_t>() - 16usize];
    ["Alignment of xcb_drawable_iterator_t"]
        [::std::mem::align_of::<xcb_drawable_iterator_t>() - 8usize];
    ["Offset of field: xcb_drawable_iterator_t::data"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, data) - 0usize];
    ["Offset of field: xcb_drawable_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_drawable_iterator_t::index"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, index) - 12usize];
};
pub type xcb_fontable_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontable_iterator_t {
    pub data: *mut xcb_fontable_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontable_iterator_t"][::std::mem::size_of::<xcb_fontable_iterator_t>() - 16usize];
    ["Alignment of xcb_fontable_iterator_t"]
        [::std::mem::align_of::<xcb_fontable_iterator_t>() - 8usize];
    ["Offset of field: xcb_fontable_iterator_t::data"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, data) - 0usize];
    ["Offset of field: xcb_fontable_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_fontable_iterator_t::index"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, index) - 12usize];
};
pub type xcb_bool32_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_bool32_iterator_t {
    pub data: *mut xcb_bool32_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_bool32_iterator_t"][::std::mem::size_of::<xcb_bool32_iterator_t>() - 16usize];
    ["Alignment of xcb_bool32_iterator_t"]
        [::std::mem::align_of::<xcb_bool32_iterator_t>() - 8usize];
    ["Offset of field: xcb_bool32_iterator_t::data"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, data) - 0usize];
    ["Offset of field: xcb_bool32_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_bool32_iterator_t::index"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, index) - 12usize];
};
pub type xcb_visualid_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualid_iterator_t {
    pub data: *mut xcb_visualid_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualid_iterator_t"][::std::mem::size_of::<xcb_visualid_iterator_t>() - 16usize];
    ["Alignment of xcb_visualid_iterator_t"]
        [::std::mem::align_of::<xcb_visualid_iterator_t>() - 8usize];
    ["Offset of field: xcb_visualid_iterator_t::data"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, data) - 0usize];
    ["Offset of field: xcb_visualid_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_visualid_iterator_t::index"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, index) - 12usize];
};
pub type xcb_timestamp_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timestamp_iterator_t {
    pub data: *mut xcb_timestamp_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timestamp_iterator_t"]
        [::std::mem::size_of::<xcb_timestamp_iterator_t>() - 16usize];
    ["Alignment of xcb_timestamp_iterator_t"]
        [::std::mem::align_of::<xcb_timestamp_iterator_t>() - 8usize];
    ["Offset of field: xcb_timestamp_iterator_t::data"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, data) - 0usize];
    ["Offset of field: xcb_timestamp_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_timestamp_iterator_t::index"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, index) - 12usize];
};
pub type xcb_keysym_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keysym_iterator_t {
    pub data: *mut xcb_keysym_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keysym_iterator_t"][::std::mem::size_of::<xcb_keysym_iterator_t>() - 16usize];
    ["Alignment of xcb_keysym_iterator_t"]
        [::std::mem::align_of::<xcb_keysym_iterator_t>() - 8usize];
    ["Offset of field: xcb_keysym_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keysym_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keysym_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, index) - 12usize];
};
pub type xcb_keycode_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keycode_iterator_t {
    pub data: *mut xcb_keycode_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keycode_iterator_t"][::std::mem::size_of::<xcb_keycode_iterator_t>() - 16usize];
    ["Alignment of xcb_keycode_iterator_t"]
        [::std::mem::align_of::<xcb_keycode_iterator_t>() - 8usize];
    ["Offset of field: xcb_keycode_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keycode_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keycode_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, index) - 12usize];
};
pub type xcb_keycode32_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keycode32_iterator_t {
    pub data: *mut xcb_keycode32_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keycode32_iterator_t"]
        [::std::mem::size_of::<xcb_keycode32_iterator_t>() - 16usize];
    ["Alignment of xcb_keycode32_iterator_t"]
        [::std::mem::align_of::<xcb_keycode32_iterator_t>() - 8usize];
    ["Offset of field: xcb_keycode32_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keycode32_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keycode32_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, index) - 12usize];
};
pub type xcb_button_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_button_iterator_t {
    pub data: *mut xcb_button_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_button_iterator_t"][::std::mem::size_of::<xcb_button_iterator_t>() - 16usize];
    ["Alignment of xcb_button_iterator_t"]
        [::std::mem::align_of::<xcb_button_iterator_t>() - 8usize];
    ["Offset of field: xcb_button_iterator_t::data"]
        [::std::mem::offset_of!(xcb_button_iterator_t, data) - 0usize];
    ["Offset of field: xcb_button_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_button_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_button_iterator_t::index"]
        [::std::mem::offset_of!(xcb_button_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_point_t {
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_point_t"][::std::mem::size_of::<xcb_point_t>() - 4usize];
    ["Alignment of xcb_point_t"][::std::mem::align_of::<xcb_point_t>() - 2usize];
    ["Offset of field: xcb_point_t::x"][::std::mem::offset_of!(xcb_point_t, x) - 0usize];
    ["Offset of field: xcb_point_t::y"][::std::mem::offset_of!(xcb_point_t, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_point_iterator_t {
    pub data: *mut xcb_point_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_point_iterator_t"][::std::mem::size_of::<xcb_point_iterator_t>() - 16usize];
    ["Alignment of xcb_point_iterator_t"][::std::mem::align_of::<xcb_point_iterator_t>() - 8usize];
    ["Offset of field: xcb_point_iterator_t::data"]
        [::std::mem::offset_of!(xcb_point_iterator_t, data) - 0usize];
    ["Offset of field: xcb_point_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_point_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_point_iterator_t::index"]
        [::std::mem::offset_of!(xcb_point_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_rectangle_t {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_rectangle_t"][::std::mem::size_of::<xcb_rectangle_t>() - 8usize];
    ["Alignment of xcb_rectangle_t"][::std::mem::align_of::<xcb_rectangle_t>() - 2usize];
    ["Offset of field: xcb_rectangle_t::x"][::std::mem::offset_of!(xcb_rectangle_t, x) - 0usize];
    ["Offset of field: xcb_rectangle_t::y"][::std::mem::offset_of!(xcb_rectangle_t, y) - 2usize];
    ["Offset of field: xcb_rectangle_t::width"]
        [::std::mem::offset_of!(xcb_rectangle_t, width) - 4usize];
    ["Offset of field: xcb_rectangle_t::height"]
        [::std::mem::offset_of!(xcb_rectangle_t, height) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_rectangle_iterator_t {
    pub data: *mut xcb_rectangle_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_rectangle_iterator_t"]
        [::std::mem::size_of::<xcb_rectangle_iterator_t>() - 16usize];
    ["Alignment of xcb_rectangle_iterator_t"]
        [::std::mem::align_of::<xcb_rectangle_iterator_t>() - 8usize];
    ["Offset of field: xcb_rectangle_iterator_t::data"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, data) - 0usize];
    ["Offset of field: xcb_rectangle_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_rectangle_iterator_t::index"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_arc_t {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub angle1: i16,
    pub angle2: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_arc_t"][::std::mem::size_of::<xcb_arc_t>() - 12usize];
    ["Alignment of xcb_arc_t"][::std::mem::align_of::<xcb_arc_t>() - 2usize];
    ["Offset of field: xcb_arc_t::x"][::std::mem::offset_of!(xcb_arc_t, x) - 0usize];
    ["Offset of field: xcb_arc_t::y"][::std::mem::offset_of!(xcb_arc_t, y) - 2usize];
    ["Offset of field: xcb_arc_t::width"][::std::mem::offset_of!(xcb_arc_t, width) - 4usize];
    ["Offset of field: xcb_arc_t::height"][::std::mem::offset_of!(xcb_arc_t, height) - 6usize];
    ["Offset of field: xcb_arc_t::angle1"][::std::mem::offset_of!(xcb_arc_t, angle1) - 8usize];
    ["Offset of field: xcb_arc_t::angle2"][::std::mem::offset_of!(xcb_arc_t, angle2) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_arc_iterator_t {
    pub data: *mut xcb_arc_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_arc_iterator_t"][::std::mem::size_of::<xcb_arc_iterator_t>() - 16usize];
    ["Alignment of xcb_arc_iterator_t"][::std::mem::align_of::<xcb_arc_iterator_t>() - 8usize];
    ["Offset of field: xcb_arc_iterator_t::data"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, data) - 0usize];
    ["Offset of field: xcb_arc_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_arc_iterator_t::index"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_format_t {
    pub depth: u8,
    pub bits_per_pixel: u8,
    pub scanline_pad: u8,
    pub pad0: [u8; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_format_t"][::std::mem::size_of::<xcb_format_t>() - 8usize];
    ["Alignment of xcb_format_t"][::std::mem::align_of::<xcb_format_t>() - 1usize];
    ["Offset of field: xcb_format_t::depth"][::std::mem::offset_of!(xcb_format_t, depth) - 0usize];
    ["Offset of field: xcb_format_t::bits_per_pixel"]
        [::std::mem::offset_of!(xcb_format_t, bits_per_pixel) - 1usize];
    ["Offset of field: xcb_format_t::scanline_pad"]
        [::std::mem::offset_of!(xcb_format_t, scanline_pad) - 2usize];
    ["Offset of field: xcb_format_t::pad0"][::std::mem::offset_of!(xcb_format_t, pad0) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_format_iterator_t {
    pub data: *mut xcb_format_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_format_iterator_t"][::std::mem::size_of::<xcb_format_iterator_t>() - 16usize];
    ["Alignment of xcb_format_iterator_t"]
        [::std::mem::align_of::<xcb_format_iterator_t>() - 8usize];
    ["Offset of field: xcb_format_iterator_t::data"]
        [::std::mem::offset_of!(xcb_format_iterator_t, data) - 0usize];
    ["Offset of field: xcb_format_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_format_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_format_iterator_t::index"]
        [::std::mem::offset_of!(xcb_format_iterator_t, index) - 12usize];
};
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_STATIC_GRAY: xcb_visual_class_t = 0;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_GRAY_SCALE: xcb_visual_class_t = 1;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_STATIC_COLOR: xcb_visual_class_t = 2;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_PSEUDO_COLOR: xcb_visual_class_t = 3;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_TRUE_COLOR: xcb_visual_class_t = 4;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_DIRECT_COLOR: xcb_visual_class_t = 5;
pub type xcb_visual_class_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualtype_t {
    pub visual_id: xcb_visualid_t,
    pub _class: u8,
    pub bits_per_rgb_value: u8,
    pub colormap_entries: u16,
    pub red_mask: u32,
    pub green_mask: u32,
    pub blue_mask: u32,
    pub pad0: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualtype_t"][::std::mem::size_of::<xcb_visualtype_t>() - 24usize];
    ["Alignment of xcb_visualtype_t"][::std::mem::align_of::<xcb_visualtype_t>() - 4usize];
    ["Offset of field: xcb_visualtype_t::visual_id"]
        [::std::mem::offset_of!(xcb_visualtype_t, visual_id) - 0usize];
    ["Offset of field: xcb_visualtype_t::_class"]
        [::std::mem::offset_of!(xcb_visualtype_t, _class) - 4usize];
    ["Offset of field: xcb_visualtype_t::bits_per_rgb_value"]
        [::std::mem::offset_of!(xcb_visualtype_t, bits_per_rgb_value) - 5usize];
    ["Offset of field: xcb_visualtype_t::colormap_entries"]
        [::std::mem::offset_of!(xcb_visualtype_t, colormap_entries) - 6usize];
    ["Offset of field: xcb_visualtype_t::red_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, red_mask) - 8usize];
    ["Offset of field: xcb_visualtype_t::green_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, green_mask) - 12usize];
    ["Offset of field: xcb_visualtype_t::blue_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, blue_mask) - 16usize];
    ["Offset of field: xcb_visualtype_t::pad0"]
        [::std::mem::offset_of!(xcb_visualtype_t, pad0) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualtype_iterator_t {
    pub data: *mut xcb_visualtype_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualtype_iterator_t"]
        [::std::mem::size_of::<xcb_visualtype_iterator_t>() - 16usize];
    ["Alignment of xcb_visualtype_iterator_t"]
        [::std::mem::align_of::<xcb_visualtype_iterator_t>() - 8usize];
    ["Offset of field: xcb_visualtype_iterator_t::data"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, data) - 0usize];
    ["Offset of field: xcb_visualtype_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_visualtype_iterator_t::index"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_depth_t {
    pub depth: u8,
    pub pad0: u8,
    pub visuals_len: u16,
    pub pad1: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_depth_t"][::std::mem::size_of::<xcb_depth_t>() - 8usize];
    ["Alignment of xcb_depth_t"][::std::mem::align_of::<xcb_depth_t>() - 2usize];
    ["Offset of field: xcb_depth_t::depth"][::std::mem::offset_of!(xcb_depth_t, depth) - 0usize];
    ["Offset of field: xcb_depth_t::pad0"][::std::mem::offset_of!(xcb_depth_t, pad0) - 1usize];
    ["Offset of field: xcb_depth_t::visuals_len"]
        [::std::mem::offset_of!(xcb_depth_t, visuals_len) - 2usize];
    ["Offset of field: xcb_depth_t::pad1"][::std::mem::offset_of!(xcb_depth_t, pad1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_depth_iterator_t {
    pub data: *mut xcb_depth_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_depth_iterator_t"][::std::mem::size_of::<xcb_depth_iterator_t>() - 16usize];
    ["Alignment of xcb_depth_iterator_t"][::std::mem::align_of::<xcb_depth_iterator_t>() - 8usize];
    ["Offset of field: xcb_depth_iterator_t::data"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, data) - 0usize];
    ["Offset of field: xcb_depth_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_depth_iterator_t::index"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, index) - 12usize];
};
pub const XCB_EVENT_MASK_NO_EVENT: xcb_event_mask_t = 0;
pub const XCB_EVENT_MASK_KEY_PRESS: xcb_event_mask_t = 1;
pub const XCB_EVENT_MASK_KEY_RELEASE: xcb_event_mask_t = 2;
pub const XCB_EVENT_MASK_BUTTON_PRESS: xcb_event_mask_t = 4;
pub const XCB_EVENT_MASK_BUTTON_RELEASE: xcb_event_mask_t = 8;
pub const XCB_EVENT_MASK_ENTER_WINDOW: xcb_event_mask_t = 16;
pub const XCB_EVENT_MASK_LEAVE_WINDOW: xcb_event_mask_t = 32;
pub const XCB_EVENT_MASK_POINTER_MOTION: xcb_event_mask_t = 64;
pub const XCB_EVENT_MASK_POINTER_MOTION_HINT: xcb_event_mask_t = 128;
pub const XCB_EVENT_MASK_BUTTON_1_MOTION: xcb_event_mask_t = 256;
pub const XCB_EVENT_MASK_BUTTON_2_MOTION: xcb_event_mask_t = 512;
pub const XCB_EVENT_MASK_BUTTON_3_MOTION: xcb_event_mask_t = 1024;
pub const XCB_EVENT_MASK_BUTTON_4_MOTION: xcb_event_mask_t = 2048;
pub const XCB_EVENT_MASK_BUTTON_5_MOTION: xcb_event_mask_t = 4096;
pub const XCB_EVENT_MASK_BUTTON_MOTION: xcb_event_mask_t = 8192;
pub const XCB_EVENT_MASK_KEYMAP_STATE: xcb_event_mask_t = 16384;
pub const XCB_EVENT_MASK_EXPOSURE: xcb_event_mask_t = 32768;
pub const XCB_EVENT_MASK_VISIBILITY_CHANGE: xcb_event_mask_t = 65536;
pub const XCB_EVENT_MASK_STRUCTURE_NOTIFY: xcb_event_mask_t = 131072;
pub const XCB_EVENT_MASK_RESIZE_REDIRECT: xcb_event_mask_t = 262144;
pub const XCB_EVENT_MASK_SUBSTRUCTURE_NOTIFY: xcb_event_mask_t = 524288;
pub const XCB_EVENT_MASK_SUBSTRUCTURE_REDIRECT: xcb_event_mask_t = 1048576;
pub const XCB_EVENT_MASK_FOCUS_CHANGE: xcb_event_mask_t = 2097152;
pub const XCB_EVENT_MASK_PROPERTY_CHANGE: xcb_event_mask_t = 4194304;
pub const XCB_EVENT_MASK_COLOR_MAP_CHANGE: xcb_event_mask_t = 8388608;
pub const XCB_EVENT_MASK_OWNER_GRAB_BUTTON: xcb_event_mask_t = 16777216;
pub type xcb_event_mask_t = ::std::os::raw::c_uint;
pub const XCB_BACKING_STORE_NOT_USEFUL: xcb_backing_store_t = 0;
pub const XCB_BACKING_STORE_WHEN_MAPPED: xcb_backing_store_t = 1;
pub const XCB_BACKING_STORE_ALWAYS: xcb_backing_store_t = 2;
pub type xcb_backing_store_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_screen_t {
    pub root: xcb_window_t,
    pub default_colormap: xcb_colormap_t,
    pub white_pixel: u32,
    pub black_pixel: u32,
    pub current_input_masks: u32,
    pub width_in_pixels: u16,
    pub height_in_pixels: u16,
    pub width_in_millimeters: u16,
    pub height_in_millimeters: u16,
    pub min_installed_maps: u16,
    pub max_installed_maps: u16,
    pub root_visual: xcb_visualid_t,
    pub backing_stores: u8,
    pub save_unders: u8,
    pub root_depth: u8,
    pub allowed_depths_len: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_screen_t"][::std::mem::size_of::<xcb_screen_t>() - 40usize];
    ["Alignment of xcb_screen_t"][::std::mem::align_of::<xcb_screen_t>() - 4usize];
    ["Offset of field: xcb_screen_t::root"][::std::mem::offset_of!(xcb_screen_t, root) - 0usize];
    ["Offset of field: xcb_screen_t::default_colormap"]
        [::std::mem::offset_of!(xcb_screen_t, default_colormap) - 4usize];
    ["Offset of field: xcb_screen_t::white_pixel"]
        [::std::mem::offset_of!(xcb_screen_t, white_pixel) - 8usize];
    ["Offset of field: xcb_screen_t::black_pixel"]
        [::std::mem::offset_of!(xcb_screen_t, black_pixel) - 12usize];
    ["Offset of field: xcb_screen_t::current_input_masks"]
        [::std::mem::offset_of!(xcb_screen_t, current_input_masks) - 16usize];
    ["Offset of field: xcb_screen_t::width_in_pixels"]
        [::std::mem::offset_of!(xcb_screen_t, width_in_pixels) - 20usize];
    ["Offset of field: xcb_screen_t::height_in_pixels"]
        [::std::mem::offset_of!(xcb_screen_t, height_in_pixels) - 22usize];
    ["Offset of field: xcb_screen_t::width_in_millimeters"]
        [::std::mem::offset_of!(xcb_screen_t, width_in_millimeters) - 24usize];
    ["Offset of field: xcb_screen_t::height_in_millimeters"]
        [::std::mem::offset_of!(xcb_screen_t, height_in_millimeters) - 26usize];
    ["Offset of field: xcb_screen_t::min_installed_maps"]
        [::std::mem::offset_of!(xcb_screen_t, min_installed_maps) - 28usize];
    ["Offset of field: xcb_screen_t::max_installed_maps"]
        [::std::mem::offset_of!(xcb_screen_t, max_installed_maps) - 30usize];
    ["Offset of field: xcb_screen_t::root_visual"]
        [::std::mem::offset_of!(xcb_screen_t, root_visual) - 32usize];
    ["Offset of field: xcb_screen_t::backing_stores"]
        [::std::mem::offset_of!(xcb_screen_t, backing_stores) - 36usize];
    ["Offset of field: xcb_screen_t::save_unders"]
        [::std::mem::offset_of!(xcb_screen_t, save_unders) - 37usize];
    ["Offset of field: xcb_screen_t::root_depth"]
        [::std::mem::offset_of!(xcb_screen_t, root_depth) - 38usize];
    ["Offset of field: xcb_screen_t::allowed_depths_len"]
        [::std::mem::offset_of!(xcb_screen_t, allowed_depths_len) - 39usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_screen_iterator_t {
    pub data: *mut xcb_screen_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_screen_iterator_t"][::std::mem::size_of::<xcb_screen_iterator_t>() - 16usize];
    ["Alignment of xcb_screen_iterator_t"]
        [::std::mem::align_of::<xcb_screen_iterator_t>() - 8usize];
    ["Offset of field: xcb_screen_iterator_t::data"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, data) - 0usize];
    ["Offset of field: xcb_screen_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_screen_iterator_t::index"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_request_t {
    pub byte_order: u8,
    pub pad0: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub authorization_protocol_name_len: u16,
    pub authorization_protocol_data_len: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_request_t"][::std::mem::size_of::<xcb_setup_request_t>() - 12usize];
    ["Alignment of xcb_setup_request_t"][::std::mem::align_of::<xcb_setup_request_t>() - 2usize];
    ["Offset of field: xcb_setup_request_t::byte_order"]
        [::std::mem::offset_of!(xcb_setup_request_t, byte_order) - 0usize];
    ["Offset of field: xcb_setup_request_t::pad0"]
        [::std::mem::offset_of!(xcb_setup_request_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_request_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_request_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_request_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_request_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_request_t::authorization_protocol_name_len"]
        [::std::mem::offset_of!(xcb_setup_request_t, authorization_protocol_name_len) - 6usize];
    ["Offset of field: xcb_setup_request_t::authorization_protocol_data_len"]
        [::std::mem::offset_of!(xcb_setup_request_t, authorization_protocol_data_len) - 8usize];
    ["Offset of field: xcb_setup_request_t::pad1"]
        [::std::mem::offset_of!(xcb_setup_request_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_request_iterator_t {
    pub data: *mut xcb_setup_request_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_request_iterator_t"]
        [::std::mem::size_of::<xcb_setup_request_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_request_iterator_t"]
        [::std::mem::align_of::<xcb_setup_request_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_request_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_request_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_request_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_failed_t {
    pub status: u8,
    pub reason_len: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_failed_t"][::std::mem::size_of::<xcb_setup_failed_t>() - 8usize];
    ["Alignment of xcb_setup_failed_t"][::std::mem::align_of::<xcb_setup_failed_t>() - 2usize];
    ["Offset of field: xcb_setup_failed_t::status"]
        [::std::mem::offset_of!(xcb_setup_failed_t, status) - 0usize];
    ["Offset of field: xcb_setup_failed_t::reason_len"]
        [::std::mem::offset_of!(xcb_setup_failed_t, reason_len) - 1usize];
    ["Offset of field: xcb_setup_failed_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_failed_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_failed_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_failed_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_failed_t::length"]
        [::std::mem::offset_of!(xcb_setup_failed_t, length) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_failed_iterator_t {
    pub data: *mut xcb_setup_failed_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_failed_iterator_t"]
        [::std::mem::size_of::<xcb_setup_failed_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_failed_iterator_t"]
        [::std::mem::align_of::<xcb_setup_failed_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_failed_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_failed_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_failed_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_authenticate_t {
    pub status: u8,
    pub pad0: [u8; 5usize],
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_authenticate_t"]
        [::std::mem::size_of::<xcb_setup_authenticate_t>() - 8usize];
    ["Alignment of xcb_setup_authenticate_t"]
        [::std::mem::align_of::<xcb_setup_authenticate_t>() - 2usize];
    ["Offset of field: xcb_setup_authenticate_t::status"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, status) - 0usize];
    ["Offset of field: xcb_setup_authenticate_t::pad0"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_authenticate_t::length"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, length) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_authenticate_iterator_t {
    pub data: *mut xcb_setup_authenticate_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_authenticate_iterator_t"]
        [::std::mem::size_of::<xcb_setup_authenticate_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_authenticate_iterator_t"]
        [::std::mem::align_of::<xcb_setup_authenticate_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, index) - 12usize];
};
pub const XCB_IMAGE_ORDER_LSB_FIRST: xcb_image_order_t = 0;
pub const XCB_IMAGE_ORDER_MSB_FIRST: xcb_image_order_t = 1;
pub type xcb_image_order_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_t {
    pub status: u8,
    pub pad0: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub length: u16,
    pub release_number: u32,
    pub resource_id_base: u32,
    pub resource_id_mask: u32,
    pub motion_buffer_size: u32,
    pub vendor_len: u16,
    pub maximum_request_length: u16,
    pub roots_len: u8,
    pub pixmap_formats_len: u8,
    pub image_byte_order: u8,
    pub bitmap_format_bit_order: u8,
    pub bitmap_format_scanline_unit: u8,
    pub bitmap_format_scanline_pad: u8,
    pub min_keycode: xcb_keycode_t,
    pub max_keycode: xcb_keycode_t,
    pub pad1: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_t"][::std::mem::size_of::<xcb_setup_t>() - 40usize];
    ["Alignment of xcb_setup_t"][::std::mem::align_of::<xcb_setup_t>() - 4usize];
    ["Offset of field: xcb_setup_t::status"][::std::mem::offset_of!(xcb_setup_t, status) - 0usize];
    ["Offset of field: xcb_setup_t::pad0"][::std::mem::offset_of!(xcb_setup_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_t::length"][::std::mem::offset_of!(xcb_setup_t, length) - 6usize];
    ["Offset of field: xcb_setup_t::release_number"]
        [::std::mem::offset_of!(xcb_setup_t, release_number) - 8usize];
    ["Offset of field: xcb_setup_t::resource_id_base"]
        [::std::mem::offset_of!(xcb_setup_t, resource_id_base) - 12usize];
    ["Offset of field: xcb_setup_t::resource_id_mask"]
        [::std::mem::offset_of!(xcb_setup_t, resource_id_mask) - 16usize];
    ["Offset of field: xcb_setup_t::motion_buffer_size"]
        [::std::mem::offset_of!(xcb_setup_t, motion_buffer_size) - 20usize];
    ["Offset of field: xcb_setup_t::vendor_len"]
        [::std::mem::offset_of!(xcb_setup_t, vendor_len) - 24usize];
    ["Offset of field: xcb_setup_t::maximum_request_length"]
        [::std::mem::offset_of!(xcb_setup_t, maximum_request_length) - 26usize];
    ["Offset of field: xcb_setup_t::roots_len"]
        [::std::mem::offset_of!(xcb_setup_t, roots_len) - 28usize];
    ["Offset of field: xcb_setup_t::pixmap_formats_len"]
        [::std::mem::offset_of!(xcb_setup_t, pixmap_formats_len) - 29usize];
    ["Offset of field: xcb_setup_t::image_byte_order"]
        [::std::mem::offset_of!(xcb_setup_t, image_byte_order) - 30usize];
    ["Offset of field: xcb_setup_t::bitmap_format_bit_order"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_bit_order) - 31usize];
    ["Offset of field: xcb_setup_t::bitmap_format_scanline_unit"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_scanline_unit) - 32usize];
    ["Offset of field: xcb_setup_t::bitmap_format_scanline_pad"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_scanline_pad) - 33usize];
    ["Offset of field: xcb_setup_t::min_keycode"]
        [::std::mem::offset_of!(xcb_setup_t, min_keycode) - 34usize];
    ["Offset of field: xcb_setup_t::max_keycode"]
        [::std::mem::offset_of!(xcb_setup_t, max_keycode) - 35usize];
    ["Offset of field: xcb_setup_t::pad1"][::std::mem::offset_of!(xcb_setup_t, pad1) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_iterator_t {
    pub data: *mut xcb_setup_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_iterator_t"][::std::mem::size_of::<xcb_setup_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_iterator_t"][::std::mem::align_of::<xcb_setup_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, index) - 12usize];
};
pub const XCB_MOD_MASK_SHIFT: xcb_mod_mask_t = 1;
pub const XCB_MOD_MASK_LOCK: xcb_mod_mask_t = 2;
pub const XCB_MOD_MASK_CONTROL: xcb_mod_mask_t = 4;
pub const XCB_MOD_MASK_1: xcb_mod_mask_t = 8;
pub const XCB_MOD_MASK_2: xcb_mod_mask_t = 16;
pub const XCB_MOD_MASK_3: xcb_mod_mask_t = 32;
pub const XCB_MOD_MASK_4: xcb_mod_mask_t = 64;
pub const XCB_MOD_MASK_5: xcb_mod_mask_t = 128;
pub const XCB_MOD_MASK_ANY: xcb_mod_mask_t = 32768;
pub type xcb_mod_mask_t = ::std::os::raw::c_uint;
pub const XCB_KEY_BUT_MASK_SHIFT: xcb_key_but_mask_t = 1;
pub const XCB_KEY_BUT_MASK_LOCK: xcb_key_but_mask_t = 2;
pub const XCB_KEY_BUT_MASK_CONTROL: xcb_key_but_mask_t = 4;
pub const XCB_KEY_BUT_MASK_MOD_1: xcb_key_but_mask_t = 8;
pub const XCB_KEY_BUT_MASK_MOD_2: xcb_key_but_mask_t = 16;
pub const XCB_KEY_BUT_MASK_MOD_3: xcb_key_but_mask_t = 32;
pub const XCB_KEY_BUT_MASK_MOD_4: xcb_key_but_mask_t = 64;
pub const XCB_KEY_BUT_MASK_MOD_5: xcb_key_but_mask_t = 128;
pub const XCB_KEY_BUT_MASK_BUTTON_1: xcb_key_but_mask_t = 256;
pub const XCB_KEY_BUT_MASK_BUTTON_2: xcb_key_but_mask_t = 512;
pub const XCB_KEY_BUT_MASK_BUTTON_3: xcb_key_but_mask_t = 1024;
pub const XCB_KEY_BUT_MASK_BUTTON_4: xcb_key_but_mask_t = 2048;
pub const XCB_KEY_BUT_MASK_BUTTON_5: xcb_key_but_mask_t = 4096;
pub type xcb_key_but_mask_t = ::std::os::raw::c_uint;
pub const xcb_window_enum_t_XCB_WINDOW_NONE: xcb_window_enum_t = 0;
pub type xcb_window_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_key_press_event_t {
    pub response_type: u8,
    pub detail: xcb_keycode_t,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_key_press_event_t"][::std::mem::size_of::<xcb_key_press_event_t>() - 32usize];
    ["Alignment of xcb_key_press_event_t"]
        [::std::mem::align_of::<xcb_key_press_event_t>() - 4usize];
    ["Offset of field: xcb_key_press_event_t::response_type"]
        [::std::mem::offset_of!(xcb_key_press_event_t, response_type) - 0usize];
    ["Offset of field: xcb_key_press_event_t::detail"]
        [::std::mem::offset_of!(xcb_key_press_event_t, detail) - 1usize];
    ["Offset of field: xcb_key_press_event_t::sequence"]
        [::std::mem::offset_of!(xcb_key_press_event_t, sequence) - 2usize];
    ["Offset of field: xcb_key_press_event_t::time"]
        [::std::mem::offset_of!(xcb_key_press_event_t, time) - 4usize];
    ["Offset of field: xcb_key_press_event_t::root"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root) - 8usize];
    ["Offset of field: xcb_key_press_event_t::event"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event) - 12usize];
    ["Offset of field: xcb_key_press_event_t::child"]
        [::std::mem::offset_of!(xcb_key_press_event_t, child) - 16usize];
    ["Offset of field: xcb_key_press_event_t::root_x"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root_x) - 20usize];
    ["Offset of field: xcb_key_press_event_t::root_y"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root_y) - 22usize];
    ["Offset of field: xcb_key_press_event_t::event_x"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event_x) - 24usize];
    ["Offset of field: xcb_key_press_event_t::event_y"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event_y) - 26usize];
    ["Offset of field: xcb_key_press_event_t::state"]
        [::std::mem::offset_of!(xcb_key_press_event_t, state) - 28usize];
    ["Offset of field: xcb_key_press_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_key_press_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_key_press_event_t::pad0"]
        [::std::mem::offset_of!(xcb_key_press_event_t, pad0) - 31usize];
};
pub type xcb_key_release_event_t = xcb_key_press_event_t;
pub const XCB_BUTTON_MASK_1: xcb_button_mask_t = 256;
pub const XCB_BUTTON_MASK_2: xcb_button_mask_t = 512;
pub const XCB_BUTTON_MASK_3: xcb_button_mask_t = 1024;
pub const XCB_BUTTON_MASK_4: xcb_button_mask_t = 2048;
pub const XCB_BUTTON_MASK_5: xcb_button_mask_t = 4096;
pub const XCB_BUTTON_MASK_ANY: xcb_button_mask_t = 32768;
pub type xcb_button_mask_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_button_press_event_t {
    pub response_type: u8,
    pub detail: xcb_button_t,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_button_press_event_t"]
        [::std::mem::size_of::<xcb_button_press_event_t>() - 32usize];
    ["Alignment of xcb_button_press_event_t"]
        [::std::mem::align_of::<xcb_button_press_event_t>() - 4usize];
    ["Offset of field: xcb_button_press_event_t::response_type"]
        [::std::mem::offset_of!(xcb_button_press_event_t, response_type) - 0usize];
    ["Offset of field: xcb_button_press_event_t::detail"]
        [::std::mem::offset_of!(xcb_button_press_event_t, detail) - 1usize];
    ["Offset of field: xcb_button_press_event_t::sequence"]
        [::std::mem::offset_of!(xcb_button_press_event_t, sequence) - 2usize];
    ["Offset of field: xcb_button_press_event_t::time"]
        [::std::mem::offset_of!(xcb_button_press_event_t, time) - 4usize];
    ["Offset of field: xcb_button_press_event_t::root"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root) - 8usize];
    ["Offset of field: xcb_button_press_event_t::event"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event) - 12usize];
    ["Offset of field: xcb_button_press_event_t::child"]
        [::std::mem::offset_of!(xcb_button_press_event_t, child) - 16usize];
    ["Offset of field: xcb_button_press_event_t::root_x"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root_x) - 20usize];
    ["Offset of field: xcb_button_press_event_t::root_y"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root_y) - 22usize];
    ["Offset of field: xcb_button_press_event_t::event_x"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event_x) - 24usize];
    ["Offset of field: xcb_button_press_event_t::event_y"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event_y) - 26usize];
    ["Offset of field: xcb_button_press_event_t::state"]
        [::std::mem::offset_of!(xcb_button_press_event_t, state) - 28usize];
    ["Offset of field: xcb_button_press_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_button_press_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_button_press_event_t::pad0"]
        [::std::mem::offset_of!(xcb_button_press_event_t, pad0) - 31usize];
};
pub type xcb_button_release_event_t = xcb_button_press_event_t;
pub const xcb_motion_t_XCB_MOTION_NORMAL: xcb_motion_t = 0;
pub const xcb_motion_t_XCB_MOTION_HINT: xcb_motion_t = 1;
pub type xcb_motion_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_motion_notify_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_motion_notify_event_t"]
        [::std::mem::size_of::<xcb_motion_notify_event_t>() - 32usize];
    ["Alignment of xcb_motion_notify_event_t"]
        [::std::mem::align_of::<xcb_motion_notify_event_t>() - 4usize];
    ["Offset of field: xcb_motion_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_motion_notify_event_t::detail"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, detail) - 1usize];
    ["Offset of field: xcb_motion_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_motion_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_motion_notify_event_t::root"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root) - 8usize];
    ["Offset of field: xcb_motion_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event) - 12usize];
    ["Offset of field: xcb_motion_notify_event_t::child"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, child) - 16usize];
    ["Offset of field: xcb_motion_notify_event_t::root_x"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root_x) - 20usize];
    ["Offset of field: xcb_motion_notify_event_t::root_y"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root_y) - 22usize];
    ["Offset of field: xcb_motion_notify_event_t::event_x"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event_x) - 24usize];
    ["Offset of field: xcb_motion_notify_event_t::event_y"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event_y) - 26usize];
    ["Offset of field: xcb_motion_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, state) - 28usize];
    ["Offset of field: xcb_motion_notify_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_motion_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, pad0) - 31usize];
};
pub const XCB_NOTIFY_DETAIL_ANCESTOR: xcb_notify_detail_t = 0;
pub const XCB_NOTIFY_DETAIL_VIRTUAL: xcb_notify_detail_t = 1;
pub const XCB_NOTIFY_DETAIL_INFERIOR: xcb_notify_detail_t = 2;
pub const XCB_NOTIFY_DETAIL_NONLINEAR: xcb_notify_detail_t = 3;
pub const XCB_NOTIFY_DETAIL_NONLINEAR_VIRTUAL: xcb_notify_detail_t = 4;
pub const XCB_NOTIFY_DETAIL_POINTER: xcb_notify_detail_t = 5;
pub const XCB_NOTIFY_DETAIL_POINTER_ROOT: xcb_notify_detail_t = 6;
pub const XCB_NOTIFY_DETAIL_NONE: xcb_notify_detail_t = 7;
pub type xcb_notify_detail_t = ::std::os::raw::c_uint;
pub const XCB_NOTIFY_MODE_NORMAL: xcb_notify_mode_t = 0;
pub const XCB_NOTIFY_MODE_GRAB: xcb_notify_mode_t = 1;
pub const XCB_NOTIFY_MODE_UNGRAB: xcb_notify_mode_t = 2;
pub const XCB_NOTIFY_MODE_WHILE_GRABBED: xcb_notify_mode_t = 3;
pub type xcb_notify_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_enter_notify_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub mode: u8,
    pub same_screen_focus: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_enter_notify_event_t"]
        [::std::mem::size_of::<xcb_enter_notify_event_t>() - 32usize];
    ["Alignment of xcb_enter_notify_event_t"]
        [::std::mem::align_of::<xcb_enter_notify_event_t>() - 4usize];
    ["Offset of field: xcb_enter_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_enter_notify_event_t::detail"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, detail) - 1usize];
    ["Offset of field: xcb_enter_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_enter_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_enter_notify_event_t::root"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root) - 8usize];
    ["Offset of field: xcb_enter_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event) - 12usize];
    ["Offset of field: xcb_enter_notify_event_t::child"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, child) - 16usize];
    ["Offset of field: xcb_enter_notify_event_t::root_x"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root_x) - 20usize];
    ["Offset of field: xcb_enter_notify_event_t::root_y"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root_y) - 22usize];
    ["Offset of field: xcb_enter_notify_event_t::event_x"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event_x) - 24usize];
    ["Offset of field: xcb_enter_notify_event_t::event_y"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event_y) - 26usize];
    ["Offset of field: xcb_enter_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, state) - 28usize];
    ["Offset of field: xcb_enter_notify_event_t::mode"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, mode) - 30usize];
    ["Offset of field: xcb_enter_notify_event_t::same_screen_focus"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, same_screen_focus) - 31usize];
};
pub type xcb_leave_notify_event_t = xcb_enter_notify_event_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_focus_in_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub mode: u8,
    pub pad0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_focus_in_event_t"][::std::mem::size_of::<xcb_focus_in_event_t>() - 12usize];
    ["Alignment of xcb_focus_in_event_t"][::std::mem::align_of::<xcb_focus_in_event_t>() - 4usize];
    ["Offset of field: xcb_focus_in_event_t::response_type"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, response_type) - 0usize];
    ["Offset of field: xcb_focus_in_event_t::detail"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, detail) - 1usize];
    ["Offset of field: xcb_focus_in_event_t::sequence"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, sequence) - 2usize];
    ["Offset of field: xcb_focus_in_event_t::event"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, event) - 4usize];
    ["Offset of field: xcb_focus_in_event_t::mode"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, mode) - 8usize];
    ["Offset of field: xcb_focus_in_event_t::pad0"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, pad0) - 9usize];
};
pub type xcb_focus_out_event_t = xcb_focus_in_event_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keymap_notify_event_t {
    pub response_type: u8,
    pub keys: [u8; 31usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keymap_notify_event_t"]
        [::std::mem::size_of::<xcb_keymap_notify_event_t>() - 32usize];
    ["Alignment of xcb_keymap_notify_event_t"]
        [::std::mem::align_of::<xcb_keymap_notify_event_t>() - 1usize];
    ["Offset of field: xcb_keymap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_keymap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_keymap_notify_event_t::keys"]
        [::std::mem::offset_of!(xcb_keymap_notify_event_t, keys) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_expose_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub x: u16,
    pub y: u16,
    pub width: u16,
    pub height: u16,
    pub count: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_expose_event_t"][::std::mem::size_of::<xcb_expose_event_t>() - 20usize];
    ["Alignment of xcb_expose_event_t"][::std::mem::align_of::<xcb_expose_event_t>() - 4usize];
    ["Offset of field: xcb_expose_event_t::response_type"]
        [::std::mem::offset_of!(xcb_expose_event_t, response_type) - 0usize];
    ["Offset of field: xcb_expose_event_t::pad0"]
        [::std::mem::offset_of!(xcb_expose_event_t, pad0) - 1usize];
    ["Offset of field: xcb_expose_event_t::sequence"]
        [::std::mem::offset_of!(xcb_expose_event_t, sequence) - 2usize];
    ["Offset of field: xcb_expose_event_t::window"]
        [::std::mem::offset_of!(xcb_expose_event_t, window) - 4usize];
    ["Offset of field: xcb_expose_event_t::x"]
        [::std::mem::offset_of!(xcb_expose_event_t, x) - 8usize];
    ["Offset of field: xcb_expose_event_t::y"]
        [::std::mem::offset_of!(xcb_expose_event_t, y) - 10usize];
    ["Offset of field: xcb_expose_event_t::width"]
        [::std::mem::offset_of!(xcb_expose_event_t, width) - 12usize];
    ["Offset of field: xcb_expose_event_t::height"]
        [::std::mem::offset_of!(xcb_expose_event_t, height) - 14usize];
    ["Offset of field: xcb_expose_event_t::count"]
        [::std::mem::offset_of!(xcb_expose_event_t, count) - 16usize];
    ["Offset of field: xcb_expose_event_t::pad1"]
        [::std::mem::offset_of!(xcb_expose_event_t, pad1) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_graphics_exposure_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub drawable: xcb_drawable_t,
    pub x: u16,
    pub y: u16,
    pub width: u16,
    pub height: u16,
    pub minor_opcode: u16,
    pub count: u16,
    pub major_opcode: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_graphics_exposure_event_t"]
        [::std::mem::size_of::<xcb_graphics_exposure_event_t>() - 24usize];
    ["Alignment of xcb_graphics_exposure_event_t"]
        [::std::mem::align_of::<xcb_graphics_exposure_event_t>() - 4usize];
    ["Offset of field: xcb_graphics_exposure_event_t::response_type"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, response_type) - 0usize];
    ["Offset of field: xcb_graphics_exposure_event_t::pad0"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, pad0) - 1usize];
    ["Offset of field: xcb_graphics_exposure_event_t::sequence"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, sequence) - 2usize];
    ["Offset of field: xcb_graphics_exposure_event_t::drawable"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, drawable) - 4usize];
    ["Offset of field: xcb_graphics_exposure_event_t::x"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, x) - 8usize];
    ["Offset of field: xcb_graphics_exposure_event_t::y"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, y) - 10usize];
    ["Offset of field: xcb_graphics_exposure_event_t::width"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, width) - 12usize];
    ["Offset of field: xcb_graphics_exposure_event_t::height"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, height) - 14usize];
    ["Offset of field: xcb_graphics_exposure_event_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, minor_opcode) - 16usize];
    ["Offset of field: xcb_graphics_exposure_event_t::count"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, count) - 18usize];
    ["Offset of field: xcb_graphics_exposure_event_t::major_opcode"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, major_opcode) - 20usize];
    ["Offset of field: xcb_graphics_exposure_event_t::pad1"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, pad1) - 21usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_no_exposure_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub drawable: xcb_drawable_t,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_no_exposure_event_t"][::std::mem::size_of::<xcb_no_exposure_event_t>() - 12usize];
    ["Alignment of xcb_no_exposure_event_t"]
        [::std::mem::align_of::<xcb_no_exposure_event_t>() - 4usize];
    ["Offset of field: xcb_no_exposure_event_t::response_type"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, response_type) - 0usize];
    ["Offset of field: xcb_no_exposure_event_t::pad0"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, pad0) - 1usize];
    ["Offset of field: xcb_no_exposure_event_t::sequence"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, sequence) - 2usize];
    ["Offset of field: xcb_no_exposure_event_t::drawable"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, drawable) - 4usize];
    ["Offset of field: xcb_no_exposure_event_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_no_exposure_event_t::major_opcode"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, major_opcode) - 10usize];
    ["Offset of field: xcb_no_exposure_event_t::pad1"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, pad1) - 11usize];
};
pub const xcb_visibility_t_XCB_VISIBILITY_UNOBSCURED: xcb_visibility_t = 0;
pub const xcb_visibility_t_XCB_VISIBILITY_PARTIALLY_OBSCURED: xcb_visibility_t = 1;
pub const xcb_visibility_t_XCB_VISIBILITY_FULLY_OBSCURED: xcb_visibility_t = 2;
pub type xcb_visibility_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visibility_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub state: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visibility_notify_event_t"]
        [::std::mem::size_of::<xcb_visibility_notify_event_t>() - 12usize];
    ["Alignment of xcb_visibility_notify_event_t"]
        [::std::mem::align_of::<xcb_visibility_notify_event_t>() - 4usize];
    ["Offset of field: xcb_visibility_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_visibility_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_visibility_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_visibility_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_visibility_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, state) - 8usize];
    ["Offset of field: xcb_visibility_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, pad1) - 9usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub override_redirect: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_notify_event_t"]
        [::std::mem::size_of::<xcb_create_notify_event_t>() - 24usize];
    ["Alignment of xcb_create_notify_event_t"]
        [::std::mem::align_of::<xcb_create_notify_event_t>() - 4usize];
    ["Offset of field: xcb_create_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_create_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_create_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_create_notify_event_t::parent"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, parent) - 4usize];
    ["Offset of field: xcb_create_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_create_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, x) - 12usize];
    ["Offset of field: xcb_create_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, y) - 14usize];
    ["Offset of field: xcb_create_notify_event_t::width"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, width) - 16usize];
    ["Offset of field: xcb_create_notify_event_t::height"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, height) - 18usize];
    ["Offset of field: xcb_create_notify_event_t::border_width"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, border_width) - 20usize];
    ["Offset of field: xcb_create_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, override_redirect) - 22usize];
    ["Offset of field: xcb_create_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, pad1) - 23usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_notify_event_t"]
        [::std::mem::size_of::<xcb_destroy_notify_event_t>() - 12usize];
    ["Alignment of xcb_destroy_notify_event_t"]
        [::std::mem::align_of::<xcb_destroy_notify_event_t>() - 4usize];
    ["Offset of field: xcb_destroy_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_destroy_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_destroy_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_destroy_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, window) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub from_configure: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_notify_event_t"]
        [::std::mem::size_of::<xcb_unmap_notify_event_t>() - 16usize];
    ["Alignment of xcb_unmap_notify_event_t"]
        [::std::mem::align_of::<xcb_unmap_notify_event_t>() - 4usize];
    ["Offset of field: xcb_unmap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_unmap_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_unmap_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_unmap_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_unmap_notify_event_t::from_configure"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, from_configure) - 12usize];
    ["Offset of field: xcb_unmap_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, pad1) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub override_redirect: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_notify_event_t"][::std::mem::size_of::<xcb_map_notify_event_t>() - 16usize];
    ["Alignment of xcb_map_notify_event_t"]
        [::std::mem::align_of::<xcb_map_notify_event_t>() - 4usize];
    ["Offset of field: xcb_map_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_map_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_map_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_map_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_map_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_map_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, override_redirect) - 12usize];
    ["Offset of field: xcb_map_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, pad1) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_request_event_t"][::std::mem::size_of::<xcb_map_request_event_t>() - 12usize];
    ["Alignment of xcb_map_request_event_t"]
        [::std::mem::align_of::<xcb_map_request_event_t>() - 4usize];
    ["Offset of field: xcb_map_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_map_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_map_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_map_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_map_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_map_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_map_request_event_t::parent"]
        [::std::mem::offset_of!(xcb_map_request_event_t, parent) - 4usize];
    ["Offset of field: xcb_map_request_event_t::window"]
        [::std::mem::offset_of!(xcb_map_request_event_t, window) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_reparent_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub override_redirect: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_reparent_notify_event_t"]
        [::std::mem::size_of::<xcb_reparent_notify_event_t>() - 24usize];
    ["Alignment of xcb_reparent_notify_event_t"]
        [::std::mem::align_of::<xcb_reparent_notify_event_t>() - 4usize];
    ["Offset of field: xcb_reparent_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_reparent_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_reparent_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_reparent_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_reparent_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_reparent_notify_event_t::parent"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, parent) - 12usize];
    ["Offset of field: xcb_reparent_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, x) - 16usize];
    ["Offset of field: xcb_reparent_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, y) - 18usize];
    ["Offset of field: xcb_reparent_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, override_redirect) - 20usize];
    ["Offset of field: xcb_reparent_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, pad1) - 21usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub above_sibling: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub override_redirect: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_notify_event_t"]
        [::std::mem::size_of::<xcb_configure_notify_event_t>() - 28usize];
    ["Alignment of xcb_configure_notify_event_t"]
        [::std::mem::align_of::<xcb_configure_notify_event_t>() - 4usize];
    ["Offset of field: xcb_configure_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_configure_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_configure_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_configure_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_configure_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_configure_notify_event_t::above_sibling"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, above_sibling) - 12usize];
    ["Offset of field: xcb_configure_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, x) - 16usize];
    ["Offset of field: xcb_configure_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, y) - 18usize];
    ["Offset of field: xcb_configure_notify_event_t::width"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, width) - 20usize];
    ["Offset of field: xcb_configure_notify_event_t::height"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, height) - 22usize];
    ["Offset of field: xcb_configure_notify_event_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, border_width) - 24usize];
    ["Offset of field: xcb_configure_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, override_redirect) - 26usize];
    ["Offset of field: xcb_configure_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, pad1) - 27usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_request_event_t {
    pub response_type: u8,
    pub stack_mode: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
    pub sibling: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub value_mask: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_request_event_t"]
        [::std::mem::size_of::<xcb_configure_request_event_t>() - 28usize];
    ["Alignment of xcb_configure_request_event_t"]
        [::std::mem::align_of::<xcb_configure_request_event_t>() - 4usize];
    ["Offset of field: xcb_configure_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_configure_request_event_t::stack_mode"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, stack_mode) - 1usize];
    ["Offset of field: xcb_configure_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_configure_request_event_t::parent"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, parent) - 4usize];
    ["Offset of field: xcb_configure_request_event_t::window"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, window) - 8usize];
    ["Offset of field: xcb_configure_request_event_t::sibling"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, sibling) - 12usize];
    ["Offset of field: xcb_configure_request_event_t::x"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, x) - 16usize];
    ["Offset of field: xcb_configure_request_event_t::y"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, y) - 18usize];
    ["Offset of field: xcb_configure_request_event_t::width"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, width) - 20usize];
    ["Offset of field: xcb_configure_request_event_t::height"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, height) - 22usize];
    ["Offset of field: xcb_configure_request_event_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, border_width) - 24usize];
    ["Offset of field: xcb_configure_request_event_t::value_mask"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, value_mask) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_gravity_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_gravity_notify_event_t"]
        [::std::mem::size_of::<xcb_gravity_notify_event_t>() - 16usize];
    ["Alignment of xcb_gravity_notify_event_t"]
        [::std::mem::align_of::<xcb_gravity_notify_event_t>() - 4usize];
    ["Offset of field: xcb_gravity_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_gravity_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_gravity_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_gravity_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_gravity_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_gravity_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, x) - 12usize];
    ["Offset of field: xcb_gravity_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_resize_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_resize_request_event_t"]
        [::std::mem::size_of::<xcb_resize_request_event_t>() - 12usize];
    ["Alignment of xcb_resize_request_event_t"]
        [::std::mem::align_of::<xcb_resize_request_event_t>() - 4usize];
    ["Offset of field: xcb_resize_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_resize_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_resize_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_resize_request_event_t::window"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, window) - 4usize];
    ["Offset of field: xcb_resize_request_event_t::width"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, width) - 8usize];
    ["Offset of field: xcb_resize_request_event_t::height"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, height) - 10usize];
};
pub const xcb_place_t_XCB_PLACE_ON_TOP: xcb_place_t = 0;
pub const xcb_place_t_XCB_PLACE_ON_BOTTOM: xcb_place_t = 1;
pub type xcb_place_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_circulate_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub pad1: [u8; 4usize],
    pub place: u8,
    pub pad2: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_circulate_notify_event_t"]
        [::std::mem::size_of::<xcb_circulate_notify_event_t>() - 20usize];
    ["Alignment of xcb_circulate_notify_event_t"]
        [::std::mem::align_of::<xcb_circulate_notify_event_t>() - 4usize];
    ["Offset of field: xcb_circulate_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_circulate_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_circulate_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_circulate_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad1) - 12usize];
    ["Offset of field: xcb_circulate_notify_event_t::place"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, place) - 16usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad2"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad2) - 17usize];
};
pub type xcb_circulate_request_event_t = xcb_circulate_notify_event_t;
pub const xcb_property_t_XCB_PROPERTY_NEW_VALUE: xcb_property_t = 0;
pub const xcb_property_t_XCB_PROPERTY_DELETE: xcb_property_t = 1;
pub type xcb_property_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_property_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub atom: xcb_atom_t,
    pub time: xcb_timestamp_t,
    pub state: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_property_notify_event_t"]
        [::std::mem::size_of::<xcb_property_notify_event_t>() - 20usize];
    ["Alignment of xcb_property_notify_event_t"]
        [::std::mem::align_of::<xcb_property_notify_event_t>() - 4usize];
    ["Offset of field: xcb_property_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_property_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_property_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_property_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_property_notify_event_t::atom"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, atom) - 8usize];
    ["Offset of field: xcb_property_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, time) - 12usize];
    ["Offset of field: xcb_property_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, state) - 16usize];
    ["Offset of field: xcb_property_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, pad1) - 17usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_clear_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub owner: xcb_window_t,
    pub selection: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_clear_event_t"]
        [::std::mem::size_of::<xcb_selection_clear_event_t>() - 16usize];
    ["Alignment of xcb_selection_clear_event_t"]
        [::std::mem::align_of::<xcb_selection_clear_event_t>() - 4usize];
    ["Offset of field: xcb_selection_clear_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_clear_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_clear_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_clear_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_clear_event_t::owner"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, owner) - 8usize];
    ["Offset of field: xcb_selection_clear_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, selection) - 12usize];
};
pub const xcb_time_t_XCB_TIME_CURRENT_TIME: xcb_time_t = 0;
pub type xcb_time_t = ::std::os::raw::c_uint;
pub const XCB_ATOM_NONE: xcb_atom_enum_t = 0;
pub const XCB_ATOM_ANY: xcb_atom_enum_t = 0;
pub const XCB_ATOM_PRIMARY: xcb_atom_enum_t = 1;
pub const XCB_ATOM_SECONDARY: xcb_atom_enum_t = 2;
pub const XCB_ATOM_ARC: xcb_atom_enum_t = 3;
pub const XCB_ATOM_ATOM: xcb_atom_enum_t = 4;
pub const XCB_ATOM_BITMAP: xcb_atom_enum_t = 5;
pub const XCB_ATOM_CARDINAL: xcb_atom_enum_t = 6;
pub const XCB_ATOM_COLORMAP: xcb_atom_enum_t = 7;
pub const XCB_ATOM_CURSOR: xcb_atom_enum_t = 8;
pub const XCB_ATOM_CUT_BUFFER0: xcb_atom_enum_t = 9;
pub const XCB_ATOM_CUT_BUFFER1: xcb_atom_enum_t = 10;
pub const XCB_ATOM_CUT_BUFFER2: xcb_atom_enum_t = 11;
pub const XCB_ATOM_CUT_BUFFER3: xcb_atom_enum_t = 12;
pub const XCB_ATOM_CUT_BUFFER4: xcb_atom_enum_t = 13;
pub const XCB_ATOM_CUT_BUFFER5: xcb_atom_enum_t = 14;
pub const XCB_ATOM_CUT_BUFFER6: xcb_atom_enum_t = 15;
pub const XCB_ATOM_CUT_BUFFER7: xcb_atom_enum_t = 16;
pub const XCB_ATOM_DRAWABLE: xcb_atom_enum_t = 17;
pub const XCB_ATOM_FONT: xcb_atom_enum_t = 18;
pub const XCB_ATOM_INTEGER: xcb_atom_enum_t = 19;
pub const XCB_ATOM_PIXMAP: xcb_atom_enum_t = 20;
pub const XCB_ATOM_POINT: xcb_atom_enum_t = 21;
pub const XCB_ATOM_RECTANGLE: xcb_atom_enum_t = 22;
pub const XCB_ATOM_RESOURCE_MANAGER: xcb_atom_enum_t = 23;
pub const XCB_ATOM_RGB_COLOR_MAP: xcb_atom_enum_t = 24;
pub const XCB_ATOM_RGB_BEST_MAP: xcb_atom_enum_t = 25;
pub const XCB_ATOM_RGB_BLUE_MAP: xcb_atom_enum_t = 26;
pub const XCB_ATOM_RGB_DEFAULT_MAP: xcb_atom_enum_t = 27;
pub const XCB_ATOM_RGB_GRAY_MAP: xcb_atom_enum_t = 28;
pub const XCB_ATOM_RGB_GREEN_MAP: xcb_atom_enum_t = 29;
pub const XCB_ATOM_RGB_RED_MAP: xcb_atom_enum_t = 30;
pub const XCB_ATOM_STRING: xcb_atom_enum_t = 31;
pub const XCB_ATOM_VISUALID: xcb_atom_enum_t = 32;
pub const XCB_ATOM_WINDOW: xcb_atom_enum_t = 33;
pub const XCB_ATOM_WM_COMMAND: xcb_atom_enum_t = 34;
pub const XCB_ATOM_WM_HINTS: xcb_atom_enum_t = 35;
pub const XCB_ATOM_WM_CLIENT_MACHINE: xcb_atom_enum_t = 36;
pub const XCB_ATOM_WM_ICON_NAME: xcb_atom_enum_t = 37;
pub const XCB_ATOM_WM_ICON_SIZE: xcb_atom_enum_t = 38;
pub const XCB_ATOM_WM_NAME: xcb_atom_enum_t = 39;
pub const XCB_ATOM_WM_NORMAL_HINTS: xcb_atom_enum_t = 40;
pub const XCB_ATOM_WM_SIZE_HINTS: xcb_atom_enum_t = 41;
pub const XCB_ATOM_WM_ZOOM_HINTS: xcb_atom_enum_t = 42;
pub const XCB_ATOM_MIN_SPACE: xcb_atom_enum_t = 43;
pub const XCB_ATOM_NORM_SPACE: xcb_atom_enum_t = 44;
pub const XCB_ATOM_MAX_SPACE: xcb_atom_enum_t = 45;
pub const XCB_ATOM_END_SPACE: xcb_atom_enum_t = 46;
pub const XCB_ATOM_SUPERSCRIPT_X: xcb_atom_enum_t = 47;
pub const XCB_ATOM_SUPERSCRIPT_Y: xcb_atom_enum_t = 48;
pub const XCB_ATOM_SUBSCRIPT_X: xcb_atom_enum_t = 49;
pub const XCB_ATOM_SUBSCRIPT_Y: xcb_atom_enum_t = 50;
pub const XCB_ATOM_UNDERLINE_POSITION: xcb_atom_enum_t = 51;
pub const XCB_ATOM_UNDERLINE_THICKNESS: xcb_atom_enum_t = 52;
pub const XCB_ATOM_STRIKEOUT_ASCENT: xcb_atom_enum_t = 53;
pub const XCB_ATOM_STRIKEOUT_DESCENT: xcb_atom_enum_t = 54;
pub const XCB_ATOM_ITALIC_ANGLE: xcb_atom_enum_t = 55;
pub const XCB_ATOM_X_HEIGHT: xcb_atom_enum_t = 56;
pub const XCB_ATOM_QUAD_WIDTH: xcb_atom_enum_t = 57;
pub const XCB_ATOM_WEIGHT: xcb_atom_enum_t = 58;
pub const XCB_ATOM_POINT_SIZE: xcb_atom_enum_t = 59;
pub const XCB_ATOM_RESOLUTION: xcb_atom_enum_t = 60;
pub const XCB_ATOM_COPYRIGHT: xcb_atom_enum_t = 61;
pub const XCB_ATOM_NOTICE: xcb_atom_enum_t = 62;
pub const XCB_ATOM_FONT_NAME: xcb_atom_enum_t = 63;
pub const XCB_ATOM_FAMILY_NAME: xcb_atom_enum_t = 64;
pub const XCB_ATOM_FULL_NAME: xcb_atom_enum_t = 65;
pub const XCB_ATOM_CAP_HEIGHT: xcb_atom_enum_t = 66;
pub const XCB_ATOM_WM_CLASS: xcb_atom_enum_t = 67;
pub const XCB_ATOM_WM_TRANSIENT_FOR: xcb_atom_enum_t = 68;
pub type xcb_atom_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub owner: xcb_window_t,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_request_event_t"]
        [::std::mem::size_of::<xcb_selection_request_event_t>() - 28usize];
    ["Alignment of xcb_selection_request_event_t"]
        [::std::mem::align_of::<xcb_selection_request_event_t>() - 4usize];
    ["Offset of field: xcb_selection_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_request_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_request_event_t::owner"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, owner) - 8usize];
    ["Offset of field: xcb_selection_request_event_t::requestor"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, requestor) - 12usize];
    ["Offset of field: xcb_selection_request_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, selection) - 16usize];
    ["Offset of field: xcb_selection_request_event_t::target"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, target) - 20usize];
    ["Offset of field: xcb_selection_request_event_t::property"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, property) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_notify_event_t"]
        [::std::mem::size_of::<xcb_selection_notify_event_t>() - 24usize];
    ["Alignment of xcb_selection_notify_event_t"]
        [::std::mem::align_of::<xcb_selection_notify_event_t>() - 4usize];
    ["Offset of field: xcb_selection_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_notify_event_t::requestor"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, requestor) - 8usize];
    ["Offset of field: xcb_selection_notify_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, selection) - 12usize];
    ["Offset of field: xcb_selection_notify_event_t::target"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, target) - 16usize];
    ["Offset of field: xcb_selection_notify_event_t::property"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, property) - 20usize];
};
pub const xcb_colormap_state_t_XCB_COLORMAP_STATE_UNINSTALLED: xcb_colormap_state_t = 0;
pub const xcb_colormap_state_t_XCB_COLORMAP_STATE_INSTALLED: xcb_colormap_state_t = 1;
pub type xcb_colormap_state_t = ::std::os::raw::c_uint;
pub const xcb_colormap_enum_t_XCB_COLORMAP_NONE: xcb_colormap_enum_t = 0;
pub type xcb_colormap_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_colormap_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub colormap: xcb_colormap_t,
    pub _new: u8,
    pub state: u8,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_colormap_notify_event_t"]
        [::std::mem::size_of::<xcb_colormap_notify_event_t>() - 16usize];
    ["Alignment of xcb_colormap_notify_event_t"]
        [::std::mem::align_of::<xcb_colormap_notify_event_t>() - 4usize];
    ["Offset of field: xcb_colormap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_colormap_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_colormap_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_colormap_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_colormap_notify_event_t::colormap"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, colormap) - 8usize];
    ["Offset of field: xcb_colormap_notify_event_t::_new"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, _new) - 12usize];
    ["Offset of field: xcb_colormap_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, state) - 13usize];
    ["Offset of field: xcb_colormap_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, pad1) - 14usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union xcb_client_message_data_t {
    pub data8: [u8; 20usize],
    pub data16: [u16; 10usize],
    pub data32: [u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_data_t"]
        [::std::mem::size_of::<xcb_client_message_data_t>() - 20usize];
    ["Alignment of xcb_client_message_data_t"]
        [::std::mem::align_of::<xcb_client_message_data_t>() - 4usize];
    ["Offset of field: xcb_client_message_data_t::data8"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data8) - 0usize];
    ["Offset of field: xcb_client_message_data_t::data16"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data16) - 0usize];
    ["Offset of field: xcb_client_message_data_t::data32"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_client_message_data_iterator_t {
    pub data: *mut xcb_client_message_data_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_data_iterator_t"]
        [::std::mem::size_of::<xcb_client_message_data_iterator_t>() - 16usize];
    ["Alignment of xcb_client_message_data_iterator_t"]
        [::std::mem::align_of::<xcb_client_message_data_iterator_t>() - 8usize];
    ["Offset of field: xcb_client_message_data_iterator_t::data"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, data) - 0usize];
    ["Offset of field: xcb_client_message_data_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_client_message_data_iterator_t::index"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xcb_client_message_event_t {
    pub response_type: u8,
    pub format: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub type_: xcb_atom_t,
    pub data: xcb_client_message_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_event_t"]
        [::std::mem::size_of::<xcb_client_message_event_t>() - 32usize];
    ["Alignment of xcb_client_message_event_t"]
        [::std::mem::align_of::<xcb_client_message_event_t>() - 4usize];
    ["Offset of field: xcb_client_message_event_t::response_type"]
        [::std::mem::offset_of!(xcb_client_message_event_t, response_type) - 0usize];
    ["Offset of field: xcb_client_message_event_t::format"]
        [::std::mem::offset_of!(xcb_client_message_event_t, format) - 1usize];
    ["Offset of field: xcb_client_message_event_t::sequence"]
        [::std::mem::offset_of!(xcb_client_message_event_t, sequence) - 2usize];
    ["Offset of field: xcb_client_message_event_t::window"]
        [::std::mem::offset_of!(xcb_client_message_event_t, window) - 4usize];
    ["Offset of field: xcb_client_message_event_t::type_"]
        [::std::mem::offset_of!(xcb_client_message_event_t, type_) - 8usize];
    ["Offset of field: xcb_client_message_event_t::data"]
        [::std::mem::offset_of!(xcb_client_message_event_t, data) - 12usize];
};
pub const xcb_mapping_t_XCB_MAPPING_MODIFIER: xcb_mapping_t = 0;
pub const xcb_mapping_t_XCB_MAPPING_KEYBOARD: xcb_mapping_t = 1;
pub const xcb_mapping_t_XCB_MAPPING_POINTER: xcb_mapping_t = 2;
pub type xcb_mapping_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_mapping_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub request: u8,
    pub first_keycode: xcb_keycode_t,
    pub count: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_mapping_notify_event_t"]
        [::std::mem::size_of::<xcb_mapping_notify_event_t>() - 8usize];
    ["Alignment of xcb_mapping_notify_event_t"]
        [::std::mem::align_of::<xcb_mapping_notify_event_t>() - 2usize];
    ["Offset of field: xcb_mapping_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_mapping_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_mapping_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_mapping_notify_event_t::request"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, request) - 4usize];
    ["Offset of field: xcb_mapping_notify_event_t::first_keycode"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, first_keycode) - 5usize];
    ["Offset of field: xcb_mapping_notify_event_t::count"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, count) - 6usize];
    ["Offset of field: xcb_mapping_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, pad1) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ge_generic_event_t {
    pub response_type: u8,
    pub extension: u8,
    pub sequence: u16,
    pub length: u32,
    pub event_type: u16,
    pub pad0: [u8; 22usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ge_generic_event_t"][::std::mem::size_of::<xcb_ge_generic_event_t>() - 36usize];
    ["Alignment of xcb_ge_generic_event_t"]
        [::std::mem::align_of::<xcb_ge_generic_event_t>() - 4usize];
    ["Offset of field: xcb_ge_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_ge_generic_event_t::extension"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, extension) - 1usize];
    ["Offset of field: xcb_ge_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_ge_generic_event_t::length"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, length) - 4usize];
    ["Offset of field: xcb_ge_generic_event_t::event_type"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, event_type) - 8usize];
    ["Offset of field: xcb_ge_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, pad0) - 10usize];
    ["Offset of field: xcb_ge_generic_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_request_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub bad_value: u32,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_request_error_t"][::std::mem::size_of::<xcb_request_error_t>() - 12usize];
    ["Alignment of xcb_request_error_t"][::std::mem::align_of::<xcb_request_error_t>() - 4usize];
    ["Offset of field: xcb_request_error_t::response_type"]
        [::std::mem::offset_of!(xcb_request_error_t, response_type) - 0usize];
    ["Offset of field: xcb_request_error_t::error_code"]
        [::std::mem::offset_of!(xcb_request_error_t, error_code) - 1usize];
    ["Offset of field: xcb_request_error_t::sequence"]
        [::std::mem::offset_of!(xcb_request_error_t, sequence) - 2usize];
    ["Offset of field: xcb_request_error_t::bad_value"]
        [::std::mem::offset_of!(xcb_request_error_t, bad_value) - 4usize];
    ["Offset of field: xcb_request_error_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_request_error_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_request_error_t::major_opcode"]
        [::std::mem::offset_of!(xcb_request_error_t, major_opcode) - 10usize];
    ["Offset of field: xcb_request_error_t::pad0"]
        [::std::mem::offset_of!(xcb_request_error_t, pad0) - 11usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_value_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub bad_value: u32,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_value_error_t"][::std::mem::size_of::<xcb_value_error_t>() - 12usize];
    ["Alignment of xcb_value_error_t"][::std::mem::align_of::<xcb_value_error_t>() - 4usize];
    ["Offset of field: xcb_value_error_t::response_type"]
        [::std::mem::offset_of!(xcb_value_error_t, response_type) - 0usize];
    ["Offset of field: xcb_value_error_t::error_code"]
        [::std::mem::offset_of!(xcb_value_error_t, error_code) - 1usize];
    ["Offset of field: xcb_value_error_t::sequence"]
        [::std::mem::offset_of!(xcb_value_error_t, sequence) - 2usize];
    ["Offset of field: xcb_value_error_t::bad_value"]
        [::std::mem::offset_of!(xcb_value_error_t, bad_value) - 4usize];
    ["Offset of field: xcb_value_error_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_value_error_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_value_error_t::major_opcode"]
        [::std::mem::offset_of!(xcb_value_error_t, major_opcode) - 10usize];
    ["Offset of field: xcb_value_error_t::pad0"]
        [::std::mem::offset_of!(xcb_value_error_t, pad0) - 11usize];
};
pub type xcb_window_error_t = xcb_value_error_t;
pub type xcb_pixmap_error_t = xcb_value_error_t;
pub type xcb_atom_error_t = xcb_value_error_t;
pub type xcb_cursor_error_t = xcb_value_error_t;
pub type xcb_font_error_t = xcb_value_error_t;
pub type xcb_match_error_t = xcb_request_error_t;
pub type xcb_drawable_error_t = xcb_value_error_t;
pub type xcb_access_error_t = xcb_request_error_t;
pub type xcb_alloc_error_t = xcb_request_error_t;
pub type xcb_colormap_error_t = xcb_value_error_t;
pub type xcb_g_context_error_t = xcb_value_error_t;
pub type xcb_id_choice_error_t = xcb_value_error_t;
pub type xcb_name_error_t = xcb_request_error_t;
pub type xcb_length_error_t = xcb_request_error_t;
pub type xcb_implementation_error_t = xcb_request_error_t;
pub const XCB_WINDOW_CLASS_COPY_FROM_PARENT: xcb_window_class_t = 0;
pub const XCB_WINDOW_CLASS_INPUT_OUTPUT: xcb_window_class_t = 1;
pub const XCB_WINDOW_CLASS_INPUT_ONLY: xcb_window_class_t = 2;
pub type xcb_window_class_t = ::std::os::raw::c_uint;
pub const XCB_CW_BACK_PIXMAP: xcb_cw_t = 1;
pub const XCB_CW_BACK_PIXEL: xcb_cw_t = 2;
pub const XCB_CW_BORDER_PIXMAP: xcb_cw_t = 4;
pub const XCB_CW_BORDER_PIXEL: xcb_cw_t = 8;
pub const XCB_CW_BIT_GRAVITY: xcb_cw_t = 16;
pub const XCB_CW_WIN_GRAVITY: xcb_cw_t = 32;
pub const XCB_CW_BACKING_STORE: xcb_cw_t = 64;
pub const XCB_CW_BACKING_PLANES: xcb_cw_t = 128;
pub const XCB_CW_BACKING_PIXEL: xcb_cw_t = 256;
pub const XCB_CW_OVERRIDE_REDIRECT: xcb_cw_t = 512;
pub const XCB_CW_SAVE_UNDER: xcb_cw_t = 1024;
pub const XCB_CW_EVENT_MASK: xcb_cw_t = 2048;
pub const XCB_CW_DONT_PROPAGATE: xcb_cw_t = 4096;
pub const XCB_CW_COLORMAP: xcb_cw_t = 8192;
pub const XCB_CW_CURSOR: xcb_cw_t = 16384;
pub type xcb_cw_t = ::std::os::raw::c_uint;
pub const XCB_BACK_PIXMAP_NONE: xcb_back_pixmap_t = 0;
pub const XCB_BACK_PIXMAP_PARENT_RELATIVE: xcb_back_pixmap_t = 1;
pub type xcb_back_pixmap_t = ::std::os::raw::c_uint;
pub const XCB_GRAVITY_BIT_FORGET: xcb_gravity_t = 0;
pub const XCB_GRAVITY_WIN_UNMAP: xcb_gravity_t = 0;
pub const XCB_GRAVITY_NORTH_WEST: xcb_gravity_t = 1;
pub const XCB_GRAVITY_NORTH: xcb_gravity_t = 2;
pub const XCB_GRAVITY_NORTH_EAST: xcb_gravity_t = 3;
pub const XCB_GRAVITY_WEST: xcb_gravity_t = 4;
pub const XCB_GRAVITY_CENTER: xcb_gravity_t = 5;
pub const XCB_GRAVITY_EAST: xcb_gravity_t = 6;
pub const XCB_GRAVITY_SOUTH_WEST: xcb_gravity_t = 7;
pub const XCB_GRAVITY_SOUTH: xcb_gravity_t = 8;
pub const XCB_GRAVITY_SOUTH_EAST: xcb_gravity_t = 9;
pub const XCB_GRAVITY_STATIC: xcb_gravity_t = 10;
pub type xcb_gravity_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_window_value_list_t {
    pub background_pixmap: xcb_pixmap_t,
    pub background_pixel: u32,
    pub border_pixmap: xcb_pixmap_t,
    pub border_pixel: u32,
    pub bit_gravity: u32,
    pub win_gravity: u32,
    pub backing_store: u32,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub override_redirect: xcb_bool32_t,
    pub save_under: xcb_bool32_t,
    pub event_mask: u32,
    pub do_not_propogate_mask: u32,
    pub colormap: xcb_colormap_t,
    pub cursor: xcb_cursor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_window_value_list_t"]
        [::std::mem::size_of::<xcb_create_window_value_list_t>() - 60usize];
    ["Alignment of xcb_create_window_value_list_t"]
        [::std::mem::align_of::<xcb_create_window_value_list_t>() - 4usize];
    ["Offset of field: xcb_create_window_value_list_t::background_pixmap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, background_pixmap) - 0usize];
    ["Offset of field: xcb_create_window_value_list_t::background_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, background_pixel) - 4usize];
    ["Offset of field: xcb_create_window_value_list_t::border_pixmap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, border_pixmap) - 8usize];
    ["Offset of field: xcb_create_window_value_list_t::border_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, border_pixel) - 12usize];
    ["Offset of field: xcb_create_window_value_list_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, bit_gravity) - 16usize];
    ["Offset of field: xcb_create_window_value_list_t::win_gravity"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, win_gravity) - 20usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_store"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_store) - 24usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_planes"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_planes) - 28usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_pixel) - 32usize];
    ["Offset of field: xcb_create_window_value_list_t::override_redirect"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, override_redirect) - 36usize];
    ["Offset of field: xcb_create_window_value_list_t::save_under"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, save_under) - 40usize];
    ["Offset of field: xcb_create_window_value_list_t::event_mask"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, event_mask) - 44usize];
    ["Offset of field: xcb_create_window_value_list_t::do_not_propogate_mask"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, do_not_propogate_mask) - 48usize];
    ["Offset of field: xcb_create_window_value_list_t::colormap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, colormap) - 52usize];
    ["Offset of field: xcb_create_window_value_list_t::cursor"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, cursor) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_window_request_t {
    pub major_opcode: u8,
    pub depth: u8,
    pub length: u16,
    pub wid: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub _class: u16,
    pub visual: xcb_visualid_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_window_request_t"]
        [::std::mem::size_of::<xcb_create_window_request_t>() - 32usize];
    ["Alignment of xcb_create_window_request_t"]
        [::std::mem::align_of::<xcb_create_window_request_t>() - 4usize];
    ["Offset of field: xcb_create_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_create_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_create_window_request_t::depth"]
        [::std::mem::offset_of!(xcb_create_window_request_t, depth) - 1usize];
    ["Offset of field: xcb_create_window_request_t::length"]
        [::std::mem::offset_of!(xcb_create_window_request_t, length) - 2usize];
    ["Offset of field: xcb_create_window_request_t::wid"]
        [::std::mem::offset_of!(xcb_create_window_request_t, wid) - 4usize];
    ["Offset of field: xcb_create_window_request_t::parent"]
        [::std::mem::offset_of!(xcb_create_window_request_t, parent) - 8usize];
    ["Offset of field: xcb_create_window_request_t::x"]
        [::std::mem::offset_of!(xcb_create_window_request_t, x) - 12usize];
    ["Offset of field: xcb_create_window_request_t::y"]
        [::std::mem::offset_of!(xcb_create_window_request_t, y) - 14usize];
    ["Offset of field: xcb_create_window_request_t::width"]
        [::std::mem::offset_of!(xcb_create_window_request_t, width) - 16usize];
    ["Offset of field: xcb_create_window_request_t::height"]
        [::std::mem::offset_of!(xcb_create_window_request_t, height) - 18usize];
    ["Offset of field: xcb_create_window_request_t::border_width"]
        [::std::mem::offset_of!(xcb_create_window_request_t, border_width) - 20usize];
    ["Offset of field: xcb_create_window_request_t::_class"]
        [::std::mem::offset_of!(xcb_create_window_request_t, _class) - 22usize];
    ["Offset of field: xcb_create_window_request_t::visual"]
        [::std::mem::offset_of!(xcb_create_window_request_t, visual) - 24usize];
    ["Offset of field: xcb_create_window_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_create_window_request_t, value_mask) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_window_attributes_value_list_t {
    pub background_pixmap: xcb_pixmap_t,
    pub background_pixel: u32,
    pub border_pixmap: xcb_pixmap_t,
    pub border_pixel: u32,
    pub bit_gravity: u32,
    pub win_gravity: u32,
    pub backing_store: u32,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub override_redirect: xcb_bool32_t,
    pub save_under: xcb_bool32_t,
    pub event_mask: u32,
    pub do_not_propogate_mask: u32,
    pub colormap: xcb_colormap_t,
    pub cursor: xcb_cursor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_window_attributes_value_list_t"]
        [::std::mem::size_of::<xcb_change_window_attributes_value_list_t>() - 60usize];
    ["Alignment of xcb_change_window_attributes_value_list_t"]
        [::std::mem::align_of::<xcb_change_window_attributes_value_list_t>() - 4usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::background_pixmap"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        background_pixmap
    ) - 0usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::background_pixel"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        background_pixel
    ) - 4usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::border_pixmap"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, border_pixmap) - 8usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::border_pixel"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, border_pixel) - 12usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, bit_gravity) - 16usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::win_gravity"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, win_gravity) - 20usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_store"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_store
    ) - 24usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_planes"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_planes
    ) - 28usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_pixel"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_pixel
    ) - 32usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::override_redirect"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        override_redirect
    ) - 36usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::save_under"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, save_under) - 40usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::event_mask"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, event_mask) - 44usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::do_not_propogate_mask"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        do_not_propogate_mask
    )
        - 48usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::colormap"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, colormap) - 52usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::cursor"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, cursor) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_window_attributes_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_window_attributes_request_t"]
        [::std::mem::size_of::<xcb_change_window_attributes_request_t>() - 12usize];
    ["Alignment of xcb_change_window_attributes_request_t"]
        [::std::mem::align_of::<xcb_change_window_attributes_request_t>() - 4usize];
    ["Offset of field: xcb_change_window_attributes_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_window_attributes_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, pad0) - 1usize];
    ["Offset of field: xcb_change_window_attributes_request_t::length"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, length) - 2usize];
    ["Offset of field: xcb_change_window_attributes_request_t::window"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, window) - 4usize];
    ["Offset of field: xcb_change_window_attributes_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, value_mask) - 8usize];
};
pub const xcb_map_state_t_XCB_MAP_STATE_UNMAPPED: xcb_map_state_t = 0;
pub const xcb_map_state_t_XCB_MAP_STATE_UNVIEWABLE: xcb_map_state_t = 1;
pub const xcb_map_state_t_XCB_MAP_STATE_VIEWABLE: xcb_map_state_t = 2;
pub type xcb_map_state_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_cookie_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_cookie_t>() - 4usize];
    ["Alignment of xcb_get_window_attributes_cookie_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_window_attributes_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_request_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_request_t>() - 8usize];
    ["Alignment of xcb_get_window_attributes_request_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_request_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_window_attributes_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_window_attributes_request_t::length"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, length) - 2usize];
    ["Offset of field: xcb_get_window_attributes_request_t::window"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_reply_t {
    pub response_type: u8,
    pub backing_store: u8,
    pub sequence: u16,
    pub length: u32,
    pub visual: xcb_visualid_t,
    pub _class: u16,
    pub bit_gravity: u8,
    pub win_gravity: u8,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub save_under: u8,
    pub map_is_installed: u8,
    pub map_state: u8,
    pub override_redirect: u8,
    pub colormap: xcb_colormap_t,
    pub all_event_masks: u32,
    pub your_event_mask: u32,
    pub do_not_propagate_mask: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_reply_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_reply_t>() - 44usize];
    ["Alignment of xcb_get_window_attributes_reply_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_reply_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_store"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_store) - 1usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::visual"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, visual) - 8usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::_class"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, _class) - 12usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, bit_gravity) - 14usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::win_gravity"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, win_gravity) - 15usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_planes"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_planes) - 16usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_pixel"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_pixel) - 20usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::save_under"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, save_under) - 24usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::map_is_installed"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, map_is_installed) - 25usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::map_state"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, map_state) - 26usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::override_redirect"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, override_redirect) - 27usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::colormap"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, colormap) - 28usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::all_event_masks"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, all_event_masks) - 32usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::your_event_mask"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, your_event_mask) - 36usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::do_not_propagate_mask"][::std::mem::offset_of!(
        xcb_get_window_attributes_reply_t,
        do_not_propagate_mask
    ) - 40usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, pad0) - 42usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_window_request_t"]
        [::std::mem::size_of::<xcb_destroy_window_request_t>() - 8usize];
    ["Alignment of xcb_destroy_window_request_t"]
        [::std::mem::align_of::<xcb_destroy_window_request_t>() - 4usize];
    ["Offset of field: xcb_destroy_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_destroy_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_window_request_t::length"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, length) - 2usize];
    ["Offset of field: xcb_destroy_window_request_t::window"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_subwindows_request_t"]
        [::std::mem::size_of::<xcb_destroy_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_destroy_subwindows_request_t"]
        [::std::mem::align_of::<xcb_destroy_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, window) - 4usize];
};
pub const xcb_set_mode_t_XCB_SET_MODE_INSERT: xcb_set_mode_t = 0;
pub const xcb_set_mode_t_XCB_SET_MODE_DELETE: xcb_set_mode_t = 1;
pub type xcb_set_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_save_set_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_save_set_request_t"]
        [::std::mem::size_of::<xcb_change_save_set_request_t>() - 8usize];
    ["Alignment of xcb_change_save_set_request_t"]
        [::std::mem::align_of::<xcb_change_save_set_request_t>() - 4usize];
    ["Offset of field: xcb_change_save_set_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_save_set_request_t::mode"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, mode) - 1usize];
    ["Offset of field: xcb_change_save_set_request_t::length"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, length) - 2usize];
    ["Offset of field: xcb_change_save_set_request_t::window"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_reparent_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_reparent_window_request_t"]
        [::std::mem::size_of::<xcb_reparent_window_request_t>() - 16usize];
    ["Alignment of xcb_reparent_window_request_t"]
        [::std::mem::align_of::<xcb_reparent_window_request_t>() - 4usize];
    ["Offset of field: xcb_reparent_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_reparent_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_reparent_window_request_t::length"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, length) - 2usize];
    ["Offset of field: xcb_reparent_window_request_t::window"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, window) - 4usize];
    ["Offset of field: xcb_reparent_window_request_t::parent"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, parent) - 8usize];
    ["Offset of field: xcb_reparent_window_request_t::x"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, x) - 12usize];
    ["Offset of field: xcb_reparent_window_request_t::y"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_window_request_t"]
        [::std::mem::size_of::<xcb_map_window_request_t>() - 8usize];
    ["Alignment of xcb_map_window_request_t"]
        [::std::mem::align_of::<xcb_map_window_request_t>() - 4usize];
    ["Offset of field: xcb_map_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_map_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_map_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_map_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_map_window_request_t::length"]
        [::std::mem::offset_of!(xcb_map_window_request_t, length) - 2usize];
    ["Offset of field: xcb_map_window_request_t::window"]
        [::std::mem::offset_of!(xcb_map_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_subwindows_request_t"]
        [::std::mem::size_of::<xcb_map_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_map_subwindows_request_t"]
        [::std::mem::align_of::<xcb_map_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_map_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_map_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_map_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_map_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_window_request_t"]
        [::std::mem::size_of::<xcb_unmap_window_request_t>() - 8usize];
    ["Alignment of xcb_unmap_window_request_t"]
        [::std::mem::align_of::<xcb_unmap_window_request_t>() - 4usize];
    ["Offset of field: xcb_unmap_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_unmap_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_window_request_t::length"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, length) - 2usize];
    ["Offset of field: xcb_unmap_window_request_t::window"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_subwindows_request_t"]
        [::std::mem::size_of::<xcb_unmap_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_unmap_subwindows_request_t"]
        [::std::mem::align_of::<xcb_unmap_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, window) - 4usize];
};
pub const XCB_CONFIG_WINDOW_X: xcb_config_window_t = 1;
pub const XCB_CONFIG_WINDOW_Y: xcb_config_window_t = 2;
pub const XCB_CONFIG_WINDOW_WIDTH: xcb_config_window_t = 4;
pub const XCB_CONFIG_WINDOW_HEIGHT: xcb_config_window_t = 8;
pub const XCB_CONFIG_WINDOW_BORDER_WIDTH: xcb_config_window_t = 16;
pub const XCB_CONFIG_WINDOW_SIBLING: xcb_config_window_t = 32;
pub const XCB_CONFIG_WINDOW_STACK_MODE: xcb_config_window_t = 64;
pub type xcb_config_window_t = ::std::os::raw::c_uint;
pub const XCB_STACK_MODE_ABOVE: xcb_stack_mode_t = 0;
pub const XCB_STACK_MODE_BELOW: xcb_stack_mode_t = 1;
pub const XCB_STACK_MODE_TOP_IF: xcb_stack_mode_t = 2;
pub const XCB_STACK_MODE_BOTTOM_IF: xcb_stack_mode_t = 3;
pub const XCB_STACK_MODE_OPPOSITE: xcb_stack_mode_t = 4;
pub type xcb_stack_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_window_value_list_t {
    pub x: i32,
    pub y: i32,
    pub width: u32,
    pub height: u32,
    pub border_width: u32,
    pub sibling: xcb_window_t,
    pub stack_mode: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_window_value_list_t"]
        [::std::mem::size_of::<xcb_configure_window_value_list_t>() - 28usize];
    ["Alignment of xcb_configure_window_value_list_t"]
        [::std::mem::align_of::<xcb_configure_window_value_list_t>() - 4usize];
    ["Offset of field: xcb_configure_window_value_list_t::x"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, x) - 0usize];
    ["Offset of field: xcb_configure_window_value_list_t::y"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, y) - 4usize];
    ["Offset of field: xcb_configure_window_value_list_t::width"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, width) - 8usize];
    ["Offset of field: xcb_configure_window_value_list_t::height"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, height) - 12usize];
    ["Offset of field: xcb_configure_window_value_list_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, border_width) - 16usize];
    ["Offset of field: xcb_configure_window_value_list_t::sibling"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, sibling) - 20usize];
    ["Offset of field: xcb_configure_window_value_list_t::stack_mode"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, stack_mode) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub value_mask: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_window_request_t"]
        [::std::mem::size_of::<xcb_configure_window_request_t>() - 12usize];
    ["Alignment of xcb_configure_window_request_t"]
        [::std::mem::align_of::<xcb_configure_window_request_t>() - 4usize];
    ["Offset of field: xcb_configure_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_configure_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_configure_window_request_t::length"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, length) - 2usize];
    ["Offset of field: xcb_configure_window_request_t::window"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, window) - 4usize];
    ["Offset of field: xcb_configure_window_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, value_mask) - 8usize];
    ["Offset of field: xcb_configure_window_request_t::pad1"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, pad1) - 10usize];
};
pub const xcb_circulate_t_XCB_CIRCULATE_RAISE_LOWEST: xcb_circulate_t = 0;
pub const xcb_circulate_t_XCB_CIRCULATE_LOWER_HIGHEST: xcb_circulate_t = 1;
pub type xcb_circulate_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_circulate_window_request_t {
    pub major_opcode: u8,
    pub direction: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_circulate_window_request_t"]
        [::std::mem::size_of::<xcb_circulate_window_request_t>() - 8usize];
    ["Alignment of xcb_circulate_window_request_t"]
        [::std::mem::align_of::<xcb_circulate_window_request_t>() - 4usize];
    ["Offset of field: xcb_circulate_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_circulate_window_request_t::direction"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, direction) - 1usize];
    ["Offset of field: xcb_circulate_window_request_t::length"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, length) - 2usize];
    ["Offset of field: xcb_circulate_window_request_t::window"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_cookie_t"]
        [::std::mem::size_of::<xcb_get_geometry_cookie_t>() - 4usize];
    ["Alignment of xcb_get_geometry_cookie_t"]
        [::std::mem::align_of::<xcb_get_geometry_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_geometry_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_request_t"]
        [::std::mem::size_of::<xcb_get_geometry_request_t>() - 8usize];
    ["Alignment of xcb_get_geometry_request_t"]
        [::std::mem::align_of::<xcb_get_geometry_request_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_geometry_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_geometry_request_t::length"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, length) - 2usize];
    ["Offset of field: xcb_get_geometry_request_t::drawable"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, drawable) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_reply_t {
    pub response_type: u8,
    pub depth: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_reply_t"]
        [::std::mem::size_of::<xcb_get_geometry_reply_t>() - 24usize];
    ["Alignment of xcb_get_geometry_reply_t"]
        [::std::mem::align_of::<xcb_get_geometry_reply_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_geometry_reply_t::depth"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, depth) - 1usize];
    ["Offset of field: xcb_get_geometry_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_geometry_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_geometry_reply_t::root"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, root) - 8usize];
    ["Offset of field: xcb_get_geometry_reply_t::x"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, x) - 12usize];
    ["Offset of field: xcb_get_geometry_reply_t::y"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, y) - 14usize];
    ["Offset of field: xcb_get_geometry_reply_t::width"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, width) - 16usize];
    ["Offset of field: xcb_get_geometry_reply_t::height"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, height) - 18usize];
    ["Offset of field: xcb_get_geometry_reply_t::border_width"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, border_width) - 20usize];
    ["Offset of field: xcb_get_geometry_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, pad0) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_cookie_t"][::std::mem::size_of::<xcb_query_tree_cookie_t>() - 4usize];
    ["Alignment of xcb_query_tree_cookie_t"]
        [::std::mem::align_of::<xcb_query_tree_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_tree_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_tree_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_request_t"]
        [::std::mem::size_of::<xcb_query_tree_request_t>() - 8usize];
    ["Alignment of xcb_query_tree_request_t"]
        [::std::mem::align_of::<xcb_query_tree_request_t>() - 4usize];
    ["Offset of field: xcb_query_tree_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_tree_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_tree_request_t::length"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, length) - 2usize];
    ["Offset of field: xcb_query_tree_request_t::window"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub parent: xcb_window_t,
    pub children_len: u16,
    pub pad1: [u8; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_reply_t"][::std::mem::size_of::<xcb_query_tree_reply_t>() - 32usize];
    ["Alignment of xcb_query_tree_reply_t"]
        [::std::mem::align_of::<xcb_query_tree_reply_t>() - 4usize];
    ["Offset of field: xcb_query_tree_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_tree_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_query_tree_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_tree_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_tree_reply_t::root"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, root) - 8usize];
    ["Offset of field: xcb_query_tree_reply_t::parent"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, parent) - 12usize];
    ["Offset of field: xcb_query_tree_reply_t::children_len"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, children_len) - 16usize];
    ["Offset of field: xcb_query_tree_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, pad1) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_cookie_t"]
        [::std::mem::size_of::<xcb_intern_atom_cookie_t>() - 4usize];
    ["Alignment of xcb_intern_atom_cookie_t"]
        [::std::mem::align_of::<xcb_intern_atom_cookie_t>() - 4usize];
    ["Offset of field: xcb_intern_atom_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_intern_atom_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_request_t {
    pub major_opcode: u8,
    pub only_if_exists: u8,
    pub length: u16,
    pub name_len: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_request_t"]
        [::std::mem::size_of::<xcb_intern_atom_request_t>() - 8usize];
    ["Alignment of xcb_intern_atom_request_t"]
        [::std::mem::align_of::<xcb_intern_atom_request_t>() - 2usize];
    ["Offset of field: xcb_intern_atom_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_intern_atom_request_t::only_if_exists"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, only_if_exists) - 1usize];
    ["Offset of field: xcb_intern_atom_request_t::length"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, length) - 2usize];
    ["Offset of field: xcb_intern_atom_request_t::name_len"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, name_len) - 4usize];
    ["Offset of field: xcb_intern_atom_request_t::pad0"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, pad0) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub atom: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_reply_t"][::std::mem::size_of::<xcb_intern_atom_reply_t>() - 12usize];
    ["Alignment of xcb_intern_atom_reply_t"]
        [::std::mem::align_of::<xcb_intern_atom_reply_t>() - 4usize];
    ["Offset of field: xcb_intern_atom_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_intern_atom_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_intern_atom_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_intern_atom_reply_t::length"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, length) - 4usize];
    ["Offset of field: xcb_intern_atom_reply_t::atom"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, atom) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_cookie_t"]
        [::std::mem::size_of::<xcb_get_atom_name_cookie_t>() - 4usize];
    ["Alignment of xcb_get_atom_name_cookie_t"]
        [::std::mem::align_of::<xcb_get_atom_name_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_atom_name_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub atom: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_request_t"]
        [::std::mem::size_of::<xcb_get_atom_name_request_t>() - 8usize];
    ["Alignment of xcb_get_atom_name_request_t"]
        [::std::mem::align_of::<xcb_get_atom_name_request_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_atom_name_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_atom_name_request_t::length"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, length) - 2usize];
    ["Offset of field: xcb_get_atom_name_request_t::atom"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, atom) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub name_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_reply_t"]
        [::std::mem::size_of::<xcb_get_atom_name_reply_t>() - 32usize];
    ["Alignment of xcb_get_atom_name_reply_t"]
        [::std::mem::align_of::<xcb_get_atom_name_reply_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_atom_name_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_atom_name_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_atom_name_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_atom_name_reply_t::name_len"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, name_len) - 8usize];
    ["Offset of field: xcb_get_atom_name_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, pad1) - 10usize];
};
pub const XCB_PROP_MODE_REPLACE: xcb_prop_mode_t = 0;
pub const XCB_PROP_MODE_PREPEND: xcb_prop_mode_t = 1;
pub const XCB_PROP_MODE_APPEND: xcb_prop_mode_t = 2;
pub type xcb_prop_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_property_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
    pub type_: xcb_atom_t,
    pub format: u8,
    pub pad0: [u8; 3usize],
    pub data_len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_property_request_t"]
        [::std::mem::size_of::<xcb_change_property_request_t>() - 24usize];
    ["Alignment of xcb_change_property_request_t"]
        [::std::mem::align_of::<xcb_change_property_request_t>() - 4usize];
    ["Offset of field: xcb_change_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_property_request_t::mode"]
        [::std::mem::offset_of!(xcb_change_property_request_t, mode) - 1usize];
    ["Offset of field: xcb_change_property_request_t::length"]
        [::std::mem::offset_of!(xcb_change_property_request_t, length) - 2usize];
    ["Offset of field: xcb_change_property_request_t::window"]
        [::std::mem::offset_of!(xcb_change_property_request_t, window) - 4usize];
    ["Offset of field: xcb_change_property_request_t::property"]
        [::std::mem::offset_of!(xcb_change_property_request_t, property) - 8usize];
    ["Offset of field: xcb_change_property_request_t::type_"]
        [::std::mem::offset_of!(xcb_change_property_request_t, type_) - 12usize];
    ["Offset of field: xcb_change_property_request_t::format"]
        [::std::mem::offset_of!(xcb_change_property_request_t, format) - 16usize];
    ["Offset of field: xcb_change_property_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_property_request_t, pad0) - 17usize];
    ["Offset of field: xcb_change_property_request_t::data_len"]
        [::std::mem::offset_of!(xcb_change_property_request_t, data_len) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_delete_property_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_delete_property_request_t"]
        [::std::mem::size_of::<xcb_delete_property_request_t>() - 12usize];
    ["Alignment of xcb_delete_property_request_t"]
        [::std::mem::align_of::<xcb_delete_property_request_t>() - 4usize];
    ["Offset of field: xcb_delete_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_delete_property_request_t::pad0"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, pad0) - 1usize];
    ["Offset of field: xcb_delete_property_request_t::length"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, length) - 2usize];
    ["Offset of field: xcb_delete_property_request_t::window"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, window) - 4usize];
    ["Offset of field: xcb_delete_property_request_t::property"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, property) - 8usize];
};
pub const XCB_GET_PROPERTY_TYPE_ANY: xcb_get_property_type_t = 0;
pub type xcb_get_property_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_cookie_t"]
        [::std::mem::size_of::<xcb_get_property_cookie_t>() - 4usize];
    ["Alignment of xcb_get_property_cookie_t"]
        [::std::mem::align_of::<xcb_get_property_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_property_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_property_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_request_t {
    pub major_opcode: u8,
    pub _delete: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
    pub type_: xcb_atom_t,
    pub long_offset: u32,
    pub long_length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_request_t"]
        [::std::mem::size_of::<xcb_get_property_request_t>() - 24usize];
    ["Alignment of xcb_get_property_request_t"]
        [::std::mem::align_of::<xcb_get_property_request_t>() - 4usize];
    ["Offset of field: xcb_get_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_property_request_t::_delete"]
        [::std::mem::offset_of!(xcb_get_property_request_t, _delete) - 1usize];
    ["Offset of field: xcb_get_property_request_t::length"]
        [::std::mem::offset_of!(xcb_get_property_request_t, length) - 2usize];
    ["Offset of field: xcb_get_property_request_t::window"]
        [::std::mem::offset_of!(xcb_get_property_request_t, window) - 4usize];
    ["Offset of field: xcb_get_property_request_t::property"]
        [::std::mem::offset_of!(xcb_get_property_request_t, property) - 8usize];
    ["Offset of field: xcb_get_property_request_t::type_"]
        [::std::mem::offset_of!(xcb_get_property_request_t, type_) - 12usize];
    ["Offset of field: xcb_get_property_request_t::long_offset"]
        [::std::mem::offset_of!(xcb_get_property_request_t, long_offset) - 16usize];
    ["Offset of field: xcb_get_property_request_t::long_length"]
        [::std::mem::offset_of!(xcb_get_property_request_t, long_length) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_reply_t {
    pub response_type: u8,
    pub format: u8,
    pub sequence: u16,
    pub length: u32,
    pub type_: xcb_atom_t,
    pub bytes_after: u32,
    pub value_len: u32,
    pub pad0: [u8; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_reply_t"]
        [::std::mem::size_of::<xcb_get_property_reply_t>() - 32usize];
    ["Alignment of xcb_get_property_reply_t"]
        [::std::mem::align_of::<xcb_get_property_reply_t>() - 4usize];
    ["Offset of field: xcb_get_property_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_property_reply_t::format"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, format) - 1usize];
    ["Offset of field: xcb_get_property_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_property_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_property_reply_t::type_"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, type_) - 8usize];
    ["Offset of field: xcb_get_property_reply_t::bytes_after"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, bytes_after) - 12usize];
    ["Offset of field: xcb_get_property_reply_t::value_len"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, value_len) - 16usize];
    ["Offset of field: xcb_get_property_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, pad0) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_cookie_t"]
        [::std::mem::size_of::<xcb_list_properties_cookie_t>() - 4usize];
    ["Alignment of xcb_list_properties_cookie_t"]
        [::std::mem::align_of::<xcb_list_properties_cookie_t>() - 4usize];
    ["Offset of field: xcb_list_properties_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_list_properties_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_request_t"]
        [::std::mem::size_of::<xcb_list_properties_request_t>() - 8usize];
    ["Alignment of xcb_list_properties_request_t"]
        [::std::mem::align_of::<xcb_list_properties_request_t>() - 4usize];
    ["Offset of field: xcb_list_properties_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_list_properties_request_t::pad0"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, pad0) - 1usize];
    ["Offset of field: xcb_list_properties_request_t::length"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, length) - 2usize];
    ["Offset of field: xcb_list_properties_request_t::window"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub atoms_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_reply_t"]
        [::std::mem::size_of::<xcb_list_properties_reply_t>() - 32usize];
    ["Alignment of xcb_list_properties_reply_t"]
        [::std::mem::align_of::<xcb_list_properties_reply_t>() - 4usize];
    ["Offset of field: xcb_list_properties_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_list_properties_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_list_properties_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_list_properties_reply_t::length"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, length) - 4usize];
    ["Offset of field: xcb_list_properties_reply_t::atoms_len"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, atoms_len) - 8usize];
    ["Offset of field: xcb_list_properties_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_selection_owner_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub owner: xcb_window_t,
    pub selection: xcb_atom_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_selection_owner_request_t"]
        [::std::mem::size_of::<xcb_set_selection_owner_request_t>() - 16usize];
    ["Alignment of xcb_set_selection_owner_request_t"]
        [::std::mem::align_of::<xcb_set_selection_owner_request_t>() - 4usize];
    ["Offset of field: xcb_set_selection_owner_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_selection_owner_request_t::pad0"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, pad0) - 1usize];
    ["Offset of field: xcb_set_selection_owner_request_t::length"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, length) - 2usize];
    ["Offset of field: xcb_set_selection_owner_request_t::owner"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, owner) - 4usize];
    ["Offset of field: xcb_set_selection_owner_request_t::selection"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, selection) - 8usize];
    ["Offset of field: xcb_set_selection_owner_request_t::time"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, time) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_cookie_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_cookie_t>() - 4usize];
    ["Alignment of xcb_get_selection_owner_cookie_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_selection_owner_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub selection: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_request_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_request_t>() - 8usize];
    ["Alignment of xcb_get_selection_owner_request_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_request_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_selection_owner_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_selection_owner_request_t::length"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, length) - 2usize];
    ["Offset of field: xcb_get_selection_owner_request_t::selection"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, selection) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub owner: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_reply_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_reply_t>() - 12usize];
    ["Alignment of xcb_get_selection_owner_reply_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_reply_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::owner"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, owner) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_convert_selection_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_convert_selection_request_t"]
        [::std::mem::size_of::<xcb_convert_selection_request_t>() - 24usize];
    ["Alignment of xcb_convert_selection_request_t"]
        [::std::mem::align_of::<xcb_convert_selection_request_t>() - 4usize];
    ["Offset of field: xcb_convert_selection_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_convert_selection_request_t::pad0"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, pad0) - 1usize];
    ["Offset of field: xcb_convert_selection_request_t::length"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, length) - 2usize];
    ["Offset of field: xcb_convert_selection_request_t::requestor"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, requestor) - 4usize];
    ["Offset of field: xcb_convert_selection_request_t::selection"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, selection) - 8usize];
    ["Offset of field: xcb_convert_selection_request_t::target"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, target) - 12usize];
    ["Offset of field: xcb_convert_selection_request_t::property"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, property) - 16usize];
    ["Offset of field: xcb_convert_selection_request_t::time"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, time) - 20usize];
};
pub const xcb_send_event_dest_t_XCB_SEND_EVENT_DEST_POINTER_WINDOW: xcb_send_event_dest_t = 0;
pub const xcb_send_event_dest_t_XCB_SEND_EVENT_DEST_ITEM_FOCUS: xcb_send_event_dest_t = 1;
pub type xcb_send_event_dest_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_send_event_request_t {
    pub major_opcode: u8,
    pub propagate: u8,
    pub length: u16,
    pub destination: xcb_window_t,
    pub event_mask: u32,
    pub event: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_send_event_request_t"]
        [::std::mem::size_of::<xcb_send_event_request_t>() - 44usize];
    ["Alignment of xcb_send_event_request_t"]
        [::std::mem::align_of::<xcb_send_event_request_t>() - 4usize];
    ["Offset of field: xcb_send_event_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_send_event_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_send_event_request_t::propagate"]
        [::std::mem::offset_of!(xcb_send_event_request_t, propagate) - 1usize];
    ["Offset of field: xcb_send_event_request_t::length"]
        [::std::mem::offset_of!(xcb_send_event_request_t, length) - 2usize];
    ["Offset of field: xcb_send_event_request_t::destination"]
        [::std::mem::offset_of!(xcb_send_event_request_t, destination) - 4usize];
    ["Offset of field: xcb_send_event_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_send_event_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_send_event_request_t::event"]
        [::std::mem::offset_of!(xcb_send_event_request_t, event) - 12usize];
};
pub const XCB_GRAB_MODE_SYNC: xcb_grab_mode_t = 0;
pub const XCB_GRAB_MODE_ASYNC: xcb_grab_mode_t = 1;
pub type xcb_grab_mode_t = ::std::os::raw::c_uint;
pub const XCB_GRAB_STATUS_SUCCESS: xcb_grab_status_t = 0;
pub const XCB_GRAB_STATUS_ALREADY_GRABBED: xcb_grab_status_t = 1;
pub const XCB_GRAB_STATUS_INVALID_TIME: xcb_grab_status_t = 2;
pub const XCB_GRAB_STATUS_NOT_VIEWABLE: xcb_grab_status_t = 3;
pub const XCB_GRAB_STATUS_FROZEN: xcb_grab_status_t = 4;
pub type xcb_grab_status_t = ::std::os::raw::c_uint;
pub const XCB_CURSOR_NONE: xcb_cursor_enum_t = 0;
pub type xcb_cursor_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_cookie_t"]
        [::std::mem::size_of::<xcb_grab_pointer_cookie_t>() - 4usize];
    ["Alignment of xcb_grab_pointer_cookie_t"]
        [::std::mem::align_of::<xcb_grab_pointer_cookie_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_pointer_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub event_mask: u16,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub confine_to: xcb_window_t,
    pub cursor: xcb_cursor_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_request_t"]
        [::std::mem::size_of::<xcb_grab_pointer_request_t>() - 24usize];
    ["Alignment of xcb_grab_pointer_request_t"]
        [::std::mem::align_of::<xcb_grab_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_pointer_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_pointer_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_pointer_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_grab_pointer_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, pointer_mode) - 10usize];
    ["Offset of field: xcb_grab_pointer_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, keyboard_mode) - 11usize];
    ["Offset of field: xcb_grab_pointer_request_t::confine_to"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, confine_to) - 12usize];
    ["Offset of field: xcb_grab_pointer_request_t::cursor"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, cursor) - 16usize];
    ["Offset of field: xcb_grab_pointer_request_t::time"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, time) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_reply_t {
    pub response_type: u8,
    pub status: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_reply_t"]
        [::std::mem::size_of::<xcb_grab_pointer_reply_t>() - 8usize];
    ["Alignment of xcb_grab_pointer_reply_t"]
        [::std::mem::align_of::<xcb_grab_pointer_reply_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_grab_pointer_reply_t::status"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, status) - 1usize];
    ["Offset of field: xcb_grab_pointer_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_grab_pointer_reply_t::length"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_pointer_request_t"]
        [::std::mem::size_of::<xcb_ungrab_pointer_request_t>() - 8usize];
    ["Alignment of xcb_ungrab_pointer_request_t"]
        [::std::mem::align_of::<xcb_ungrab_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::time"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, time) - 4usize];
};
pub const xcb_button_index_t_XCB_BUTTON_INDEX_ANY: xcb_button_index_t = 0;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_1: xcb_button_index_t = 1;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_2: xcb_button_index_t = 2;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_3: xcb_button_index_t = 3;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_4: xcb_button_index_t = 4;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_5: xcb_button_index_t = 5;
pub type xcb_button_index_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_button_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub event_mask: u16,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub confine_to: xcb_window_t,
    pub cursor: xcb_cursor_t,
    pub button: u8,
    pub pad0: u8,
    pub modifiers: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_button_request_t"]
        [::std::mem::size_of::<xcb_grab_button_request_t>() - 24usize];
    ["Alignment of xcb_grab_button_request_t"]
        [::std::mem::align_of::<xcb_grab_button_request_t>() - 4usize];
    ["Offset of field: xcb_grab_button_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_button_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_button_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_button_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_button_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_grab_button_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, pointer_mode) - 10usize];
    ["Offset of field: xcb_grab_button_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, keyboard_mode) - 11usize];
    ["Offset of field: xcb_grab_button_request_t::confine_to"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, confine_to) - 12usize];
    ["Offset of field: xcb_grab_button_request_t::cursor"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, cursor) - 16usize];
    ["Offset of field: xcb_grab_button_request_t::button"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, button) - 20usize];
    ["Offset of field: xcb_grab_button_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, pad0) - 21usize];
    ["Offset of field: xcb_grab_button_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, modifiers) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_button_request_t {
    pub major_opcode: u8,
    pub button: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_button_request_t"]
        [::std::mem::size_of::<xcb_ungrab_button_request_t>() - 12usize];
    ["Alignment of xcb_ungrab_button_request_t"]
        [::std::mem::align_of::<xcb_ungrab_button_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_button_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_button_request_t::button"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, button) - 1usize];
    ["Offset of field: xcb_ungrab_button_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_button_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_ungrab_button_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_ungrab_button_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, pad0) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_active_pointer_grab_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub cursor: xcb_cursor_t,
    pub time: xcb_timestamp_t,
    pub event_mask: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_active_pointer_grab_request_t"]
        [::std::mem::size_of::<xcb_change_active_pointer_grab_request_t>() - 16usize];
    ["Alignment of xcb_change_active_pointer_grab_request_t"]
        [::std::mem::align_of::<xcb_change_active_pointer_grab_request_t>() - 4usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, pad0) - 1usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::length"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, length) - 2usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::cursor"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, cursor) - 4usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::time"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, time) - 8usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, event_mask) - 12usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::pad1"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, pad1) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_cookie_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_cookie_t>() - 4usize];
    ["Alignment of xcb_grab_keyboard_cookie_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_cookie_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_keyboard_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub time: xcb_timestamp_t,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_request_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_request_t>() - 16usize];
    ["Alignment of xcb_grab_keyboard_request_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_request_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_keyboard_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_keyboard_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_keyboard_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_keyboard_request_t::time"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, time) - 8usize];
    ["Offset of field: xcb_grab_keyboard_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, pointer_mode) - 12usize];
    ["Offset of field: xcb_grab_keyboard_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, keyboard_mode) - 13usize];
    ["Offset of field: xcb_grab_keyboard_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, pad0) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_reply_t {
    pub response_type: u8,
    pub status: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_reply_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_reply_t>() - 8usize];
    ["Alignment of xcb_grab_keyboard_reply_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_reply_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::status"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, status) - 1usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::length"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_keyboard_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_keyboard_request_t"]
        [::std::mem::size_of::<xcb_ungrab_keyboard_request_t>() - 8usize];
    ["Alignment of xcb_ungrab_keyboard_request_t"]
        [::std::mem::align_of::<xcb_ungrab_keyboard_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::time"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, time) - 4usize];
};
pub const xcb_grab_t_XCB_GRAB_ANY: xcb_grab_t = 0;
pub type xcb_grab_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_key_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub key: xcb_keycode_t,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub pad0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_key_request_t"][::std::mem::size_of::<xcb_grab_key_request_t>() - 16usize];
    ["Alignment of xcb_grab_key_request_t"]
        [::std::mem::align_of::<xcb_grab_key_request_t>() - 4usize];
    ["Offset of field: xcb_grab_key_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_key_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_key_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_key_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_key_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_grab_key_request_t::key"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, key) - 10usize];
    ["Offset of field: xcb_grab_key_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, pointer_mode) - 11usize];
    ["Offset of field: xcb_grab_key_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, keyboard_mode) - 12usize];
    ["Offset of field: xcb_grab_key_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, pad0) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_key_request_t {
    pub major_opcode: u8,
    pub key: xcb_keycode_t,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_key_request_t"]
        [::std::mem::size_of::<xcb_ungrab_key_request_t>() - 12usize];
    ["Alignment of xcb_ungrab_key_request_t"]
        [::std::mem::align_of::<xcb_ungrab_key_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_key_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_key_request_t::key"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, key) - 1usize];
    ["Offset of field: xcb_ungrab_key_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_key_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_ungrab_key_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_ungrab_key_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, pad0) - 10usize];
};
pub const XCB_ALLOW_ASYNC_POINTER: xcb_allow_t = 0;
pub const XCB_ALLOW_SYNC_POINTER: xcb_allow_t = 1;
pub const XCB_ALLOW_REPLAY_POINTER: xcb_allow_t = 2;
pub const XCB_ALLOW_ASYNC_KEYBOARD: xcb_allow_t = 3;
pub const XCB_ALLOW_SYNC_KEYBOARD: xcb_allow_t = 4;
pub const XCB_ALLOW_REPLAY_KEYBOARD: xcb_allow_t = 5;
pub const XCB_ALLOW_ASYNC_BOTH: xcb_allow_t = 6;
pub const XCB_ALLOW_SYNC_BOTH: xcb_allow_t = 7;
pub type xcb_allow_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_allow_events_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_allow_events_request_t"]
        [::std::mem::size_of::<xcb_allow_events_request_t>() - 8usize];
    ["Alignment of xcb_allow_events_request_t"]
        [::std::mem::align_of::<xcb_allow_events_request_t>() - 4usize];
    ["Offset of field: xcb_allow_events_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_allow_events_request_t::mode"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, mode) - 1usize];
    ["Offset of field: xcb_allow_events_request_t::length"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, length) - 2usize];
    ["Offset of field: xcb_allow_events_request_t::time"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, time) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_server_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_server_request_t"]
        [::std::mem::size_of::<xcb_grab_server_request_t>() - 4usize];
    ["Alignment of xcb_grab_server_request_t"]
        [::std::mem::align_of::<xcb_grab_server_request_t>() - 2usize];
    ["Offset of field: xcb_grab_server_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_server_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, pad0) - 1usize];
    ["Offset of field: xcb_grab_server_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_server_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_server_request_t"]
        [::std::mem::size_of::<xcb_ungrab_server_request_t>() - 4usize];
    ["Alignment of xcb_ungrab_server_request_t"]
        [::std::mem::align_of::<xcb_ungrab_server_request_t>() - 2usize];
    ["Offset of field: xcb_ungrab_server_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_server_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_server_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_cookie_t"]
        [::std::mem::size_of::<xcb_query_pointer_cookie_t>() - 4usize];
    ["Alignment of xcb_query_pointer_cookie_t"]
        [::std::mem::align_of::<xcb_query_pointer_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_pointer_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_request_t"]
        [::std::mem::size_of::<xcb_query_pointer_request_t>() - 8usize];
    ["Alignment of xcb_query_pointer_request_t"]
        [::std::mem::align_of::<xcb_query_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_query_pointer_request_t::window"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_reply_t {
    pub response_type: u8,
    pub same_screen: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub win_x: i16,
    pub win_y: i16,
    pub mask: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_reply_t"]
        [::std::mem::size_of::<xcb_query_pointer_reply_t>() - 28usize];
    ["Alignment of xcb_query_pointer_reply_t"]
        [::std::mem::align_of::<xcb_query_pointer_reply_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_pointer_reply_t::same_screen"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, same_screen) - 1usize];
    ["Offset of field: xcb_query_pointer_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_pointer_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_pointer_reply_t::root"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root) - 8usize];
    ["Offset of field: xcb_query_pointer_reply_t::child"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, child) - 12usize];
    ["Offset of field: xcb_query_pointer_reply_t::root_x"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root_x) - 16usize];
    ["Offset of field: xcb_query_pointer_reply_t::root_y"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root_y) - 18usize];
    ["Offset of field: xcb_query_pointer_reply_t::win_x"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, win_x) - 20usize];
    ["Offset of field: xcb_query_pointer_reply_t::win_y"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, win_y) - 22usize];
    ["Offset of field: xcb_query_pointer_reply_t::mask"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, mask) - 24usize];
    ["Offset of field: xcb_query_pointer_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, pad0) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timecoord_t {
    pub time: xcb_timestamp_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timecoord_t"][::std::mem::size_of::<xcb_timecoord_t>() - 8usize];
    ["Alignment of xcb_timecoord_t"][::std::mem::align_of::<xcb_timecoord_t>() - 4usize];
    ["Offset of field: xcb_timecoord_t::time"]
        [::std::mem::offset_of!(xcb_timecoord_t, time) - 0usize];
    ["Offset of field: xcb_timecoord_t::x"][::std::mem::offset_of!(xcb_timecoord_t, x) - 4usize];
    ["Offset of field: xcb_timecoord_t::y"][::std::mem::offset_of!(xcb_timecoord_t, y) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timecoord_iterator_t {
    pub data: *mut xcb_timecoord_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timecoord_iterator_t"]
        [::std::mem::size_of::<xcb_timecoord_iterator_t>() - 16usize];
    ["Alignment of xcb_timecoord_iterator_t"]
        [::std::mem::align_of::<xcb_timecoord_iterator_t>() - 8usize];
    ["Offset of field: xcb_timecoord_iterator_t::data"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, data) - 0usize];
    ["Offset of field: xcb_timecoord_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_timecoord_iterator_t::index"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_cookie_t"]
        [::std::mem::size_of::<xcb_get_motion_events_cookie_t>() - 4usize];
    ["Alignment of xcb_get_motion_events_cookie_t"]
        [::std::mem::align_of::<xcb_get_motion_events_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_motion_events_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub start: xcb_timestamp_t,
    pub stop: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_request_t"]
        [::std::mem::size_of::<xcb_get_motion_events_request_t>() - 16usize];
    ["Alignment of xcb_get_motion_events_request_t"]
        [::std::mem::align_of::<xcb_get_motion_events_request_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_motion_events_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_motion_events_request_t::length"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, length) - 2usize];
    ["Offset of field: xcb_get_motion_events_request_t::window"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, window) - 4usize];
    ["Offset of field: xcb_get_motion_events_request_t::start"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, start) - 8usize];
    ["Offset of field: xcb_get_motion_events_request_t::stop"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, stop) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub events_len: u32,
    pub pad1: [u8; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_reply_t"]
        [::std::mem::size_of::<xcb_get_motion_events_reply_t>() - 32usize];
    ["Alignment of xcb_get_motion_events_reply_t"]
        [::std::mem::align_of::<xcb_get_motion_events_reply_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_motion_events_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_motion_events_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_motion_events_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_motion_events_reply_t::events_len"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, events_len) - 8usize];
    ["Offset of field: xcb_get_motion_events_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, pad1) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_cookie_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_cookie_t>() - 4usize];
    ["Alignment of xcb_translate_coordinates_cookie_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_cookie_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_translate_coordinates_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_window: xcb_window_t,
    pub dst_window: xcb_window_t,
    pub src_x: i16,
    pub src_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_request_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_request_t>() - 16usize];
    ["Alignment of xcb_translate_coordinates_request_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_request_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_translate_coordinates_request_t::pad0"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, pad0) - 1usize];
    ["Offset of field: xcb_translate_coordinates_request_t::length"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, length) - 2usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_window"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_window) - 4usize];
    ["Offset of field: xcb_translate_coordinates_request_t::dst_window"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, dst_window) - 8usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_x"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_x) - 12usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_y"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_reply_t {
    pub response_type: u8,
    pub same_screen: u8,
    pub sequence: u16,
    pub length: u32,
    pub child: xcb_window_t,
    pub dst_x: i16,
    pub dst_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_reply_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_reply_t>() - 16usize];
    ["Alignment of xcb_translate_coordinates_reply_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_reply_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::same_screen"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, same_screen) - 1usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::length"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, length) - 4usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::child"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, child) - 8usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::dst_x"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, dst_x) - 12usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::dst_y"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, dst_y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_warp_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_window: xcb_window_t,
    pub dst_window: xcb_window_t,
    pub src_x: i16,
    pub src_y: i16,
    pub src_width: u16,
    pub src_height: u16,
    pub dst_x: i16,
    pub dst_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_warp_pointer_request_t"]
        [::std::mem::size_of::<xcb_warp_pointer_request_t>() - 24usize];
    ["Alignment of xcb_warp_pointer_request_t"]
        [::std::mem::align_of::<xcb_warp_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_warp_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_warp_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_warp_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_window"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_window) - 4usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_window"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_window) - 8usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_x"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_x) - 12usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_y"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_y) - 14usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_width"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_width) - 16usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_height"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_height) - 18usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_x"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_x) - 20usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_y"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_y) - 22usize];
};
pub const XCB_INPUT_FOCUS_NONE: xcb_input_focus_t = 0;
pub const XCB_INPUT_FOCUS_POINTER_ROOT: xcb_input_focus_t = 1;
pub const XCB_INPUT_FOCUS_PARENT: xcb_input_focus_t = 2;
pub const XCB_INPUT_FOCUS_FOLLOW_KEYBOARD: xcb_input_focus_t = 3;
pub type xcb_input_focus_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_input_focus_request_t {
    pub major_opcode: u8,
    pub revert_to: u8,
    pub length: u16,
    pub focus: xcb_window_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_input_focus_request_t"]
        [::std::mem::size_of::<xcb_set_input_focus_request_t>() - 12usize];
    ["Alignment of xcb_set_input_focus_request_t"]
        [::std::mem::align_of::<xcb_set_input_focus_request_t>() - 4usize];
    ["Offset of field: xcb_set_input_focus_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_input_focus_request_t::revert_to"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, revert_to) - 1usize];
    ["Offset of field: xcb_set_input_focus_request_t::length"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, length) - 2usize];
    ["Offset of field: xcb_set_input_focus_request_t::focus"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, focus) - 4usize];
    ["Offset of field: xcb_set_input_focus_request_t::time"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, time) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_cookie_t"]
        [::std::mem::size_of::<xcb_get_input_focus_cookie_t>() - 4usize];
    ["Alignment of xcb_get_input_focus_cookie_t"]
        [::std::mem::align_of::<xcb_get_input_focus_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_input_focus_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_input_focus_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_request_t"]
        [::std::mem::size_of::<xcb_get_input_focus_request_t>() - 4usize];
    ["Alignment of xcb_get_input_focus_request_t"]
        [::std::mem::align_of::<xcb_get_input_focus_request_t>() - 2usize];
    ["Offset of field: xcb_get_input_focus_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_input_focus_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_input_focus_request_t::length"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_reply_t {
    pub response_type: u8,
    pub revert_to: u8,
    pub sequence: u16,
    pub length: u32,
    pub focus: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_reply_t"]
        [::std::mem::size_of::<xcb_get_input_focus_reply_t>() - 12usize];
    ["Alignment of xcb_get_input_focus_reply_t"]
        [::std::mem::align_of::<xcb_get_input_focus_reply_t>() - 4usize];
    ["Offset of field: xcb_get_input_focus_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_input_focus_reply_t::revert_to"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, revert_to) - 1usize];
    ["Offset of field: xcb_get_input_focus_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_input_focus_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_input_focus_reply_t::focus"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, focus) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_cookie_t"]
        [::std::mem::size_of::<xcb_query_keymap_cookie_t>() - 4usize];
    ["Alignment of xcb_query_keymap_cookie_t"]
        [::std::mem::align_of::<xcb_query_keymap_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_keymap_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_keymap_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_request_t"]
        [::std::mem::size_of::<xcb_query_keymap_request_t>() - 4usize];
    ["Alignment of xcb_query_keymap_request_t"]
        [::std::mem::align_of::<xcb_query_keymap_request_t>() - 2usize];
    ["Offset of field: xcb_query_keymap_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_keymap_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_keymap_request_t::length"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub keys: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_reply_t"]
        [::std::mem::size_of::<xcb_query_keymap_reply_t>() - 40usize];
    ["Alignment of xcb_query_keymap_reply_t"]
        [::std::mem::align_of::<xcb_query_keymap_reply_t>() - 4usize];
    ["Offset of field: xcb_query_keymap_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_keymap_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_query_keymap_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_keymap_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_keymap_reply_t::keys"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, keys) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_open_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub fid: xcb_font_t,
    pub name_len: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_open_font_request_t"][::std::mem::size_of::<xcb_open_font_request_t>() - 12usize];
    ["Alignment of xcb_open_font_request_t"]
        [::std::mem::align_of::<xcb_open_font_request_t>() - 4usize];
    ["Offset of field: xcb_open_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_open_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_open_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_open_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_open_font_request_t::length"]
        [::std::mem::offset_of!(xcb_open_font_request_t, length) - 2usize];
    ["Offset of field: xcb_open_font_request_t::fid"]
        [::std::mem::offset_of!(xcb_open_font_request_t, fid) - 4usize];
    ["Offset of field: xcb_open_font_request_t::name_len"]
        [::std::mem::offset_of!(xcb_open_font_request_t, name_len) - 8usize];
    ["Offset of field: xcb_open_font_request_t::pad1"]
        [::std::mem::offset_of!(xcb_open_font_request_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_close_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub font: xcb_font_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_close_font_request_t"]
        [::std::mem::size_of::<xcb_close_font_request_t>() - 8usize];
    ["Alignment of xcb_close_font_request_t"]
        [::std::mem::align_of::<xcb_close_font_request_t>() - 4usize];
    ["Offset of field: xcb_close_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_close_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_close_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_close_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_close_font_request_t::length"]
        [::std::mem::offset_of!(xcb_close_font_request_t, length) - 2usize];
    ["Offset of field: xcb_close_font_request_t::font"]
        [::std::mem::offset_of!(xcb_close_font_request_t, font) - 4usize];
};
pub const xcb_font_draw_t_XCB_FONT_DRAW_LEFT_TO_RIGHT: xcb_font_draw_t = 0;
pub const xcb_font_draw_t_XCB_FONT_DRAW_RIGHT_TO_LEFT: xcb_font_draw_t = 1;
pub type xcb_font_draw_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontprop_t {
    pub name: xcb_atom_t,
    pub value: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontprop_t"][::std::mem::size_of::<xcb_fontprop_t>() - 8usize];
    ["Alignment of xcb_fontprop_t"][::std::mem::align_of::<xcb_fontprop_t>() - 4usize];
    ["Offset of field: xcb_fontprop_t::name"]
        [::std::mem::offset_of!(xcb_fontprop_t, name) - 0usize];
    ["Offset of field: xcb_fontprop_t::value"]
        [::std::mem::offset_of!(xcb_fontprop_t, value) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontprop_iterator_t {
    pub data: *mut xcb_fontprop_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontprop_iterator_t"][::std::mem::size_of::<xcb_fontprop_iterator_t>() - 16usize];
    ["Alignment of xcb_fontprop_iterator_t"]
        [::std::mem::align_of::<xcb_fontprop_iterator_t>() - 8usize];
    ["Offset of field: xcb_fontprop_iterator_t::data"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, data) - 0usize];
    ["Offset of field: xcb_fontprop_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_fontprop_iterator_t::index"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_charinfo_t {
    pub left_side_bearing: i16,
    pub right_side_bearing: i16,
    pub character_width: i16,
    pub ascent: i16,
    pub descent: i16,
    pub attributes: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_charinfo_t"][::std::mem::size_of::<xcb_charinfo_t>() - 12usize];
    ["Alignment of xcb_charinfo_t"][::std::mem::align_of::<xcb_charinfo_t>() - 2usize];
    ["Offset of field: xcb_charinfo_t::left_side_bearing"]
        [::std::mem::offset_of!(xcb_charinfo_t, left_side_bearing) - 0usize];
    ["Offset of field: xcb_charinfo_t::right_side_bearing"]
        [::std::mem::offset_of!(xcb_charinfo_t, right_side_bearing) - 2usize];
    ["Offset of field: xcb_charinfo_t::character_width"]
        [::std::mem::offset_of!(xcb_charinfo_t, character_width) - 4usize];
    ["Offset of field: xcb_charinfo_t::ascent"]
        [::std::mem::offset_of!(xcb_charinfo_t, ascent) - 6usize];
    ["Offset of field: xcb_charinfo_t::descent"]
        [::std::mem::offset_of!(xcb_charinfo_t, descent) - 8usize];
    ["Offset of field: xcb_charinfo_t::attributes"]
        [::std::mem::offset_of!(xcb_charinfo_t, attributes) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_charinfo_iterator_t {
    pub data: *mut xcb_charinfo_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_charinfo_iterator_t"][::std::mem::size_of::<xcb_charinfo_iterator_t>() - 16usize];
    ["Alignment of xcb_charinfo_iterator_t"]
        [::std::mem::align_of::<xcb_charinfo_iterator_t>() - 8usize];
    ["Offset of field: xcb_charinfo_iterator_t::data"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, data) - 0usize];
    ["Offset of field: xcb_charinfo_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_charinfo_iterator_t::index"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_font_cookie_t"][::std::mem::size_of::<xcb_query_font_cookie_t>() - 4usize];
    ["Alignment of xcb_query_font_cookie_t"]
        [::std::mem::align_of::<xcb_query_font_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_font_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_font_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub font: xcb_fontable_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_font_request_t"]
        [::std::mem::size_of::<xcb_query_font_request_t>() - 8usize];
    ["Alignment of xcb_query_font_request_t"]
        [::std::mem::align_of::<xcb_query_font_request_t>() - 4usize];
    ["Offset of field: xcb_query_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_font_request_t::length"]
        [::std::mem::offset_of!(xcb_query_font_request_t, length) - 2usize];
    ["Offset of field: xcb_query_font_request_t::font"]
        [::std::mem::offset_of!(xcb_query_font_request_t, font) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub min_bounds: xcb_charinfo_t,
    pub pad1: [u8; 4usize],
    pub max_bounds: xcb_charinfo_t,
    pub pad2: [u8; 4usize],
    pub min_char_or_byte2: u16,
    pub max_char_or_byte2: u16,
    pub default_char: u16,
    pub properties_len: u16,
    pub draw_direction: u8,
    pub min_byte1: u8,
    pub max_byte1: u8,
    pub all_chars_exist: u8,
    pub font_ascent: i16,
    pub font_descent: i16,
    pub char_infos_len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_font_reply_t"][::std::mem::size_of::<xcb_query_font_reply_t>() - 60usize];
    ["Alignment of xcb_query_font_reply_t"]
        [::std::mem::align_of::<xcb_query_font_reply_t>() - 4usize];
    ["Offset of field: xcb_query_font_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_font_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_query_font_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_font_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_font_reply_t::min_bounds"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, min_bounds) - 8usize];
    ["Offset of field: xcb_query_font_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, pad1) - 20usize];
    ["Offset of field: xcb_query_font_reply_t::max_bounds"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, max_bounds) - 24usize];
    ["Offset of field: xcb_query_font_reply_t::pad2"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, pad2) - 36usize];
    ["Offset of field: xcb_query_font_reply_t::min_char_or_byte2"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, min_char_or_byte2) - 40usize];
    ["Offset of field: xcb_query_font_reply_t::max_char_or_byte2"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, max_char_or_byte2) - 42usize];
    ["Offset of field: xcb_query_font_reply_t::default_char"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, default_char) - 44usize];
    ["Offset of field: xcb_query_font_reply_t::properties_len"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, properties_len) - 46usize];
    ["Offset of field: xcb_query_font_reply_t::draw_direction"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, draw_direction) - 48usize];
    ["Offset of field: xcb_query_font_reply_t::min_byte1"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, min_byte1) - 49usize];
    ["Offset of field: xcb_query_font_reply_t::max_byte1"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, max_byte1) - 50usize];
    ["Offset of field: xcb_query_font_reply_t::all_chars_exist"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, all_chars_exist) - 51usize];
    ["Offset of field: xcb_query_font_reply_t::font_ascent"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, font_ascent) - 52usize];
    ["Offset of field: xcb_query_font_reply_t::font_descent"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, font_descent) - 54usize];
    ["Offset of field: xcb_query_font_reply_t::char_infos_len"]
        [::std::mem::offset_of!(xcb_query_font_reply_t, char_infos_len) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_text_extents_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_text_extents_cookie_t"]
        [::std::mem::size_of::<xcb_query_text_extents_cookie_t>() - 4usize];
    ["Alignment of xcb_query_text_extents_cookie_t"]
        [::std::mem::align_of::<xcb_query_text_extents_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_text_extents_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_text_extents_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_text_extents_request_t {
    pub major_opcode: u8,
    pub odd_length: u8,
    pub length: u16,
    pub font: xcb_fontable_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_text_extents_request_t"]
        [::std::mem::size_of::<xcb_query_text_extents_request_t>() - 8usize];
    ["Alignment of xcb_query_text_extents_request_t"]
        [::std::mem::align_of::<xcb_query_text_extents_request_t>() - 4usize];
    ["Offset of field: xcb_query_text_extents_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_text_extents_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_text_extents_request_t::odd_length"]
        [::std::mem::offset_of!(xcb_query_text_extents_request_t, odd_length) - 1usize];
    ["Offset of field: xcb_query_text_extents_request_t::length"]
        [::std::mem::offset_of!(xcb_query_text_extents_request_t, length) - 2usize];
    ["Offset of field: xcb_query_text_extents_request_t::font"]
        [::std::mem::offset_of!(xcb_query_text_extents_request_t, font) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_text_extents_reply_t {
    pub response_type: u8,
    pub draw_direction: u8,
    pub sequence: u16,
    pub length: u32,
    pub font_ascent: i16,
    pub font_descent: i16,
    pub overall_ascent: i16,
    pub overall_descent: i16,
    pub overall_width: i32,
    pub overall_left: i32,
    pub overall_right: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_text_extents_reply_t"]
        [::std::mem::size_of::<xcb_query_text_extents_reply_t>() - 28usize];
    ["Alignment of xcb_query_text_extents_reply_t"]
        [::std::mem::align_of::<xcb_query_text_extents_reply_t>() - 4usize];
    ["Offset of field: xcb_query_text_extents_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_text_extents_reply_t::draw_direction"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, draw_direction) - 1usize];
    ["Offset of field: xcb_query_text_extents_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_text_extents_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_text_extents_reply_t::font_ascent"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, font_ascent) - 8usize];
    ["Offset of field: xcb_query_text_extents_reply_t::font_descent"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, font_descent) - 10usize];
    ["Offset of field: xcb_query_text_extents_reply_t::overall_ascent"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, overall_ascent) - 12usize];
    ["Offset of field: xcb_query_text_extents_reply_t::overall_descent"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, overall_descent) - 14usize];
    ["Offset of field: xcb_query_text_extents_reply_t::overall_width"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, overall_width) - 16usize];
    ["Offset of field: xcb_query_text_extents_reply_t::overall_left"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, overall_left) - 20usize];
    ["Offset of field: xcb_query_text_extents_reply_t::overall_right"]
        [::std::mem::offset_of!(xcb_query_text_extents_reply_t, overall_right) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_str_t {
    pub name_len: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_str_t"][::std::mem::size_of::<xcb_str_t>() - 1usize];
    ["Alignment of xcb_str_t"][::std::mem::align_of::<xcb_str_t>() - 1usize];
    ["Offset of field: xcb_str_t::name_len"][::std::mem::offset_of!(xcb_str_t, name_len) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_str_iterator_t {
    pub data: *mut xcb_str_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_str_iterator_t"][::std::mem::size_of::<xcb_str_iterator_t>() - 16usize];
    ["Alignment of xcb_str_iterator_t"][::std::mem::align_of::<xcb_str_iterator_t>() - 8usize];
    ["Offset of field: xcb_str_iterator_t::data"]
        [::std::mem::offset_of!(xcb_str_iterator_t, data) - 0usize];
    ["Offset of field: xcb_str_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_str_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_str_iterator_t::index"]
        [::std::mem::offset_of!(xcb_str_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_cookie_t"][::std::mem::size_of::<xcb_list_fonts_cookie_t>() - 4usize];
    ["Alignment of xcb_list_fonts_cookie_t"]
        [::std::mem::align_of::<xcb_list_fonts_cookie_t>() - 4usize];
    ["Offset of field: xcb_list_fonts_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_list_fonts_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub max_names: u16,
    pub pattern_len: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_request_t"]
        [::std::mem::size_of::<xcb_list_fonts_request_t>() - 8usize];
    ["Alignment of xcb_list_fonts_request_t"]
        [::std::mem::align_of::<xcb_list_fonts_request_t>() - 2usize];
    ["Offset of field: xcb_list_fonts_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_list_fonts_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_list_fonts_request_t::pad0"]
        [::std::mem::offset_of!(xcb_list_fonts_request_t, pad0) - 1usize];
    ["Offset of field: xcb_list_fonts_request_t::length"]
        [::std::mem::offset_of!(xcb_list_fonts_request_t, length) - 2usize];
    ["Offset of field: xcb_list_fonts_request_t::max_names"]
        [::std::mem::offset_of!(xcb_list_fonts_request_t, max_names) - 4usize];
    ["Offset of field: xcb_list_fonts_request_t::pattern_len"]
        [::std::mem::offset_of!(xcb_list_fonts_request_t, pattern_len) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub names_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_reply_t"][::std::mem::size_of::<xcb_list_fonts_reply_t>() - 32usize];
    ["Alignment of xcb_list_fonts_reply_t"]
        [::std::mem::align_of::<xcb_list_fonts_reply_t>() - 4usize];
    ["Offset of field: xcb_list_fonts_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_list_fonts_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_list_fonts_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_list_fonts_reply_t::length"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, length) - 4usize];
    ["Offset of field: xcb_list_fonts_reply_t::names_len"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, names_len) - 8usize];
    ["Offset of field: xcb_list_fonts_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_list_fonts_reply_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_with_info_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_with_info_cookie_t"]
        [::std::mem::size_of::<xcb_list_fonts_with_info_cookie_t>() - 4usize];
    ["Alignment of xcb_list_fonts_with_info_cookie_t"]
        [::std::mem::align_of::<xcb_list_fonts_with_info_cookie_t>() - 4usize];
    ["Offset of field: xcb_list_fonts_with_info_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_with_info_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub max_names: u16,
    pub pattern_len: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_with_info_request_t"]
        [::std::mem::size_of::<xcb_list_fonts_with_info_request_t>() - 8usize];
    ["Alignment of xcb_list_fonts_with_info_request_t"]
        [::std::mem::align_of::<xcb_list_fonts_with_info_request_t>() - 2usize];
    ["Offset of field: xcb_list_fonts_with_info_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_list_fonts_with_info_request_t::pad0"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_request_t, pad0) - 1usize];
    ["Offset of field: xcb_list_fonts_with_info_request_t::length"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_request_t, length) - 2usize];
    ["Offset of field: xcb_list_fonts_with_info_request_t::max_names"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_request_t, max_names) - 4usize];
    ["Offset of field: xcb_list_fonts_with_info_request_t::pattern_len"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_request_t, pattern_len) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_fonts_with_info_reply_t {
    pub response_type: u8,
    pub name_len: u8,
    pub sequence: u16,
    pub length: u32,
    pub min_bounds: xcb_charinfo_t,
    pub pad0: [u8; 4usize],
    pub max_bounds: xcb_charinfo_t,
    pub pad1: [u8; 4usize],
    pub min_char_or_byte2: u16,
    pub max_char_or_byte2: u16,
    pub default_char: u16,
    pub properties_len: u16,
    pub draw_direction: u8,
    pub min_byte1: u8,
    pub max_byte1: u8,
    pub all_chars_exist: u8,
    pub font_ascent: i16,
    pub font_descent: i16,
    pub replies_hint: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_fonts_with_info_reply_t"]
        [::std::mem::size_of::<xcb_list_fonts_with_info_reply_t>() - 60usize];
    ["Alignment of xcb_list_fonts_with_info_reply_t"]
        [::std::mem::align_of::<xcb_list_fonts_with_info_reply_t>() - 4usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::name_len"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, name_len) - 1usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::length"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, length) - 4usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::min_bounds"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, min_bounds) - 8usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, pad0) - 20usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::max_bounds"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, max_bounds) - 24usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, pad1) - 36usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::min_char_or_byte2"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, min_char_or_byte2) - 40usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::max_char_or_byte2"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, max_char_or_byte2) - 42usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::default_char"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, default_char) - 44usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::properties_len"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, properties_len) - 46usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::draw_direction"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, draw_direction) - 48usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::min_byte1"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, min_byte1) - 49usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::max_byte1"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, max_byte1) - 50usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::all_chars_exist"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, all_chars_exist) - 51usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::font_ascent"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, font_ascent) - 52usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::font_descent"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, font_descent) - 54usize];
    ["Offset of field: xcb_list_fonts_with_info_reply_t::replies_hint"]
        [::std::mem::offset_of!(xcb_list_fonts_with_info_reply_t, replies_hint) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_font_path_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub font_qty: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_font_path_request_t"]
        [::std::mem::size_of::<xcb_set_font_path_request_t>() - 8usize];
    ["Alignment of xcb_set_font_path_request_t"]
        [::std::mem::align_of::<xcb_set_font_path_request_t>() - 2usize];
    ["Offset of field: xcb_set_font_path_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_font_path_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_font_path_request_t::pad0"]
        [::std::mem::offset_of!(xcb_set_font_path_request_t, pad0) - 1usize];
    ["Offset of field: xcb_set_font_path_request_t::length"]
        [::std::mem::offset_of!(xcb_set_font_path_request_t, length) - 2usize];
    ["Offset of field: xcb_set_font_path_request_t::font_qty"]
        [::std::mem::offset_of!(xcb_set_font_path_request_t, font_qty) - 4usize];
    ["Offset of field: xcb_set_font_path_request_t::pad1"]
        [::std::mem::offset_of!(xcb_set_font_path_request_t, pad1) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_font_path_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_font_path_cookie_t"]
        [::std::mem::size_of::<xcb_get_font_path_cookie_t>() - 4usize];
    ["Alignment of xcb_get_font_path_cookie_t"]
        [::std::mem::align_of::<xcb_get_font_path_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_font_path_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_font_path_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_font_path_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_font_path_request_t"]
        [::std::mem::size_of::<xcb_get_font_path_request_t>() - 4usize];
    ["Alignment of xcb_get_font_path_request_t"]
        [::std::mem::align_of::<xcb_get_font_path_request_t>() - 2usize];
    ["Offset of field: xcb_get_font_path_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_font_path_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_font_path_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_font_path_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_font_path_request_t::length"]
        [::std::mem::offset_of!(xcb_get_font_path_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_font_path_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub path_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_font_path_reply_t"]
        [::std::mem::size_of::<xcb_get_font_path_reply_t>() - 32usize];
    ["Alignment of xcb_get_font_path_reply_t"]
        [::std::mem::align_of::<xcb_get_font_path_reply_t>() - 4usize];
    ["Offset of field: xcb_get_font_path_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_font_path_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_font_path_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_font_path_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_font_path_reply_t::path_len"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, path_len) - 8usize];
    ["Offset of field: xcb_get_font_path_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_get_font_path_reply_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_pixmap_request_t {
    pub major_opcode: u8,
    pub depth: u8,
    pub length: u16,
    pub pid: xcb_pixmap_t,
    pub drawable: xcb_drawable_t,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_pixmap_request_t"]
        [::std::mem::size_of::<xcb_create_pixmap_request_t>() - 16usize];
    ["Alignment of xcb_create_pixmap_request_t"]
        [::std::mem::align_of::<xcb_create_pixmap_request_t>() - 4usize];
    ["Offset of field: xcb_create_pixmap_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_create_pixmap_request_t::depth"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, depth) - 1usize];
    ["Offset of field: xcb_create_pixmap_request_t::length"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, length) - 2usize];
    ["Offset of field: xcb_create_pixmap_request_t::pid"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, pid) - 4usize];
    ["Offset of field: xcb_create_pixmap_request_t::drawable"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, drawable) - 8usize];
    ["Offset of field: xcb_create_pixmap_request_t::width"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, width) - 12usize];
    ["Offset of field: xcb_create_pixmap_request_t::height"]
        [::std::mem::offset_of!(xcb_create_pixmap_request_t, height) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_free_pixmap_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub pixmap: xcb_pixmap_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_free_pixmap_request_t"]
        [::std::mem::size_of::<xcb_free_pixmap_request_t>() - 8usize];
    ["Alignment of xcb_free_pixmap_request_t"]
        [::std::mem::align_of::<xcb_free_pixmap_request_t>() - 4usize];
    ["Offset of field: xcb_free_pixmap_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_free_pixmap_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_free_pixmap_request_t::pad0"]
        [::std::mem::offset_of!(xcb_free_pixmap_request_t, pad0) - 1usize];
    ["Offset of field: xcb_free_pixmap_request_t::length"]
        [::std::mem::offset_of!(xcb_free_pixmap_request_t, length) - 2usize];
    ["Offset of field: xcb_free_pixmap_request_t::pixmap"]
        [::std::mem::offset_of!(xcb_free_pixmap_request_t, pixmap) - 4usize];
};
pub const XCB_GC_FUNCTION: xcb_gc_t = 1;
pub const XCB_GC_PLANE_MASK: xcb_gc_t = 2;
pub const XCB_GC_FOREGROUND: xcb_gc_t = 4;
pub const XCB_GC_BACKGROUND: xcb_gc_t = 8;
pub const XCB_GC_LINE_WIDTH: xcb_gc_t = 16;
pub const XCB_GC_LINE_STYLE: xcb_gc_t = 32;
pub const XCB_GC_CAP_STYLE: xcb_gc_t = 64;
pub const XCB_GC_JOIN_STYLE: xcb_gc_t = 128;
pub const XCB_GC_FILL_STYLE: xcb_gc_t = 256;
pub const XCB_GC_FILL_RULE: xcb_gc_t = 512;
pub const XCB_GC_TILE: xcb_gc_t = 1024;
pub const XCB_GC_STIPPLE: xcb_gc_t = 2048;
pub const XCB_GC_TILE_STIPPLE_ORIGIN_X: xcb_gc_t = 4096;
pub const XCB_GC_TILE_STIPPLE_ORIGIN_Y: xcb_gc_t = 8192;
pub const XCB_GC_FONT: xcb_gc_t = 16384;
pub const XCB_GC_SUBWINDOW_MODE: xcb_gc_t = 32768;
pub const XCB_GC_GRAPHICS_EXPOSURES: xcb_gc_t = 65536;
pub const XCB_GC_CLIP_ORIGIN_X: xcb_gc_t = 131072;
pub const XCB_GC_CLIP_ORIGIN_Y: xcb_gc_t = 262144;
pub const XCB_GC_CLIP_MASK: xcb_gc_t = 524288;
pub const XCB_GC_DASH_OFFSET: xcb_gc_t = 1048576;
pub const XCB_GC_DASH_LIST: xcb_gc_t = 2097152;
pub const XCB_GC_ARC_MODE: xcb_gc_t = 4194304;
pub type xcb_gc_t = ::std::os::raw::c_uint;
pub const XCB_GX_CLEAR: xcb_gx_t = 0;
pub const XCB_GX_AND: xcb_gx_t = 1;
pub const XCB_GX_AND_REVERSE: xcb_gx_t = 2;
pub const XCB_GX_COPY: xcb_gx_t = 3;
pub const XCB_GX_AND_INVERTED: xcb_gx_t = 4;
pub const XCB_GX_NOOP: xcb_gx_t = 5;
pub const XCB_GX_XOR: xcb_gx_t = 6;
pub const XCB_GX_OR: xcb_gx_t = 7;
pub const XCB_GX_NOR: xcb_gx_t = 8;
pub const XCB_GX_EQUIV: xcb_gx_t = 9;
pub const XCB_GX_INVERT: xcb_gx_t = 10;
pub const XCB_GX_OR_REVERSE: xcb_gx_t = 11;
pub const XCB_GX_COPY_INVERTED: xcb_gx_t = 12;
pub const XCB_GX_OR_INVERTED: xcb_gx_t = 13;
pub const XCB_GX_NAND: xcb_gx_t = 14;
pub const XCB_GX_SET: xcb_gx_t = 15;
pub type xcb_gx_t = ::std::os::raw::c_uint;
pub const XCB_LINE_STYLE_SOLID: xcb_line_style_t = 0;
pub const XCB_LINE_STYLE_ON_OFF_DASH: xcb_line_style_t = 1;
pub const XCB_LINE_STYLE_DOUBLE_DASH: xcb_line_style_t = 2;
pub type xcb_line_style_t = ::std::os::raw::c_uint;
pub const XCB_CAP_STYLE_NOT_LAST: xcb_cap_style_t = 0;
pub const XCB_CAP_STYLE_BUTT: xcb_cap_style_t = 1;
pub const XCB_CAP_STYLE_ROUND: xcb_cap_style_t = 2;
pub const XCB_CAP_STYLE_PROJECTING: xcb_cap_style_t = 3;
pub type xcb_cap_style_t = ::std::os::raw::c_uint;
pub const XCB_JOIN_STYLE_MITER: xcb_join_style_t = 0;
pub const XCB_JOIN_STYLE_ROUND: xcb_join_style_t = 1;
pub const XCB_JOIN_STYLE_BEVEL: xcb_join_style_t = 2;
pub type xcb_join_style_t = ::std::os::raw::c_uint;
pub const XCB_FILL_STYLE_SOLID: xcb_fill_style_t = 0;
pub const XCB_FILL_STYLE_TILED: xcb_fill_style_t = 1;
pub const XCB_FILL_STYLE_STIPPLED: xcb_fill_style_t = 2;
pub const XCB_FILL_STYLE_OPAQUE_STIPPLED: xcb_fill_style_t = 3;
pub type xcb_fill_style_t = ::std::os::raw::c_uint;
pub const XCB_FILL_RULE_EVEN_ODD: xcb_fill_rule_t = 0;
pub const XCB_FILL_RULE_WINDING: xcb_fill_rule_t = 1;
pub type xcb_fill_rule_t = ::std::os::raw::c_uint;
pub const XCB_SUBWINDOW_MODE_CLIP_BY_CHILDREN: xcb_subwindow_mode_t = 0;
pub const XCB_SUBWINDOW_MODE_INCLUDE_INFERIORS: xcb_subwindow_mode_t = 1;
pub type xcb_subwindow_mode_t = ::std::os::raw::c_uint;
pub const XCB_ARC_MODE_CHORD: xcb_arc_mode_t = 0;
pub const XCB_ARC_MODE_PIE_SLICE: xcb_arc_mode_t = 1;
pub type xcb_arc_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_gc_value_list_t {
    pub function: u32,
    pub plane_mask: u32,
    pub foreground: u32,
    pub background: u32,
    pub line_width: u32,
    pub line_style: u32,
    pub cap_style: u32,
    pub join_style: u32,
    pub fill_style: u32,
    pub fill_rule: u32,
    pub tile: xcb_pixmap_t,
    pub stipple: xcb_pixmap_t,
    pub tile_stipple_x_origin: i32,
    pub tile_stipple_y_origin: i32,
    pub font: xcb_font_t,
    pub subwindow_mode: u32,
    pub graphics_exposures: xcb_bool32_t,
    pub clip_x_origin: i32,
    pub clip_y_origin: i32,
    pub clip_mask: xcb_pixmap_t,
    pub dash_offset: u32,
    pub dashes: u32,
    pub arc_mode: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_gc_value_list_t"]
        [::std::mem::size_of::<xcb_create_gc_value_list_t>() - 92usize];
    ["Alignment of xcb_create_gc_value_list_t"]
        [::std::mem::align_of::<xcb_create_gc_value_list_t>() - 4usize];
    ["Offset of field: xcb_create_gc_value_list_t::function"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, function) - 0usize];
    ["Offset of field: xcb_create_gc_value_list_t::plane_mask"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, plane_mask) - 4usize];
    ["Offset of field: xcb_create_gc_value_list_t::foreground"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, foreground) - 8usize];
    ["Offset of field: xcb_create_gc_value_list_t::background"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, background) - 12usize];
    ["Offset of field: xcb_create_gc_value_list_t::line_width"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, line_width) - 16usize];
    ["Offset of field: xcb_create_gc_value_list_t::line_style"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, line_style) - 20usize];
    ["Offset of field: xcb_create_gc_value_list_t::cap_style"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, cap_style) - 24usize];
    ["Offset of field: xcb_create_gc_value_list_t::join_style"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, join_style) - 28usize];
    ["Offset of field: xcb_create_gc_value_list_t::fill_style"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, fill_style) - 32usize];
    ["Offset of field: xcb_create_gc_value_list_t::fill_rule"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, fill_rule) - 36usize];
    ["Offset of field: xcb_create_gc_value_list_t::tile"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, tile) - 40usize];
    ["Offset of field: xcb_create_gc_value_list_t::stipple"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, stipple) - 44usize];
    ["Offset of field: xcb_create_gc_value_list_t::tile_stipple_x_origin"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, tile_stipple_x_origin) - 48usize];
    ["Offset of field: xcb_create_gc_value_list_t::tile_stipple_y_origin"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, tile_stipple_y_origin) - 52usize];
    ["Offset of field: xcb_create_gc_value_list_t::font"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, font) - 56usize];
    ["Offset of field: xcb_create_gc_value_list_t::subwindow_mode"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, subwindow_mode) - 60usize];
    ["Offset of field: xcb_create_gc_value_list_t::graphics_exposures"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, graphics_exposures) - 64usize];
    ["Offset of field: xcb_create_gc_value_list_t::clip_x_origin"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, clip_x_origin) - 68usize];
    ["Offset of field: xcb_create_gc_value_list_t::clip_y_origin"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, clip_y_origin) - 72usize];
    ["Offset of field: xcb_create_gc_value_list_t::clip_mask"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, clip_mask) - 76usize];
    ["Offset of field: xcb_create_gc_value_list_t::dash_offset"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, dash_offset) - 80usize];
    ["Offset of field: xcb_create_gc_value_list_t::dashes"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, dashes) - 84usize];
    ["Offset of field: xcb_create_gc_value_list_t::arc_mode"]
        [::std::mem::offset_of!(xcb_create_gc_value_list_t, arc_mode) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_gc_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub cid: xcb_gcontext_t,
    pub drawable: xcb_drawable_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_gc_request_t"][::std::mem::size_of::<xcb_create_gc_request_t>() - 16usize];
    ["Alignment of xcb_create_gc_request_t"]
        [::std::mem::align_of::<xcb_create_gc_request_t>() - 4usize];
    ["Offset of field: xcb_create_gc_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_create_gc_request_t::pad0"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, pad0) - 1usize];
    ["Offset of field: xcb_create_gc_request_t::length"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, length) - 2usize];
    ["Offset of field: xcb_create_gc_request_t::cid"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, cid) - 4usize];
    ["Offset of field: xcb_create_gc_request_t::drawable"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, drawable) - 8usize];
    ["Offset of field: xcb_create_gc_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_create_gc_request_t, value_mask) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_gc_value_list_t {
    pub function: u32,
    pub plane_mask: u32,
    pub foreground: u32,
    pub background: u32,
    pub line_width: u32,
    pub line_style: u32,
    pub cap_style: u32,
    pub join_style: u32,
    pub fill_style: u32,
    pub fill_rule: u32,
    pub tile: xcb_pixmap_t,
    pub stipple: xcb_pixmap_t,
    pub tile_stipple_x_origin: i32,
    pub tile_stipple_y_origin: i32,
    pub font: xcb_font_t,
    pub subwindow_mode: u32,
    pub graphics_exposures: xcb_bool32_t,
    pub clip_x_origin: i32,
    pub clip_y_origin: i32,
    pub clip_mask: xcb_pixmap_t,
    pub dash_offset: u32,
    pub dashes: u32,
    pub arc_mode: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_gc_value_list_t"]
        [::std::mem::size_of::<xcb_change_gc_value_list_t>() - 92usize];
    ["Alignment of xcb_change_gc_value_list_t"]
        [::std::mem::align_of::<xcb_change_gc_value_list_t>() - 4usize];
    ["Offset of field: xcb_change_gc_value_list_t::function"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, function) - 0usize];
    ["Offset of field: xcb_change_gc_value_list_t::plane_mask"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, plane_mask) - 4usize];
    ["Offset of field: xcb_change_gc_value_list_t::foreground"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, foreground) - 8usize];
    ["Offset of field: xcb_change_gc_value_list_t::background"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, background) - 12usize];
    ["Offset of field: xcb_change_gc_value_list_t::line_width"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, line_width) - 16usize];
    ["Offset of field: xcb_change_gc_value_list_t::line_style"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, line_style) - 20usize];
    ["Offset of field: xcb_change_gc_value_list_t::cap_style"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, cap_style) - 24usize];
    ["Offset of field: xcb_change_gc_value_list_t::join_style"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, join_style) - 28usize];
    ["Offset of field: xcb_change_gc_value_list_t::fill_style"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, fill_style) - 32usize];
    ["Offset of field: xcb_change_gc_value_list_t::fill_rule"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, fill_rule) - 36usize];
    ["Offset of field: xcb_change_gc_value_list_t::tile"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, tile) - 40usize];
    ["Offset of field: xcb_change_gc_value_list_t::stipple"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, stipple) - 44usize];
    ["Offset of field: xcb_change_gc_value_list_t::tile_stipple_x_origin"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, tile_stipple_x_origin) - 48usize];
    ["Offset of field: xcb_change_gc_value_list_t::tile_stipple_y_origin"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, tile_stipple_y_origin) - 52usize];
    ["Offset of field: xcb_change_gc_value_list_t::font"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, font) - 56usize];
    ["Offset of field: xcb_change_gc_value_list_t::subwindow_mode"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, subwindow_mode) - 60usize];
    ["Offset of field: xcb_change_gc_value_list_t::graphics_exposures"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, graphics_exposures) - 64usize];
    ["Offset of field: xcb_change_gc_value_list_t::clip_x_origin"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, clip_x_origin) - 68usize];
    ["Offset of field: xcb_change_gc_value_list_t::clip_y_origin"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, clip_y_origin) - 72usize];
    ["Offset of field: xcb_change_gc_value_list_t::clip_mask"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, clip_mask) - 76usize];
    ["Offset of field: xcb_change_gc_value_list_t::dash_offset"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, dash_offset) - 80usize];
    ["Offset of field: xcb_change_gc_value_list_t::dashes"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, dashes) - 84usize];
    ["Offset of field: xcb_change_gc_value_list_t::arc_mode"]
        [::std::mem::offset_of!(xcb_change_gc_value_list_t, arc_mode) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_gc_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub gc: xcb_gcontext_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_gc_request_t"][::std::mem::size_of::<xcb_change_gc_request_t>() - 12usize];
    ["Alignment of xcb_change_gc_request_t"]
        [::std::mem::align_of::<xcb_change_gc_request_t>() - 4usize];
    ["Offset of field: xcb_change_gc_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_gc_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_gc_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_gc_request_t, pad0) - 1usize];
    ["Offset of field: xcb_change_gc_request_t::length"]
        [::std::mem::offset_of!(xcb_change_gc_request_t, length) - 2usize];
    ["Offset of field: xcb_change_gc_request_t::gc"]
        [::std::mem::offset_of!(xcb_change_gc_request_t, gc) - 4usize];
    ["Offset of field: xcb_change_gc_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_change_gc_request_t, value_mask) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_copy_gc_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_gc: xcb_gcontext_t,
    pub dst_gc: xcb_gcontext_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_copy_gc_request_t"][::std::mem::size_of::<xcb_copy_gc_request_t>() - 16usize];
    ["Alignment of xcb_copy_gc_request_t"]
        [::std::mem::align_of::<xcb_copy_gc_request_t>() - 4usize];
    ["Offset of field: xcb_copy_gc_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_copy_gc_request_t::pad0"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, pad0) - 1usize];
    ["Offset of field: xcb_copy_gc_request_t::length"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, length) - 2usize];
    ["Offset of field: xcb_copy_gc_request_t::src_gc"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, src_gc) - 4usize];
    ["Offset of field: xcb_copy_gc_request_t::dst_gc"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, dst_gc) - 8usize];
    ["Offset of field: xcb_copy_gc_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_copy_gc_request_t, value_mask) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_dashes_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub gc: xcb_gcontext_t,
    pub dash_offset: u16,
    pub dashes_len: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_dashes_request_t"]
        [::std::mem::size_of::<xcb_set_dashes_request_t>() - 12usize];
    ["Alignment of xcb_set_dashes_request_t"]
        [::std::mem::align_of::<xcb_set_dashes_request_t>() - 4usize];
    ["Offset of field: xcb_set_dashes_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_dashes_request_t::pad0"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, pad0) - 1usize];
    ["Offset of field: xcb_set_dashes_request_t::length"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, length) - 2usize];
    ["Offset of field: xcb_set_dashes_request_t::gc"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, gc) - 4usize];
    ["Offset of field: xcb_set_dashes_request_t::dash_offset"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, dash_offset) - 8usize];
    ["Offset of field: xcb_set_dashes_request_t::dashes_len"]
        [::std::mem::offset_of!(xcb_set_dashes_request_t, dashes_len) - 10usize];
};
pub const xcb_clip_ordering_t_XCB_CLIP_ORDERING_UNSORTED: xcb_clip_ordering_t = 0;
pub const xcb_clip_ordering_t_XCB_CLIP_ORDERING_Y_SORTED: xcb_clip_ordering_t = 1;
pub const xcb_clip_ordering_t_XCB_CLIP_ORDERING_YX_SORTED: xcb_clip_ordering_t = 2;
pub const xcb_clip_ordering_t_XCB_CLIP_ORDERING_YX_BANDED: xcb_clip_ordering_t = 3;
pub type xcb_clip_ordering_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_clip_rectangles_request_t {
    pub major_opcode: u8,
    pub ordering: u8,
    pub length: u16,
    pub gc: xcb_gcontext_t,
    pub clip_x_origin: i16,
    pub clip_y_origin: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_clip_rectangles_request_t"]
        [::std::mem::size_of::<xcb_set_clip_rectangles_request_t>() - 12usize];
    ["Alignment of xcb_set_clip_rectangles_request_t"]
        [::std::mem::align_of::<xcb_set_clip_rectangles_request_t>() - 4usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::ordering"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, ordering) - 1usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::length"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, length) - 2usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::gc"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, gc) - 4usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::clip_x_origin"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, clip_x_origin) - 8usize];
    ["Offset of field: xcb_set_clip_rectangles_request_t::clip_y_origin"]
        [::std::mem::offset_of!(xcb_set_clip_rectangles_request_t, clip_y_origin) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_free_gc_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_free_gc_request_t"][::std::mem::size_of::<xcb_free_gc_request_t>() - 8usize];
    ["Alignment of xcb_free_gc_request_t"]
        [::std::mem::align_of::<xcb_free_gc_request_t>() - 4usize];
    ["Offset of field: xcb_free_gc_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_free_gc_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_free_gc_request_t::pad0"]
        [::std::mem::offset_of!(xcb_free_gc_request_t, pad0) - 1usize];
    ["Offset of field: xcb_free_gc_request_t::length"]
        [::std::mem::offset_of!(xcb_free_gc_request_t, length) - 2usize];
    ["Offset of field: xcb_free_gc_request_t::gc"]
        [::std::mem::offset_of!(xcb_free_gc_request_t, gc) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_clear_area_request_t {
    pub major_opcode: u8,
    pub exposures: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_clear_area_request_t"]
        [::std::mem::size_of::<xcb_clear_area_request_t>() - 16usize];
    ["Alignment of xcb_clear_area_request_t"]
        [::std::mem::align_of::<xcb_clear_area_request_t>() - 4usize];
    ["Offset of field: xcb_clear_area_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_clear_area_request_t::exposures"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, exposures) - 1usize];
    ["Offset of field: xcb_clear_area_request_t::length"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, length) - 2usize];
    ["Offset of field: xcb_clear_area_request_t::window"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, window) - 4usize];
    ["Offset of field: xcb_clear_area_request_t::x"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, x) - 8usize];
    ["Offset of field: xcb_clear_area_request_t::y"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, y) - 10usize];
    ["Offset of field: xcb_clear_area_request_t::width"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, width) - 12usize];
    ["Offset of field: xcb_clear_area_request_t::height"]
        [::std::mem::offset_of!(xcb_clear_area_request_t, height) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_copy_area_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_drawable: xcb_drawable_t,
    pub dst_drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
    pub src_x: i16,
    pub src_y: i16,
    pub dst_x: i16,
    pub dst_y: i16,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_copy_area_request_t"][::std::mem::size_of::<xcb_copy_area_request_t>() - 28usize];
    ["Alignment of xcb_copy_area_request_t"]
        [::std::mem::align_of::<xcb_copy_area_request_t>() - 4usize];
    ["Offset of field: xcb_copy_area_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_copy_area_request_t::pad0"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, pad0) - 1usize];
    ["Offset of field: xcb_copy_area_request_t::length"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, length) - 2usize];
    ["Offset of field: xcb_copy_area_request_t::src_drawable"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, src_drawable) - 4usize];
    ["Offset of field: xcb_copy_area_request_t::dst_drawable"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, dst_drawable) - 8usize];
    ["Offset of field: xcb_copy_area_request_t::gc"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, gc) - 12usize];
    ["Offset of field: xcb_copy_area_request_t::src_x"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, src_x) - 16usize];
    ["Offset of field: xcb_copy_area_request_t::src_y"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, src_y) - 18usize];
    ["Offset of field: xcb_copy_area_request_t::dst_x"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, dst_x) - 20usize];
    ["Offset of field: xcb_copy_area_request_t::dst_y"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, dst_y) - 22usize];
    ["Offset of field: xcb_copy_area_request_t::width"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, width) - 24usize];
    ["Offset of field: xcb_copy_area_request_t::height"]
        [::std::mem::offset_of!(xcb_copy_area_request_t, height) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_copy_plane_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_drawable: xcb_drawable_t,
    pub dst_drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
    pub src_x: i16,
    pub src_y: i16,
    pub dst_x: i16,
    pub dst_y: i16,
    pub width: u16,
    pub height: u16,
    pub bit_plane: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_copy_plane_request_t"]
        [::std::mem::size_of::<xcb_copy_plane_request_t>() - 32usize];
    ["Alignment of xcb_copy_plane_request_t"]
        [::std::mem::align_of::<xcb_copy_plane_request_t>() - 4usize];
    ["Offset of field: xcb_copy_plane_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_copy_plane_request_t::pad0"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, pad0) - 1usize];
    ["Offset of field: xcb_copy_plane_request_t::length"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, length) - 2usize];
    ["Offset of field: xcb_copy_plane_request_t::src_drawable"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, src_drawable) - 4usize];
    ["Offset of field: xcb_copy_plane_request_t::dst_drawable"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, dst_drawable) - 8usize];
    ["Offset of field: xcb_copy_plane_request_t::gc"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, gc) - 12usize];
    ["Offset of field: xcb_copy_plane_request_t::src_x"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, src_x) - 16usize];
    ["Offset of field: xcb_copy_plane_request_t::src_y"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, src_y) - 18usize];
    ["Offset of field: xcb_copy_plane_request_t::dst_x"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, dst_x) - 20usize];
    ["Offset of field: xcb_copy_plane_request_t::dst_y"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, dst_y) - 22usize];
    ["Offset of field: xcb_copy_plane_request_t::width"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, width) - 24usize];
    ["Offset of field: xcb_copy_plane_request_t::height"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, height) - 26usize];
    ["Offset of field: xcb_copy_plane_request_t::bit_plane"]
        [::std::mem::offset_of!(xcb_copy_plane_request_t, bit_plane) - 28usize];
};
pub const XCB_COORD_MODE_ORIGIN: xcb_coord_mode_t = 0;
pub const XCB_COORD_MODE_PREVIOUS: xcb_coord_mode_t = 1;
pub type xcb_coord_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_poly_point_request_t {
    pub major_opcode: u8,
    pub coordinate_mode: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_poly_point_request_t"]
        [::std::mem::size_of::<xcb_poly_point_request_t>() - 12usize];
    ["Alignment of xcb_poly_point_request_t"]
        [::std::mem::align_of::<xcb_poly_point_request_t>() - 4usize];
    ["Offset of field: xcb_poly_point_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_poly_point_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_poly_point_request_t::coordinate_mode"]
        [::std::mem::offset_of!(xcb_poly_point_request_t, coordinate_mode) - 1usize];
    ["Offset of field: xcb_poly_point_request_t::length"]
        [::std::mem::offset_of!(xcb_poly_point_request_t, length) - 2usize];
    ["Offset of field: xcb_poly_point_request_t::drawable"]
        [::std::mem::offset_of!(xcb_poly_point_request_t, drawable) - 4usize];
    ["Offset of field: xcb_poly_point_request_t::gc"]
        [::std::mem::offset_of!(xcb_poly_point_request_t, gc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_poly_line_request_t {
    pub major_opcode: u8,
    pub coordinate_mode: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_poly_line_request_t"][::std::mem::size_of::<xcb_poly_line_request_t>() - 12usize];
    ["Alignment of xcb_poly_line_request_t"]
        [::std::mem::align_of::<xcb_poly_line_request_t>() - 4usize];
    ["Offset of field: xcb_poly_line_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_poly_line_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_poly_line_request_t::coordinate_mode"]
        [::std::mem::offset_of!(xcb_poly_line_request_t, coordinate_mode) - 1usize];
    ["Offset of field: xcb_poly_line_request_t::length"]
        [::std::mem::offset_of!(xcb_poly_line_request_t, length) - 2usize];
    ["Offset of field: xcb_poly_line_request_t::drawable"]
        [::std::mem::offset_of!(xcb_poly_line_request_t, drawable) - 4usize];
    ["Offset of field: xcb_poly_line_request_t::gc"]
        [::std::mem::offset_of!(xcb_poly_line_request_t, gc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_segment_t {
    pub x1: i16,
    pub y1: i16,
    pub x2: i16,
    pub y2: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_segment_t"][::std::mem::size_of::<xcb_segment_t>() - 8usize];
    ["Alignment of xcb_segment_t"][::std::mem::align_of::<xcb_segment_t>() - 2usize];
    ["Offset of field: xcb_segment_t::x1"][::std::mem::offset_of!(xcb_segment_t, x1) - 0usize];
    ["Offset of field: xcb_segment_t::y1"][::std::mem::offset_of!(xcb_segment_t, y1) - 2usize];
    ["Offset of field: xcb_segment_t::x2"][::std::mem::offset_of!(xcb_segment_t, x2) - 4usize];
    ["Offset of field: xcb_segment_t::y2"][::std::mem::offset_of!(xcb_segment_t, y2) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_segment_iterator_t {
    pub data: *mut xcb_segment_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_segment_iterator_t"][::std::mem::size_of::<xcb_segment_iterator_t>() - 16usize];
    ["Alignment of xcb_segment_iterator_t"]
        [::std::mem::align_of::<xcb_segment_iterator_t>() - 8usize];
    ["Offset of field: xcb_segment_iterator_t::data"]
        [::std::mem::offset_of!(xcb_segment_iterator_t, data) - 0usize];
    ["Offset of field: xcb_segment_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_segment_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_segment_iterator_t::index"]
        [::std::mem::offset_of!(xcb_segment_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_poly_segment_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_poly_segment_request_t"]
        [::std::mem::size_of::<xcb_poly_segment_request_t>() - 12usize];
    ["Alignment of xcb_poly_segment_request_t"]
        [::std::mem::align_of::<xcb_poly_segment_request_t>() - 4usize];
    ["Offset of field: xcb_poly_segment_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_poly_segment_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_poly_segment_request_t::pad0"]
        [::std::mem::offset_of!(xcb_poly_segment_request_t, pad0) - 1usize];
    ["Offset of field: xcb_poly_segment_request_t::length"]
        [::std::mem::offset_of!(xcb_poly_segment_request_t, length) - 2usize];
    ["Offset of field: xcb_poly_segment_request_t::drawable"]
        [::std::mem::offset_of!(xcb_poly_segment_request_t, drawable) - 4usize];
    ["Offset of field: xcb_poly_segment_request_t::gc"]
        [::std::mem::offset_of!(xcb_poly_segment_request_t, gc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_poly_rectangle_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_poly_rectangle_request_t"]
        [::std::mem::size_of::<xcb_poly_rectangle_request_t>() - 12usize];
    ["Alignment of xcb_poly_rectangle_request_t"]
        [::std::mem::align_of::<xcb_poly_rectangle_request_t>() - 4usize];
    ["Offset of field: xcb_poly_rectangle_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_poly_rectangle_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_poly_rectangle_request_t::pad0"]
        [::std::mem::offset_of!(xcb_poly_rectangle_request_t, pad0) - 1usize];
    ["Offset of field: xcb_poly_rectangle_request_t::length"]
        [::std::mem::offset_of!(xcb_poly_rectangle_request_t, length) - 2usize];
    ["Offset of field: xcb_poly_rectangle_request_t::drawable"]
        [::std::mem::offset_of!(xcb_poly_rectangle_request_t, drawable) - 4usize];
    ["Offset of field: xcb_poly_rectangle_request_t::gc"]
        [::std::mem::offset_of!(xcb_poly_rectangle_request_t, gc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_poly_arc_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
    pub gc: xcb_gcontext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_poly_arc_request_t"][::std::mem::size_of::<xcb_poly_arc_request_t>() - 12usize];
    ["Alignment of xcb_poly_arc_request_t"]
        [::std::mem::align_of::<xcb_poly_arc_request_t>() - 4usize];
    ["Offset of field: xcb_poly_arc_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_poly_arc_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_poly_arc_request_t::pad0"]
        [::std::mem::offset_of!(xcb_poly_arc_request_t, pad0) - 1usize];
    ["Offset of field: xcb_poly_arc_request_t::length"]
        [::std::mem::offset_of!(xcb_poly_arc_request_t, length) - 2usize];
    ["Offset of field: xcb_poly_arc_request_t::drawable"]
        [::std::mem::offset_of!(xcb_poly_arc_request_t, drawable) - 4usize];
    ["Offset of field: xcb_poly_arc_request_t::gc"]
        [::std::mem::offset_of!(xcb_poly_arc_request_t, gc) - 8usize];
};
pub const xcb_poly_shape_t_XCB_POLY_SHAPE_COMPLEX: xcb_poly_shape_t = 0;
pub const xcb_poly_shape_t_XCB_POLY_SHAPE_NONCONVEX: xcb_poly_shape_t = 1;
pub const xcb_poly_shape_t_XCB_POLY_SHAPE_CONVEX: xcb_poly_shape_t = 2;
pub type xcb_poly_shape_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fill_poly_request_t {
