/* automatically generated by rust-bindgen 0.71.1 */

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}
pub const _SYS_TYPES_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;

pub const _deviceButton1Motion: u32 = 1;
pub const _deviceButton2Motion: u32 = 2;
pub const _deviceButton3Motion: u32 = 3;
pub const _deviceButton4Motion: u32 = 4;
pub const _deviceButton5Motion: u32 = 5;
pub const _deviceButtonMotion: u32 = 6;
pub const _deviceButtonGrab: u32 = 7;
pub const _deviceOwnerGrabButton: u32 = 8;
pub const _noExtensionEvent: u32 = 9;
pub const _devicePresence: u32 = 0;
pub const _deviceEnter: u32 = 0;
pub const _deviceLeave: u32 = 1;
pub const DeviceAdded: u32 = 0;
pub const DeviceRemoved: u32 = 1;
pub const DeviceEnabled: u32 = 2;
pub const DeviceDisabled: u32 = 3;
pub const DeviceUnrecoverable: u32 = 4;
pub const DeviceControlChanged: u32 = 5;
pub const XI_BadDevice: u32 = 0;
pub const XI_BadEvent: u32 = 1;
pub const XI_BadMode: u32 = 2;
pub const XI_DeviceBusy: u32 = 3;
pub const XI_BadClass: u32 = 4;
pub const _deviceKeyPress: u32 = 0;
pub const _deviceKeyRelease: u32 = 1;
pub const _deviceButtonPress: u32 = 0;
pub const _deviceButtonRelease: u32 = 1;
pub const _deviceMotionNotify: u32 = 0;
pub const _deviceFocusIn: u32 = 0;
pub const _deviceFocusOut: u32 = 1;
pub const _proximityIn: u32 = 0;
pub const _proximityOut: u32 = 1;
pub const _deviceStateNotify: u32 = 0;
pub const _deviceMappingNotify: u32 = 1;
pub const _changeDeviceNotify: u32 = 2;
pub const _propertyNotify: u32 = 6;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 40usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
unsafe extern "C" {
    pub fn readv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn writev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn preadv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwritev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::std::mem::size_of::<sched_param>() - 4usize];
    ["Alignment of sched_param"][::std::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::sched_priority"]
        [::std::mem::offset_of!(sched_param, sched_priority) - 0usize];
};
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::std::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::std::mem::align_of::<cpu_set_t>() - 8usize];
    ["Offset of field: cpu_set_t::__bits"][::std::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
unsafe extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
unsafe extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
unsafe extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 200usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 8usize];
    ["Offset of field: __jmp_buf_tag::__jmpbuf"]
        [::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    ["Offset of field: __jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 64usize];
    ["Offset of field: __jmp_buf_tag::__saved_mask"]
        [::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 72usize];
};
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 = 0;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cleanup_buffer"][::std::mem::size_of::<_pthread_cleanup_buffer>() - 32usize];
    ["Alignment of _pthread_cleanup_buffer"]
        [::std::mem::align_of::<_pthread_cleanup_buffer>() - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__routine"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __routine) - 0usize];
    ["Offset of field: _pthread_cleanup_buffer::__arg"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __arg) - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__canceltype"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __canceltype) - 16usize];
    ["Offset of field: _pthread_cleanup_buffer::__prev"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __prev) - 24usize];
};
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void) -> !;
}
unsafe extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_self() -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut ::std::os::raw::c_int,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcancelstate(
        __state: ::std::os::raw::c_int,
        __oldstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcanceltype(
        __type: ::std::os::raw::c_int,
        __oldtype: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __cancel_jmp_buf_tag {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __cancel_jmp_buf_tag"][::std::mem::size_of::<__cancel_jmp_buf_tag>() - 72usize];
    ["Alignment of __cancel_jmp_buf_tag"][::std::mem::align_of::<__cancel_jmp_buf_tag>() - 8usize];
    ["Offset of field: __cancel_jmp_buf_tag::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __cancel_jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __mask_was_saved) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__cancel_jmp_buf_tag; 1usize],
    pub __pad: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_unwind_buf_t"][::std::mem::size_of::<__pthread_unwind_buf_t>() - 104usize];
    ["Alignment of __pthread_unwind_buf_t"]
        [::std::mem::align_of::<__pthread_unwind_buf_t>() - 8usize];
    ["Offset of field: __pthread_unwind_buf_t::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __pthread_unwind_buf_t::__pad"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __pad) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __cancel_arg: *mut ::std::os::raw::c_void,
    pub __do_it: ::std::os::raw::c_int,
    pub __cancel_type: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cleanup_frame"][::std::mem::size_of::<__pthread_cleanup_frame>() - 24usize];
    ["Alignment of __pthread_cleanup_frame"]
        [::std::mem::align_of::<__pthread_cleanup_frame>() - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_routine"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_routine) - 0usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_arg"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_arg) - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__do_it"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __do_it) - 16usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_type"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_type) - 20usize];
};
unsafe extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t) -> !;
}
unsafe extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: ::std::os::raw::c_int,
        __old_ceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_atfork(
        __prepare: ::std::option::Option<unsafe extern "C" fn()>,
        __parent: ::std::option::Option<unsafe extern "C" fn()>,
        __child: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_connection_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_iterator_t {
    pub data: *mut ::std::os::raw::c_void,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_iterator_t"][::std::mem::size_of::<xcb_generic_iterator_t>() - 16usize];
    ["Alignment of xcb_generic_iterator_t"]
        [::std::mem::align_of::<xcb_generic_iterator_t>() - 8usize];
    ["Offset of field: xcb_generic_iterator_t::data"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, data) - 0usize];
    ["Offset of field: xcb_generic_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_generic_iterator_t::index"]
        [::std::mem::offset_of!(xcb_generic_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_reply_t"][::std::mem::size_of::<xcb_generic_reply_t>() - 8usize];
    ["Alignment of xcb_generic_reply_t"][::std::mem::align_of::<xcb_generic_reply_t>() - 4usize];
    ["Offset of field: xcb_generic_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_generic_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_reply_t::length"]
        [::std::mem::offset_of!(xcb_generic_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub pad: [u32; 7usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_event_t"][::std::mem::size_of::<xcb_generic_event_t>() - 36usize];
    ["Alignment of xcb_generic_event_t"][::std::mem::align_of::<xcb_generic_event_t>() - 4usize];
    ["Offset of field: xcb_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_event_t, pad0) - 1usize];
    ["Offset of field: xcb_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_event_t::pad"]
        [::std::mem::offset_of!(xcb_generic_event_t, pad) - 4usize];
    ["Offset of field: xcb_generic_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_generic_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_raw_generic_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub pad: [u32; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_raw_generic_event_t"][::std::mem::size_of::<xcb_raw_generic_event_t>() - 32usize];
    ["Alignment of xcb_raw_generic_event_t"]
        [::std::mem::align_of::<xcb_raw_generic_event_t>() - 4usize];
    ["Offset of field: xcb_raw_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_raw_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, pad0) - 1usize];
    ["Offset of field: xcb_raw_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_raw_generic_event_t::pad"]
        [::std::mem::offset_of!(xcb_raw_generic_event_t, pad) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ge_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub event_type: u16,
    pub pad1: u16,
    pub pad: [u32; 5usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ge_event_t"][::std::mem::size_of::<xcb_ge_event_t>() - 36usize];
    ["Alignment of xcb_ge_event_t"][::std::mem::align_of::<xcb_ge_event_t>() - 4usize];
    ["Offset of field: xcb_ge_event_t::response_type"]
        [::std::mem::offset_of!(xcb_ge_event_t, response_type) - 0usize];
    ["Offset of field: xcb_ge_event_t::pad0"]
        [::std::mem::offset_of!(xcb_ge_event_t, pad0) - 1usize];
    ["Offset of field: xcb_ge_event_t::sequence"]
        [::std::mem::offset_of!(xcb_ge_event_t, sequence) - 2usize];
    ["Offset of field: xcb_ge_event_t::length"]
        [::std::mem::offset_of!(xcb_ge_event_t, length) - 4usize];
    ["Offset of field: xcb_ge_event_t::event_type"]
        [::std::mem::offset_of!(xcb_ge_event_t, event_type) - 8usize];
    ["Offset of field: xcb_ge_event_t::pad1"]
        [::std::mem::offset_of!(xcb_ge_event_t, pad1) - 10usize];
    ["Offset of field: xcb_ge_event_t::pad"][::std::mem::offset_of!(xcb_ge_event_t, pad) - 12usize];
    ["Offset of field: xcb_ge_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_ge_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_generic_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub resource_id: u32,
    pub minor_code: u16,
    pub major_code: u8,
    pub pad0: u8,
    pub pad: [u32; 5usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_generic_error_t"][::std::mem::size_of::<xcb_generic_error_t>() - 36usize];
    ["Alignment of xcb_generic_error_t"][::std::mem::align_of::<xcb_generic_error_t>() - 4usize];
    ["Offset of field: xcb_generic_error_t::response_type"]
        [::std::mem::offset_of!(xcb_generic_error_t, response_type) - 0usize];
    ["Offset of field: xcb_generic_error_t::error_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, error_code) - 1usize];
    ["Offset of field: xcb_generic_error_t::sequence"]
        [::std::mem::offset_of!(xcb_generic_error_t, sequence) - 2usize];
    ["Offset of field: xcb_generic_error_t::resource_id"]
        [::std::mem::offset_of!(xcb_generic_error_t, resource_id) - 4usize];
    ["Offset of field: xcb_generic_error_t::minor_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, minor_code) - 8usize];
    ["Offset of field: xcb_generic_error_t::major_code"]
        [::std::mem::offset_of!(xcb_generic_error_t, major_code) - 10usize];
    ["Offset of field: xcb_generic_error_t::pad0"]
        [::std::mem::offset_of!(xcb_generic_error_t, pad0) - 11usize];
    ["Offset of field: xcb_generic_error_t::pad"]
        [::std::mem::offset_of!(xcb_generic_error_t, pad) - 12usize];
    ["Offset of field: xcb_generic_error_t::full_sequence"]
        [::std::mem::offset_of!(xcb_generic_error_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_void_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_void_cookie_t"][::std::mem::size_of::<xcb_void_cookie_t>() - 4usize];
    ["Alignment of xcb_void_cookie_t"][::std::mem::align_of::<xcb_void_cookie_t>() - 4usize];
    ["Offset of field: xcb_void_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_void_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_char2b_t {
    pub byte1: u8,
    pub byte2: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_char2b_t"][::std::mem::size_of::<xcb_char2b_t>() - 2usize];
    ["Alignment of xcb_char2b_t"][::std::mem::align_of::<xcb_char2b_t>() - 1usize];
    ["Offset of field: xcb_char2b_t::byte1"][::std::mem::offset_of!(xcb_char2b_t, byte1) - 0usize];
    ["Offset of field: xcb_char2b_t::byte2"][::std::mem::offset_of!(xcb_char2b_t, byte2) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_char2b_iterator_t {
    pub data: *mut xcb_char2b_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_char2b_iterator_t"][::std::mem::size_of::<xcb_char2b_iterator_t>() - 16usize];
    ["Alignment of xcb_char2b_iterator_t"]
        [::std::mem::align_of::<xcb_char2b_iterator_t>() - 8usize];
    ["Offset of field: xcb_char2b_iterator_t::data"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, data) - 0usize];
    ["Offset of field: xcb_char2b_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_char2b_iterator_t::index"]
        [::std::mem::offset_of!(xcb_char2b_iterator_t, index) - 12usize];
};
pub type xcb_window_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_window_iterator_t {
    pub data: *mut xcb_window_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_window_iterator_t"][::std::mem::size_of::<xcb_window_iterator_t>() - 16usize];
    ["Alignment of xcb_window_iterator_t"]
        [::std::mem::align_of::<xcb_window_iterator_t>() - 8usize];
    ["Offset of field: xcb_window_iterator_t::data"]
        [::std::mem::offset_of!(xcb_window_iterator_t, data) - 0usize];
    ["Offset of field: xcb_window_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_window_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_window_iterator_t::index"]
        [::std::mem::offset_of!(xcb_window_iterator_t, index) - 12usize];
};
pub type xcb_pixmap_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_pixmap_iterator_t {
    pub data: *mut xcb_pixmap_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_pixmap_iterator_t"][::std::mem::size_of::<xcb_pixmap_iterator_t>() - 16usize];
    ["Alignment of xcb_pixmap_iterator_t"]
        [::std::mem::align_of::<xcb_pixmap_iterator_t>() - 8usize];
    ["Offset of field: xcb_pixmap_iterator_t::data"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, data) - 0usize];
    ["Offset of field: xcb_pixmap_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_pixmap_iterator_t::index"]
        [::std::mem::offset_of!(xcb_pixmap_iterator_t, index) - 12usize];
};
pub type xcb_cursor_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_cursor_iterator_t {
    pub data: *mut xcb_cursor_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_cursor_iterator_t"][::std::mem::size_of::<xcb_cursor_iterator_t>() - 16usize];
    ["Alignment of xcb_cursor_iterator_t"]
        [::std::mem::align_of::<xcb_cursor_iterator_t>() - 8usize];
    ["Offset of field: xcb_cursor_iterator_t::data"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, data) - 0usize];
    ["Offset of field: xcb_cursor_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_cursor_iterator_t::index"]
        [::std::mem::offset_of!(xcb_cursor_iterator_t, index) - 12usize];
};
pub type xcb_font_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_font_iterator_t {
    pub data: *mut xcb_font_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_font_iterator_t"][::std::mem::size_of::<xcb_font_iterator_t>() - 16usize];
    ["Alignment of xcb_font_iterator_t"][::std::mem::align_of::<xcb_font_iterator_t>() - 8usize];
    ["Offset of field: xcb_font_iterator_t::data"]
        [::std::mem::offset_of!(xcb_font_iterator_t, data) - 0usize];
    ["Offset of field: xcb_font_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_font_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_font_iterator_t::index"]
        [::std::mem::offset_of!(xcb_font_iterator_t, index) - 12usize];
};
pub type xcb_gcontext_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_gcontext_iterator_t {
    pub data: *mut xcb_gcontext_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_gcontext_iterator_t"][::std::mem::size_of::<xcb_gcontext_iterator_t>() - 16usize];
    ["Alignment of xcb_gcontext_iterator_t"]
        [::std::mem::align_of::<xcb_gcontext_iterator_t>() - 8usize];
    ["Offset of field: xcb_gcontext_iterator_t::data"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, data) - 0usize];
    ["Offset of field: xcb_gcontext_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_gcontext_iterator_t::index"]
        [::std::mem::offset_of!(xcb_gcontext_iterator_t, index) - 12usize];
};
pub type xcb_colormap_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_colormap_iterator_t {
    pub data: *mut xcb_colormap_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_colormap_iterator_t"][::std::mem::size_of::<xcb_colormap_iterator_t>() - 16usize];
    ["Alignment of xcb_colormap_iterator_t"]
        [::std::mem::align_of::<xcb_colormap_iterator_t>() - 8usize];
    ["Offset of field: xcb_colormap_iterator_t::data"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, data) - 0usize];
    ["Offset of field: xcb_colormap_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_colormap_iterator_t::index"]
        [::std::mem::offset_of!(xcb_colormap_iterator_t, index) - 12usize];
};
pub type xcb_atom_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_atom_iterator_t {
    pub data: *mut xcb_atom_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_atom_iterator_t"][::std::mem::size_of::<xcb_atom_iterator_t>() - 16usize];
    ["Alignment of xcb_atom_iterator_t"][::std::mem::align_of::<xcb_atom_iterator_t>() - 8usize];
    ["Offset of field: xcb_atom_iterator_t::data"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, data) - 0usize];
    ["Offset of field: xcb_atom_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_atom_iterator_t::index"]
        [::std::mem::offset_of!(xcb_atom_iterator_t, index) - 12usize];
};
pub type xcb_drawable_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_drawable_iterator_t {
    pub data: *mut xcb_drawable_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_drawable_iterator_t"][::std::mem::size_of::<xcb_drawable_iterator_t>() - 16usize];
    ["Alignment of xcb_drawable_iterator_t"]
        [::std::mem::align_of::<xcb_drawable_iterator_t>() - 8usize];
    ["Offset of field: xcb_drawable_iterator_t::data"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, data) - 0usize];
    ["Offset of field: xcb_drawable_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_drawable_iterator_t::index"]
        [::std::mem::offset_of!(xcb_drawable_iterator_t, index) - 12usize];
};
pub type xcb_fontable_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontable_iterator_t {
    pub data: *mut xcb_fontable_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontable_iterator_t"][::std::mem::size_of::<xcb_fontable_iterator_t>() - 16usize];
    ["Alignment of xcb_fontable_iterator_t"]
        [::std::mem::align_of::<xcb_fontable_iterator_t>() - 8usize];
    ["Offset of field: xcb_fontable_iterator_t::data"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, data) - 0usize];
    ["Offset of field: xcb_fontable_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_fontable_iterator_t::index"]
        [::std::mem::offset_of!(xcb_fontable_iterator_t, index) - 12usize];
};
pub type xcb_bool32_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_bool32_iterator_t {
    pub data: *mut xcb_bool32_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_bool32_iterator_t"][::std::mem::size_of::<xcb_bool32_iterator_t>() - 16usize];
    ["Alignment of xcb_bool32_iterator_t"]
        [::std::mem::align_of::<xcb_bool32_iterator_t>() - 8usize];
    ["Offset of field: xcb_bool32_iterator_t::data"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, data) - 0usize];
    ["Offset of field: xcb_bool32_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_bool32_iterator_t::index"]
        [::std::mem::offset_of!(xcb_bool32_iterator_t, index) - 12usize];
};
pub type xcb_visualid_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualid_iterator_t {
    pub data: *mut xcb_visualid_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualid_iterator_t"][::std::mem::size_of::<xcb_visualid_iterator_t>() - 16usize];
    ["Alignment of xcb_visualid_iterator_t"]
        [::std::mem::align_of::<xcb_visualid_iterator_t>() - 8usize];
    ["Offset of field: xcb_visualid_iterator_t::data"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, data) - 0usize];
    ["Offset of field: xcb_visualid_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_visualid_iterator_t::index"]
        [::std::mem::offset_of!(xcb_visualid_iterator_t, index) - 12usize];
};
pub type xcb_timestamp_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timestamp_iterator_t {
    pub data: *mut xcb_timestamp_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timestamp_iterator_t"]
        [::std::mem::size_of::<xcb_timestamp_iterator_t>() - 16usize];
    ["Alignment of xcb_timestamp_iterator_t"]
        [::std::mem::align_of::<xcb_timestamp_iterator_t>() - 8usize];
    ["Offset of field: xcb_timestamp_iterator_t::data"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, data) - 0usize];
    ["Offset of field: xcb_timestamp_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_timestamp_iterator_t::index"]
        [::std::mem::offset_of!(xcb_timestamp_iterator_t, index) - 12usize];
};
pub type xcb_keysym_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keysym_iterator_t {
    pub data: *mut xcb_keysym_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keysym_iterator_t"][::std::mem::size_of::<xcb_keysym_iterator_t>() - 16usize];
    ["Alignment of xcb_keysym_iterator_t"]
        [::std::mem::align_of::<xcb_keysym_iterator_t>() - 8usize];
    ["Offset of field: xcb_keysym_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keysym_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keysym_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keysym_iterator_t, index) - 12usize];
};
pub type xcb_keycode_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keycode_iterator_t {
    pub data: *mut xcb_keycode_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keycode_iterator_t"][::std::mem::size_of::<xcb_keycode_iterator_t>() - 16usize];
    ["Alignment of xcb_keycode_iterator_t"]
        [::std::mem::align_of::<xcb_keycode_iterator_t>() - 8usize];
    ["Offset of field: xcb_keycode_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keycode_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keycode_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keycode_iterator_t, index) - 12usize];
};
pub type xcb_keycode32_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keycode32_iterator_t {
    pub data: *mut xcb_keycode32_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keycode32_iterator_t"]
        [::std::mem::size_of::<xcb_keycode32_iterator_t>() - 16usize];
    ["Alignment of xcb_keycode32_iterator_t"]
        [::std::mem::align_of::<xcb_keycode32_iterator_t>() - 8usize];
    ["Offset of field: xcb_keycode32_iterator_t::data"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, data) - 0usize];
    ["Offset of field: xcb_keycode32_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_keycode32_iterator_t::index"]
        [::std::mem::offset_of!(xcb_keycode32_iterator_t, index) - 12usize];
};
pub type xcb_button_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_button_iterator_t {
    pub data: *mut xcb_button_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_button_iterator_t"][::std::mem::size_of::<xcb_button_iterator_t>() - 16usize];
    ["Alignment of xcb_button_iterator_t"]
        [::std::mem::align_of::<xcb_button_iterator_t>() - 8usize];
    ["Offset of field: xcb_button_iterator_t::data"]
        [::std::mem::offset_of!(xcb_button_iterator_t, data) - 0usize];
    ["Offset of field: xcb_button_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_button_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_button_iterator_t::index"]
        [::std::mem::offset_of!(xcb_button_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_point_t {
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_point_t"][::std::mem::size_of::<xcb_point_t>() - 4usize];
    ["Alignment of xcb_point_t"][::std::mem::align_of::<xcb_point_t>() - 2usize];
    ["Offset of field: xcb_point_t::x"][::std::mem::offset_of!(xcb_point_t, x) - 0usize];
    ["Offset of field: xcb_point_t::y"][::std::mem::offset_of!(xcb_point_t, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_point_iterator_t {
    pub data: *mut xcb_point_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_point_iterator_t"][::std::mem::size_of::<xcb_point_iterator_t>() - 16usize];
    ["Alignment of xcb_point_iterator_t"][::std::mem::align_of::<xcb_point_iterator_t>() - 8usize];
    ["Offset of field: xcb_point_iterator_t::data"]
        [::std::mem::offset_of!(xcb_point_iterator_t, data) - 0usize];
    ["Offset of field: xcb_point_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_point_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_point_iterator_t::index"]
        [::std::mem::offset_of!(xcb_point_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_rectangle_t {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_rectangle_t"][::std::mem::size_of::<xcb_rectangle_t>() - 8usize];
    ["Alignment of xcb_rectangle_t"][::std::mem::align_of::<xcb_rectangle_t>() - 2usize];
    ["Offset of field: xcb_rectangle_t::x"][::std::mem::offset_of!(xcb_rectangle_t, x) - 0usize];
    ["Offset of field: xcb_rectangle_t::y"][::std::mem::offset_of!(xcb_rectangle_t, y) - 2usize];
    ["Offset of field: xcb_rectangle_t::width"]
        [::std::mem::offset_of!(xcb_rectangle_t, width) - 4usize];
    ["Offset of field: xcb_rectangle_t::height"]
        [::std::mem::offset_of!(xcb_rectangle_t, height) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_rectangle_iterator_t {
    pub data: *mut xcb_rectangle_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_rectangle_iterator_t"]
        [::std::mem::size_of::<xcb_rectangle_iterator_t>() - 16usize];
    ["Alignment of xcb_rectangle_iterator_t"]
        [::std::mem::align_of::<xcb_rectangle_iterator_t>() - 8usize];
    ["Offset of field: xcb_rectangle_iterator_t::data"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, data) - 0usize];
    ["Offset of field: xcb_rectangle_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_rectangle_iterator_t::index"]
        [::std::mem::offset_of!(xcb_rectangle_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_arc_t {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub angle1: i16,
    pub angle2: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_arc_t"][::std::mem::size_of::<xcb_arc_t>() - 12usize];
    ["Alignment of xcb_arc_t"][::std::mem::align_of::<xcb_arc_t>() - 2usize];
    ["Offset of field: xcb_arc_t::x"][::std::mem::offset_of!(xcb_arc_t, x) - 0usize];
    ["Offset of field: xcb_arc_t::y"][::std::mem::offset_of!(xcb_arc_t, y) - 2usize];
    ["Offset of field: xcb_arc_t::width"][::std::mem::offset_of!(xcb_arc_t, width) - 4usize];
    ["Offset of field: xcb_arc_t::height"][::std::mem::offset_of!(xcb_arc_t, height) - 6usize];
    ["Offset of field: xcb_arc_t::angle1"][::std::mem::offset_of!(xcb_arc_t, angle1) - 8usize];
    ["Offset of field: xcb_arc_t::angle2"][::std::mem::offset_of!(xcb_arc_t, angle2) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_arc_iterator_t {
    pub data: *mut xcb_arc_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_arc_iterator_t"][::std::mem::size_of::<xcb_arc_iterator_t>() - 16usize];
    ["Alignment of xcb_arc_iterator_t"][::std::mem::align_of::<xcb_arc_iterator_t>() - 8usize];
    ["Offset of field: xcb_arc_iterator_t::data"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, data) - 0usize];
    ["Offset of field: xcb_arc_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_arc_iterator_t::index"]
        [::std::mem::offset_of!(xcb_arc_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_format_t {
    pub depth: u8,
    pub bits_per_pixel: u8,
    pub scanline_pad: u8,
    pub pad0: [u8; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_format_t"][::std::mem::size_of::<xcb_format_t>() - 8usize];
    ["Alignment of xcb_format_t"][::std::mem::align_of::<xcb_format_t>() - 1usize];
    ["Offset of field: xcb_format_t::depth"][::std::mem::offset_of!(xcb_format_t, depth) - 0usize];
    ["Offset of field: xcb_format_t::bits_per_pixel"]
        [::std::mem::offset_of!(xcb_format_t, bits_per_pixel) - 1usize];
    ["Offset of field: xcb_format_t::scanline_pad"]
        [::std::mem::offset_of!(xcb_format_t, scanline_pad) - 2usize];
    ["Offset of field: xcb_format_t::pad0"][::std::mem::offset_of!(xcb_format_t, pad0) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_format_iterator_t {
    pub data: *mut xcb_format_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_format_iterator_t"][::std::mem::size_of::<xcb_format_iterator_t>() - 16usize];
    ["Alignment of xcb_format_iterator_t"]
        [::std::mem::align_of::<xcb_format_iterator_t>() - 8usize];
    ["Offset of field: xcb_format_iterator_t::data"]
        [::std::mem::offset_of!(xcb_format_iterator_t, data) - 0usize];
    ["Offset of field: xcb_format_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_format_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_format_iterator_t::index"]
        [::std::mem::offset_of!(xcb_format_iterator_t, index) - 12usize];
};
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_STATIC_GRAY: xcb_visual_class_t = 0;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_GRAY_SCALE: xcb_visual_class_t = 1;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_STATIC_COLOR: xcb_visual_class_t = 2;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_PSEUDO_COLOR: xcb_visual_class_t = 3;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_TRUE_COLOR: xcb_visual_class_t = 4;
pub const xcb_visual_class_t_XCB_VISUAL_CLASS_DIRECT_COLOR: xcb_visual_class_t = 5;
pub type xcb_visual_class_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualtype_t {
    pub visual_id: xcb_visualid_t,
    pub _class: u8,
    pub bits_per_rgb_value: u8,
    pub colormap_entries: u16,
    pub red_mask: u32,
    pub green_mask: u32,
    pub blue_mask: u32,
    pub pad0: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualtype_t"][::std::mem::size_of::<xcb_visualtype_t>() - 24usize];
    ["Alignment of xcb_visualtype_t"][::std::mem::align_of::<xcb_visualtype_t>() - 4usize];
    ["Offset of field: xcb_visualtype_t::visual_id"]
        [::std::mem::offset_of!(xcb_visualtype_t, visual_id) - 0usize];
    ["Offset of field: xcb_visualtype_t::_class"]
        [::std::mem::offset_of!(xcb_visualtype_t, _class) - 4usize];
    ["Offset of field: xcb_visualtype_t::bits_per_rgb_value"]
        [::std::mem::offset_of!(xcb_visualtype_t, bits_per_rgb_value) - 5usize];
    ["Offset of field: xcb_visualtype_t::colormap_entries"]
        [::std::mem::offset_of!(xcb_visualtype_t, colormap_entries) - 6usize];
    ["Offset of field: xcb_visualtype_t::red_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, red_mask) - 8usize];
    ["Offset of field: xcb_visualtype_t::green_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, green_mask) - 12usize];
    ["Offset of field: xcb_visualtype_t::blue_mask"]
        [::std::mem::offset_of!(xcb_visualtype_t, blue_mask) - 16usize];
    ["Offset of field: xcb_visualtype_t::pad0"]
        [::std::mem::offset_of!(xcb_visualtype_t, pad0) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visualtype_iterator_t {
    pub data: *mut xcb_visualtype_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visualtype_iterator_t"]
        [::std::mem::size_of::<xcb_visualtype_iterator_t>() - 16usize];
    ["Alignment of xcb_visualtype_iterator_t"]
        [::std::mem::align_of::<xcb_visualtype_iterator_t>() - 8usize];
    ["Offset of field: xcb_visualtype_iterator_t::data"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, data) - 0usize];
    ["Offset of field: xcb_visualtype_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_visualtype_iterator_t::index"]
        [::std::mem::offset_of!(xcb_visualtype_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_depth_t {
    pub depth: u8,
    pub pad0: u8,
    pub visuals_len: u16,
    pub pad1: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_depth_t"][::std::mem::size_of::<xcb_depth_t>() - 8usize];
    ["Alignment of xcb_depth_t"][::std::mem::align_of::<xcb_depth_t>() - 2usize];
    ["Offset of field: xcb_depth_t::depth"][::std::mem::offset_of!(xcb_depth_t, depth) - 0usize];
    ["Offset of field: xcb_depth_t::pad0"][::std::mem::offset_of!(xcb_depth_t, pad0) - 1usize];
    ["Offset of field: xcb_depth_t::visuals_len"]
        [::std::mem::offset_of!(xcb_depth_t, visuals_len) - 2usize];
    ["Offset of field: xcb_depth_t::pad1"][::std::mem::offset_of!(xcb_depth_t, pad1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_depth_iterator_t {
    pub data: *mut xcb_depth_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_depth_iterator_t"][::std::mem::size_of::<xcb_depth_iterator_t>() - 16usize];
    ["Alignment of xcb_depth_iterator_t"][::std::mem::align_of::<xcb_depth_iterator_t>() - 8usize];
    ["Offset of field: xcb_depth_iterator_t::data"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, data) - 0usize];
    ["Offset of field: xcb_depth_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_depth_iterator_t::index"]
        [::std::mem::offset_of!(xcb_depth_iterator_t, index) - 12usize];
};
pub const xcb_event_mask_t_XCB_EVENT_MASK_NO_EVENT: xcb_event_mask_t = 0;
pub const xcb_event_mask_t_XCB_EVENT_MASK_KEY_PRESS: xcb_event_mask_t = 1;
pub const xcb_event_mask_t_XCB_EVENT_MASK_KEY_RELEASE: xcb_event_mask_t = 2;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_PRESS: xcb_event_mask_t = 4;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_RELEASE: xcb_event_mask_t = 8;
pub const xcb_event_mask_t_XCB_EVENT_MASK_ENTER_WINDOW: xcb_event_mask_t = 16;
pub const xcb_event_mask_t_XCB_EVENT_MASK_LEAVE_WINDOW: xcb_event_mask_t = 32;
pub const xcb_event_mask_t_XCB_EVENT_MASK_POINTER_MOTION: xcb_event_mask_t = 64;
pub const xcb_event_mask_t_XCB_EVENT_MASK_POINTER_MOTION_HINT: xcb_event_mask_t = 128;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_1_MOTION: xcb_event_mask_t = 256;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_2_MOTION: xcb_event_mask_t = 512;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_3_MOTION: xcb_event_mask_t = 1024;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_4_MOTION: xcb_event_mask_t = 2048;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_5_MOTION: xcb_event_mask_t = 4096;
pub const xcb_event_mask_t_XCB_EVENT_MASK_BUTTON_MOTION: xcb_event_mask_t = 8192;
pub const xcb_event_mask_t_XCB_EVENT_MASK_KEYMAP_STATE: xcb_event_mask_t = 16384;
pub const xcb_event_mask_t_XCB_EVENT_MASK_EXPOSURE: xcb_event_mask_t = 32768;
pub const xcb_event_mask_t_XCB_EVENT_MASK_VISIBILITY_CHANGE: xcb_event_mask_t = 65536;
pub const xcb_event_mask_t_XCB_EVENT_MASK_STRUCTURE_NOTIFY: xcb_event_mask_t = 131072;
pub const xcb_event_mask_t_XCB_EVENT_MASK_RESIZE_REDIRECT: xcb_event_mask_t = 262144;
pub const xcb_event_mask_t_XCB_EVENT_MASK_SUBSTRUCTURE_NOTIFY: xcb_event_mask_t = 524288;
pub const xcb_event_mask_t_XCB_EVENT_MASK_SUBSTRUCTURE_REDIRECT: xcb_event_mask_t = 1048576;
pub const xcb_event_mask_t_XCB_EVENT_MASK_FOCUS_CHANGE: xcb_event_mask_t = 2097152;
pub const xcb_event_mask_t_XCB_EVENT_MASK_PROPERTY_CHANGE: xcb_event_mask_t = 4194304;
pub const xcb_event_mask_t_XCB_EVENT_MASK_COLOR_MAP_CHANGE: xcb_event_mask_t = 8388608;
pub const xcb_event_mask_t_XCB_EVENT_MASK_OWNER_GRAB_BUTTON: xcb_event_mask_t = 16777216;
pub type xcb_event_mask_t = ::std::os::raw::c_uint;
pub const xcb_backing_store_t_XCB_BACKING_STORE_NOT_USEFUL: xcb_backing_store_t = 0;
pub const xcb_backing_store_t_XCB_BACKING_STORE_WHEN_MAPPED: xcb_backing_store_t = 1;
pub const xcb_backing_store_t_XCB_BACKING_STORE_ALWAYS: xcb_backing_store_t = 2;
pub type xcb_backing_store_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_screen_t {
    pub root: xcb_window_t,
    pub default_colormap: xcb_colormap_t,
    pub white_pixel: u32,
    pub black_pixel: u32,
    pub current_input_masks: u32,
    pub width_in_pixels: u16,
    pub height_in_pixels: u16,
    pub width_in_millimeters: u16,
    pub height_in_millimeters: u16,
    pub min_installed_maps: u16,
    pub max_installed_maps: u16,
    pub root_visual: xcb_visualid_t,
    pub backing_stores: u8,
    pub save_unders: u8,
    pub root_depth: u8,
    pub allowed_depths_len: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_screen_t"][::std::mem::size_of::<xcb_screen_t>() - 40usize];
    ["Alignment of xcb_screen_t"][::std::mem::align_of::<xcb_screen_t>() - 4usize];
    ["Offset of field: xcb_screen_t::root"][::std::mem::offset_of!(xcb_screen_t, root) - 0usize];
    ["Offset of field: xcb_screen_t::default_colormap"]
        [::std::mem::offset_of!(xcb_screen_t, default_colormap) - 4usize];
    ["Offset of field: xcb_screen_t::white_pixel"]
        [::std::mem::offset_of!(xcb_screen_t, white_pixel) - 8usize];
    ["Offset of field: xcb_screen_t::black_pixel"]
        [::std::mem::offset_of!(xcb_screen_t, black_pixel) - 12usize];
    ["Offset of field: xcb_screen_t::current_input_masks"]
        [::std::mem::offset_of!(xcb_screen_t, current_input_masks) - 16usize];
    ["Offset of field: xcb_screen_t::width_in_pixels"]
        [::std::mem::offset_of!(xcb_screen_t, width_in_pixels) - 20usize];
    ["Offset of field: xcb_screen_t::height_in_pixels"]
        [::std::mem::offset_of!(xcb_screen_t, height_in_pixels) - 22usize];
    ["Offset of field: xcb_screen_t::width_in_millimeters"]
        [::std::mem::offset_of!(xcb_screen_t, width_in_millimeters) - 24usize];
    ["Offset of field: xcb_screen_t::height_in_millimeters"]
        [::std::mem::offset_of!(xcb_screen_t, height_in_millimeters) - 26usize];
    ["Offset of field: xcb_screen_t::min_installed_maps"]
        [::std::mem::offset_of!(xcb_screen_t, min_installed_maps) - 28usize];
    ["Offset of field: xcb_screen_t::max_installed_maps"]
        [::std::mem::offset_of!(xcb_screen_t, max_installed_maps) - 30usize];
    ["Offset of field: xcb_screen_t::root_visual"]
        [::std::mem::offset_of!(xcb_screen_t, root_visual) - 32usize];
    ["Offset of field: xcb_screen_t::backing_stores"]
        [::std::mem::offset_of!(xcb_screen_t, backing_stores) - 36usize];
    ["Offset of field: xcb_screen_t::save_unders"]
        [::std::mem::offset_of!(xcb_screen_t, save_unders) - 37usize];
    ["Offset of field: xcb_screen_t::root_depth"]
        [::std::mem::offset_of!(xcb_screen_t, root_depth) - 38usize];
    ["Offset of field: xcb_screen_t::allowed_depths_len"]
        [::std::mem::offset_of!(xcb_screen_t, allowed_depths_len) - 39usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_screen_iterator_t {
    pub data: *mut xcb_screen_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_screen_iterator_t"][::std::mem::size_of::<xcb_screen_iterator_t>() - 16usize];
    ["Alignment of xcb_screen_iterator_t"]
        [::std::mem::align_of::<xcb_screen_iterator_t>() - 8usize];
    ["Offset of field: xcb_screen_iterator_t::data"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, data) - 0usize];
    ["Offset of field: xcb_screen_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_screen_iterator_t::index"]
        [::std::mem::offset_of!(xcb_screen_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_request_t {
    pub byte_order: u8,
    pub pad0: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub authorization_protocol_name_len: u16,
    pub authorization_protocol_data_len: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_request_t"][::std::mem::size_of::<xcb_setup_request_t>() - 12usize];
    ["Alignment of xcb_setup_request_t"][::std::mem::align_of::<xcb_setup_request_t>() - 2usize];
    ["Offset of field: xcb_setup_request_t::byte_order"]
        [::std::mem::offset_of!(xcb_setup_request_t, byte_order) - 0usize];
    ["Offset of field: xcb_setup_request_t::pad0"]
        [::std::mem::offset_of!(xcb_setup_request_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_request_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_request_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_request_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_request_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_request_t::authorization_protocol_name_len"]
        [::std::mem::offset_of!(xcb_setup_request_t, authorization_protocol_name_len) - 6usize];
    ["Offset of field: xcb_setup_request_t::authorization_protocol_data_len"]
        [::std::mem::offset_of!(xcb_setup_request_t, authorization_protocol_data_len) - 8usize];
    ["Offset of field: xcb_setup_request_t::pad1"]
        [::std::mem::offset_of!(xcb_setup_request_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_request_iterator_t {
    pub data: *mut xcb_setup_request_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_request_iterator_t"]
        [::std::mem::size_of::<xcb_setup_request_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_request_iterator_t"]
        [::std::mem::align_of::<xcb_setup_request_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_request_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_request_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_request_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_request_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_failed_t {
    pub status: u8,
    pub reason_len: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_failed_t"][::std::mem::size_of::<xcb_setup_failed_t>() - 8usize];
    ["Alignment of xcb_setup_failed_t"][::std::mem::align_of::<xcb_setup_failed_t>() - 2usize];
    ["Offset of field: xcb_setup_failed_t::status"]
        [::std::mem::offset_of!(xcb_setup_failed_t, status) - 0usize];
    ["Offset of field: xcb_setup_failed_t::reason_len"]
        [::std::mem::offset_of!(xcb_setup_failed_t, reason_len) - 1usize];
    ["Offset of field: xcb_setup_failed_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_failed_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_failed_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_failed_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_failed_t::length"]
        [::std::mem::offset_of!(xcb_setup_failed_t, length) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_failed_iterator_t {
    pub data: *mut xcb_setup_failed_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_failed_iterator_t"]
        [::std::mem::size_of::<xcb_setup_failed_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_failed_iterator_t"]
        [::std::mem::align_of::<xcb_setup_failed_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_failed_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_failed_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_failed_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_failed_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_authenticate_t {
    pub status: u8,
    pub pad0: [u8; 5usize],
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_authenticate_t"]
        [::std::mem::size_of::<xcb_setup_authenticate_t>() - 8usize];
    ["Alignment of xcb_setup_authenticate_t"]
        [::std::mem::align_of::<xcb_setup_authenticate_t>() - 2usize];
    ["Offset of field: xcb_setup_authenticate_t::status"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, status) - 0usize];
    ["Offset of field: xcb_setup_authenticate_t::pad0"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_authenticate_t::length"]
        [::std::mem::offset_of!(xcb_setup_authenticate_t, length) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_authenticate_iterator_t {
    pub data: *mut xcb_setup_authenticate_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_authenticate_iterator_t"]
        [::std::mem::size_of::<xcb_setup_authenticate_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_authenticate_iterator_t"]
        [::std::mem::align_of::<xcb_setup_authenticate_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_authenticate_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_authenticate_iterator_t, index) - 12usize];
};
pub const xcb_image_order_t_XCB_IMAGE_ORDER_LSB_FIRST: xcb_image_order_t = 0;
pub const xcb_image_order_t_XCB_IMAGE_ORDER_MSB_FIRST: xcb_image_order_t = 1;
pub type xcb_image_order_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_t {
    pub status: u8,
    pub pad0: u8,
    pub protocol_major_version: u16,
    pub protocol_minor_version: u16,
    pub length: u16,
    pub release_number: u32,
    pub resource_id_base: u32,
    pub resource_id_mask: u32,
    pub motion_buffer_size: u32,
    pub vendor_len: u16,
    pub maximum_request_length: u16,
    pub roots_len: u8,
    pub pixmap_formats_len: u8,
    pub image_byte_order: u8,
    pub bitmap_format_bit_order: u8,
    pub bitmap_format_scanline_unit: u8,
    pub bitmap_format_scanline_pad: u8,
    pub min_keycode: xcb_keycode_t,
    pub max_keycode: xcb_keycode_t,
    pub pad1: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_t"][::std::mem::size_of::<xcb_setup_t>() - 40usize];
    ["Alignment of xcb_setup_t"][::std::mem::align_of::<xcb_setup_t>() - 4usize];
    ["Offset of field: xcb_setup_t::status"][::std::mem::offset_of!(xcb_setup_t, status) - 0usize];
    ["Offset of field: xcb_setup_t::pad0"][::std::mem::offset_of!(xcb_setup_t, pad0) - 1usize];
    ["Offset of field: xcb_setup_t::protocol_major_version"]
        [::std::mem::offset_of!(xcb_setup_t, protocol_major_version) - 2usize];
    ["Offset of field: xcb_setup_t::protocol_minor_version"]
        [::std::mem::offset_of!(xcb_setup_t, protocol_minor_version) - 4usize];
    ["Offset of field: xcb_setup_t::length"][::std::mem::offset_of!(xcb_setup_t, length) - 6usize];
    ["Offset of field: xcb_setup_t::release_number"]
        [::std::mem::offset_of!(xcb_setup_t, release_number) - 8usize];
    ["Offset of field: xcb_setup_t::resource_id_base"]
        [::std::mem::offset_of!(xcb_setup_t, resource_id_base) - 12usize];
    ["Offset of field: xcb_setup_t::resource_id_mask"]
        [::std::mem::offset_of!(xcb_setup_t, resource_id_mask) - 16usize];
    ["Offset of field: xcb_setup_t::motion_buffer_size"]
        [::std::mem::offset_of!(xcb_setup_t, motion_buffer_size) - 20usize];
    ["Offset of field: xcb_setup_t::vendor_len"]
        [::std::mem::offset_of!(xcb_setup_t, vendor_len) - 24usize];
    ["Offset of field: xcb_setup_t::maximum_request_length"]
        [::std::mem::offset_of!(xcb_setup_t, maximum_request_length) - 26usize];
    ["Offset of field: xcb_setup_t::roots_len"]
        [::std::mem::offset_of!(xcb_setup_t, roots_len) - 28usize];
    ["Offset of field: xcb_setup_t::pixmap_formats_len"]
        [::std::mem::offset_of!(xcb_setup_t, pixmap_formats_len) - 29usize];
    ["Offset of field: xcb_setup_t::image_byte_order"]
        [::std::mem::offset_of!(xcb_setup_t, image_byte_order) - 30usize];
    ["Offset of field: xcb_setup_t::bitmap_format_bit_order"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_bit_order) - 31usize];
    ["Offset of field: xcb_setup_t::bitmap_format_scanline_unit"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_scanline_unit) - 32usize];
    ["Offset of field: xcb_setup_t::bitmap_format_scanline_pad"]
        [::std::mem::offset_of!(xcb_setup_t, bitmap_format_scanline_pad) - 33usize];
    ["Offset of field: xcb_setup_t::min_keycode"]
        [::std::mem::offset_of!(xcb_setup_t, min_keycode) - 34usize];
    ["Offset of field: xcb_setup_t::max_keycode"]
        [::std::mem::offset_of!(xcb_setup_t, max_keycode) - 35usize];
    ["Offset of field: xcb_setup_t::pad1"][::std::mem::offset_of!(xcb_setup_t, pad1) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_setup_iterator_t {
    pub data: *mut xcb_setup_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_setup_iterator_t"][::std::mem::size_of::<xcb_setup_iterator_t>() - 16usize];
    ["Alignment of xcb_setup_iterator_t"][::std::mem::align_of::<xcb_setup_iterator_t>() - 8usize];
    ["Offset of field: xcb_setup_iterator_t::data"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, data) - 0usize];
    ["Offset of field: xcb_setup_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_setup_iterator_t::index"]
        [::std::mem::offset_of!(xcb_setup_iterator_t, index) - 12usize];
};
pub const xcb_mod_mask_t_XCB_MOD_MASK_SHIFT: xcb_mod_mask_t = 1;
pub const xcb_mod_mask_t_XCB_MOD_MASK_LOCK: xcb_mod_mask_t = 2;
pub const xcb_mod_mask_t_XCB_MOD_MASK_CONTROL: xcb_mod_mask_t = 4;
pub const xcb_mod_mask_t_XCB_MOD_MASK_1: xcb_mod_mask_t = 8;
pub const xcb_mod_mask_t_XCB_MOD_MASK_2: xcb_mod_mask_t = 16;
pub const xcb_mod_mask_t_XCB_MOD_MASK_3: xcb_mod_mask_t = 32;
pub const xcb_mod_mask_t_XCB_MOD_MASK_4: xcb_mod_mask_t = 64;
pub const xcb_mod_mask_t_XCB_MOD_MASK_5: xcb_mod_mask_t = 128;
pub const xcb_mod_mask_t_XCB_MOD_MASK_ANY: xcb_mod_mask_t = 32768;
pub type xcb_mod_mask_t = ::std::os::raw::c_uint;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_SHIFT: xcb_key_but_mask_t = 1;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_LOCK: xcb_key_but_mask_t = 2;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_CONTROL: xcb_key_but_mask_t = 4;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_MOD_1: xcb_key_but_mask_t = 8;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_MOD_2: xcb_key_but_mask_t = 16;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_MOD_3: xcb_key_but_mask_t = 32;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_MOD_4: xcb_key_but_mask_t = 64;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_MOD_5: xcb_key_but_mask_t = 128;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_BUTTON_1: xcb_key_but_mask_t = 256;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_BUTTON_2: xcb_key_but_mask_t = 512;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_BUTTON_3: xcb_key_but_mask_t = 1024;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_BUTTON_4: xcb_key_but_mask_t = 2048;
pub const xcb_key_but_mask_t_XCB_KEY_BUT_MASK_BUTTON_5: xcb_key_but_mask_t = 4096;
pub type xcb_key_but_mask_t = ::std::os::raw::c_uint;
pub const xcb_window_enum_t_XCB_WINDOW_NONE: xcb_window_enum_t = 0;
pub type xcb_window_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_key_press_event_t {
    pub response_type: u8,
    pub detail: xcb_keycode_t,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_key_press_event_t"][::std::mem::size_of::<xcb_key_press_event_t>() - 32usize];
    ["Alignment of xcb_key_press_event_t"]
        [::std::mem::align_of::<xcb_key_press_event_t>() - 4usize];
    ["Offset of field: xcb_key_press_event_t::response_type"]
        [::std::mem::offset_of!(xcb_key_press_event_t, response_type) - 0usize];
    ["Offset of field: xcb_key_press_event_t::detail"]
        [::std::mem::offset_of!(xcb_key_press_event_t, detail) - 1usize];
    ["Offset of field: xcb_key_press_event_t::sequence"]
        [::std::mem::offset_of!(xcb_key_press_event_t, sequence) - 2usize];
    ["Offset of field: xcb_key_press_event_t::time"]
        [::std::mem::offset_of!(xcb_key_press_event_t, time) - 4usize];
    ["Offset of field: xcb_key_press_event_t::root"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root) - 8usize];
    ["Offset of field: xcb_key_press_event_t::event"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event) - 12usize];
    ["Offset of field: xcb_key_press_event_t::child"]
        [::std::mem::offset_of!(xcb_key_press_event_t, child) - 16usize];
    ["Offset of field: xcb_key_press_event_t::root_x"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root_x) - 20usize];
    ["Offset of field: xcb_key_press_event_t::root_y"]
        [::std::mem::offset_of!(xcb_key_press_event_t, root_y) - 22usize];
    ["Offset of field: xcb_key_press_event_t::event_x"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event_x) - 24usize];
    ["Offset of field: xcb_key_press_event_t::event_y"]
        [::std::mem::offset_of!(xcb_key_press_event_t, event_y) - 26usize];
    ["Offset of field: xcb_key_press_event_t::state"]
        [::std::mem::offset_of!(xcb_key_press_event_t, state) - 28usize];
    ["Offset of field: xcb_key_press_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_key_press_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_key_press_event_t::pad0"]
        [::std::mem::offset_of!(xcb_key_press_event_t, pad0) - 31usize];
};
pub type xcb_key_release_event_t = xcb_key_press_event_t;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_1: xcb_button_mask_t = 256;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_2: xcb_button_mask_t = 512;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_3: xcb_button_mask_t = 1024;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_4: xcb_button_mask_t = 2048;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_5: xcb_button_mask_t = 4096;
pub const xcb_button_mask_t_XCB_BUTTON_MASK_ANY: xcb_button_mask_t = 32768;
pub type xcb_button_mask_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_button_press_event_t {
    pub response_type: u8,
    pub detail: xcb_button_t,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_button_press_event_t"]
        [::std::mem::size_of::<xcb_button_press_event_t>() - 32usize];
    ["Alignment of xcb_button_press_event_t"]
        [::std::mem::align_of::<xcb_button_press_event_t>() - 4usize];
    ["Offset of field: xcb_button_press_event_t::response_type"]
        [::std::mem::offset_of!(xcb_button_press_event_t, response_type) - 0usize];
    ["Offset of field: xcb_button_press_event_t::detail"]
        [::std::mem::offset_of!(xcb_button_press_event_t, detail) - 1usize];
    ["Offset of field: xcb_button_press_event_t::sequence"]
        [::std::mem::offset_of!(xcb_button_press_event_t, sequence) - 2usize];
    ["Offset of field: xcb_button_press_event_t::time"]
        [::std::mem::offset_of!(xcb_button_press_event_t, time) - 4usize];
    ["Offset of field: xcb_button_press_event_t::root"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root) - 8usize];
    ["Offset of field: xcb_button_press_event_t::event"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event) - 12usize];
    ["Offset of field: xcb_button_press_event_t::child"]
        [::std::mem::offset_of!(xcb_button_press_event_t, child) - 16usize];
    ["Offset of field: xcb_button_press_event_t::root_x"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root_x) - 20usize];
    ["Offset of field: xcb_button_press_event_t::root_y"]
        [::std::mem::offset_of!(xcb_button_press_event_t, root_y) - 22usize];
    ["Offset of field: xcb_button_press_event_t::event_x"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event_x) - 24usize];
    ["Offset of field: xcb_button_press_event_t::event_y"]
        [::std::mem::offset_of!(xcb_button_press_event_t, event_y) - 26usize];
    ["Offset of field: xcb_button_press_event_t::state"]
        [::std::mem::offset_of!(xcb_button_press_event_t, state) - 28usize];
    ["Offset of field: xcb_button_press_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_button_press_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_button_press_event_t::pad0"]
        [::std::mem::offset_of!(xcb_button_press_event_t, pad0) - 31usize];
};
pub type xcb_button_release_event_t = xcb_button_press_event_t;
pub const xcb_motion_t_XCB_MOTION_NORMAL: xcb_motion_t = 0;
pub const xcb_motion_t_XCB_MOTION_HINT: xcb_motion_t = 1;
pub type xcb_motion_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_motion_notify_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub same_screen: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_motion_notify_event_t"]
        [::std::mem::size_of::<xcb_motion_notify_event_t>() - 32usize];
    ["Alignment of xcb_motion_notify_event_t"]
        [::std::mem::align_of::<xcb_motion_notify_event_t>() - 4usize];
    ["Offset of field: xcb_motion_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_motion_notify_event_t::detail"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, detail) - 1usize];
    ["Offset of field: xcb_motion_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_motion_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_motion_notify_event_t::root"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root) - 8usize];
    ["Offset of field: xcb_motion_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event) - 12usize];
    ["Offset of field: xcb_motion_notify_event_t::child"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, child) - 16usize];
    ["Offset of field: xcb_motion_notify_event_t::root_x"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root_x) - 20usize];
    ["Offset of field: xcb_motion_notify_event_t::root_y"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, root_y) - 22usize];
    ["Offset of field: xcb_motion_notify_event_t::event_x"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event_x) - 24usize];
    ["Offset of field: xcb_motion_notify_event_t::event_y"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, event_y) - 26usize];
    ["Offset of field: xcb_motion_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, state) - 28usize];
    ["Offset of field: xcb_motion_notify_event_t::same_screen"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, same_screen) - 30usize];
    ["Offset of field: xcb_motion_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_motion_notify_event_t, pad0) - 31usize];
};
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_ANCESTOR: xcb_notify_detail_t = 0;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_VIRTUAL: xcb_notify_detail_t = 1;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_INFERIOR: xcb_notify_detail_t = 2;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_NONLINEAR: xcb_notify_detail_t = 3;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_NONLINEAR_VIRTUAL: xcb_notify_detail_t = 4;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_POINTER: xcb_notify_detail_t = 5;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_POINTER_ROOT: xcb_notify_detail_t = 6;
pub const xcb_notify_detail_t_XCB_NOTIFY_DETAIL_NONE: xcb_notify_detail_t = 7;
pub type xcb_notify_detail_t = ::std::os::raw::c_uint;
pub const xcb_notify_mode_t_XCB_NOTIFY_MODE_NORMAL: xcb_notify_mode_t = 0;
pub const xcb_notify_mode_t_XCB_NOTIFY_MODE_GRAB: xcb_notify_mode_t = 1;
pub const xcb_notify_mode_t_XCB_NOTIFY_MODE_UNGRAB: xcb_notify_mode_t = 2;
pub const xcb_notify_mode_t_XCB_NOTIFY_MODE_WHILE_GRABBED: xcb_notify_mode_t = 3;
pub type xcb_notify_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_enter_notify_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub root: xcb_window_t,
    pub event: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub event_x: i16,
    pub event_y: i16,
    pub state: u16,
    pub mode: u8,
    pub same_screen_focus: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_enter_notify_event_t"]
        [::std::mem::size_of::<xcb_enter_notify_event_t>() - 32usize];
    ["Alignment of xcb_enter_notify_event_t"]
        [::std::mem::align_of::<xcb_enter_notify_event_t>() - 4usize];
    ["Offset of field: xcb_enter_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_enter_notify_event_t::detail"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, detail) - 1usize];
    ["Offset of field: xcb_enter_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_enter_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_enter_notify_event_t::root"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root) - 8usize];
    ["Offset of field: xcb_enter_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event) - 12usize];
    ["Offset of field: xcb_enter_notify_event_t::child"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, child) - 16usize];
    ["Offset of field: xcb_enter_notify_event_t::root_x"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root_x) - 20usize];
    ["Offset of field: xcb_enter_notify_event_t::root_y"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, root_y) - 22usize];
    ["Offset of field: xcb_enter_notify_event_t::event_x"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event_x) - 24usize];
    ["Offset of field: xcb_enter_notify_event_t::event_y"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, event_y) - 26usize];
    ["Offset of field: xcb_enter_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, state) - 28usize];
    ["Offset of field: xcb_enter_notify_event_t::mode"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, mode) - 30usize];
    ["Offset of field: xcb_enter_notify_event_t::same_screen_focus"]
        [::std::mem::offset_of!(xcb_enter_notify_event_t, same_screen_focus) - 31usize];
};
pub type xcb_leave_notify_event_t = xcb_enter_notify_event_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_focus_in_event_t {
    pub response_type: u8,
    pub detail: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub mode: u8,
    pub pad0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_focus_in_event_t"][::std::mem::size_of::<xcb_focus_in_event_t>() - 12usize];
    ["Alignment of xcb_focus_in_event_t"][::std::mem::align_of::<xcb_focus_in_event_t>() - 4usize];
    ["Offset of field: xcb_focus_in_event_t::response_type"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, response_type) - 0usize];
    ["Offset of field: xcb_focus_in_event_t::detail"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, detail) - 1usize];
    ["Offset of field: xcb_focus_in_event_t::sequence"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, sequence) - 2usize];
    ["Offset of field: xcb_focus_in_event_t::event"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, event) - 4usize];
    ["Offset of field: xcb_focus_in_event_t::mode"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, mode) - 8usize];
    ["Offset of field: xcb_focus_in_event_t::pad0"]
        [::std::mem::offset_of!(xcb_focus_in_event_t, pad0) - 9usize];
};
pub type xcb_focus_out_event_t = xcb_focus_in_event_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_keymap_notify_event_t {
    pub response_type: u8,
    pub keys: [u8; 31usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_keymap_notify_event_t"]
        [::std::mem::size_of::<xcb_keymap_notify_event_t>() - 32usize];
    ["Alignment of xcb_keymap_notify_event_t"]
        [::std::mem::align_of::<xcb_keymap_notify_event_t>() - 1usize];
    ["Offset of field: xcb_keymap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_keymap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_keymap_notify_event_t::keys"]
        [::std::mem::offset_of!(xcb_keymap_notify_event_t, keys) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_expose_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub x: u16,
    pub y: u16,
    pub width: u16,
    pub height: u16,
    pub count: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_expose_event_t"][::std::mem::size_of::<xcb_expose_event_t>() - 20usize];
    ["Alignment of xcb_expose_event_t"][::std::mem::align_of::<xcb_expose_event_t>() - 4usize];
    ["Offset of field: xcb_expose_event_t::response_type"]
        [::std::mem::offset_of!(xcb_expose_event_t, response_type) - 0usize];
    ["Offset of field: xcb_expose_event_t::pad0"]
        [::std::mem::offset_of!(xcb_expose_event_t, pad0) - 1usize];
    ["Offset of field: xcb_expose_event_t::sequence"]
        [::std::mem::offset_of!(xcb_expose_event_t, sequence) - 2usize];
    ["Offset of field: xcb_expose_event_t::window"]
        [::std::mem::offset_of!(xcb_expose_event_t, window) - 4usize];
    ["Offset of field: xcb_expose_event_t::x"]
        [::std::mem::offset_of!(xcb_expose_event_t, x) - 8usize];
    ["Offset of field: xcb_expose_event_t::y"]
        [::std::mem::offset_of!(xcb_expose_event_t, y) - 10usize];
    ["Offset of field: xcb_expose_event_t::width"]
        [::std::mem::offset_of!(xcb_expose_event_t, width) - 12usize];
    ["Offset of field: xcb_expose_event_t::height"]
        [::std::mem::offset_of!(xcb_expose_event_t, height) - 14usize];
    ["Offset of field: xcb_expose_event_t::count"]
        [::std::mem::offset_of!(xcb_expose_event_t, count) - 16usize];
    ["Offset of field: xcb_expose_event_t::pad1"]
        [::std::mem::offset_of!(xcb_expose_event_t, pad1) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_graphics_exposure_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub drawable: xcb_drawable_t,
    pub x: u16,
    pub y: u16,
    pub width: u16,
    pub height: u16,
    pub minor_opcode: u16,
    pub count: u16,
    pub major_opcode: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_graphics_exposure_event_t"]
        [::std::mem::size_of::<xcb_graphics_exposure_event_t>() - 24usize];
    ["Alignment of xcb_graphics_exposure_event_t"]
        [::std::mem::align_of::<xcb_graphics_exposure_event_t>() - 4usize];
    ["Offset of field: xcb_graphics_exposure_event_t::response_type"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, response_type) - 0usize];
    ["Offset of field: xcb_graphics_exposure_event_t::pad0"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, pad0) - 1usize];
    ["Offset of field: xcb_graphics_exposure_event_t::sequence"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, sequence) - 2usize];
    ["Offset of field: xcb_graphics_exposure_event_t::drawable"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, drawable) - 4usize];
    ["Offset of field: xcb_graphics_exposure_event_t::x"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, x) - 8usize];
    ["Offset of field: xcb_graphics_exposure_event_t::y"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, y) - 10usize];
    ["Offset of field: xcb_graphics_exposure_event_t::width"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, width) - 12usize];
    ["Offset of field: xcb_graphics_exposure_event_t::height"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, height) - 14usize];
    ["Offset of field: xcb_graphics_exposure_event_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, minor_opcode) - 16usize];
    ["Offset of field: xcb_graphics_exposure_event_t::count"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, count) - 18usize];
    ["Offset of field: xcb_graphics_exposure_event_t::major_opcode"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, major_opcode) - 20usize];
    ["Offset of field: xcb_graphics_exposure_event_t::pad1"]
        [::std::mem::offset_of!(xcb_graphics_exposure_event_t, pad1) - 21usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_no_exposure_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub drawable: xcb_drawable_t,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_no_exposure_event_t"][::std::mem::size_of::<xcb_no_exposure_event_t>() - 12usize];
    ["Alignment of xcb_no_exposure_event_t"]
        [::std::mem::align_of::<xcb_no_exposure_event_t>() - 4usize];
    ["Offset of field: xcb_no_exposure_event_t::response_type"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, response_type) - 0usize];
    ["Offset of field: xcb_no_exposure_event_t::pad0"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, pad0) - 1usize];
    ["Offset of field: xcb_no_exposure_event_t::sequence"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, sequence) - 2usize];
    ["Offset of field: xcb_no_exposure_event_t::drawable"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, drawable) - 4usize];
    ["Offset of field: xcb_no_exposure_event_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_no_exposure_event_t::major_opcode"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, major_opcode) - 10usize];
    ["Offset of field: xcb_no_exposure_event_t::pad1"]
        [::std::mem::offset_of!(xcb_no_exposure_event_t, pad1) - 11usize];
};
pub const xcb_visibility_t_XCB_VISIBILITY_UNOBSCURED: xcb_visibility_t = 0;
pub const xcb_visibility_t_XCB_VISIBILITY_PARTIALLY_OBSCURED: xcb_visibility_t = 1;
pub const xcb_visibility_t_XCB_VISIBILITY_FULLY_OBSCURED: xcb_visibility_t = 2;
pub type xcb_visibility_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_visibility_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub state: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_visibility_notify_event_t"]
        [::std::mem::size_of::<xcb_visibility_notify_event_t>() - 12usize];
    ["Alignment of xcb_visibility_notify_event_t"]
        [::std::mem::align_of::<xcb_visibility_notify_event_t>() - 4usize];
    ["Offset of field: xcb_visibility_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_visibility_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_visibility_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_visibility_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_visibility_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, state) - 8usize];
    ["Offset of field: xcb_visibility_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_visibility_notify_event_t, pad1) - 9usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub override_redirect: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_notify_event_t"]
        [::std::mem::size_of::<xcb_create_notify_event_t>() - 24usize];
    ["Alignment of xcb_create_notify_event_t"]
        [::std::mem::align_of::<xcb_create_notify_event_t>() - 4usize];
    ["Offset of field: xcb_create_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_create_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_create_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_create_notify_event_t::parent"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, parent) - 4usize];
    ["Offset of field: xcb_create_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_create_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, x) - 12usize];
    ["Offset of field: xcb_create_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, y) - 14usize];
    ["Offset of field: xcb_create_notify_event_t::width"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, width) - 16usize];
    ["Offset of field: xcb_create_notify_event_t::height"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, height) - 18usize];
    ["Offset of field: xcb_create_notify_event_t::border_width"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, border_width) - 20usize];
    ["Offset of field: xcb_create_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, override_redirect) - 22usize];
    ["Offset of field: xcb_create_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_create_notify_event_t, pad1) - 23usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_notify_event_t"]
        [::std::mem::size_of::<xcb_destroy_notify_event_t>() - 12usize];
    ["Alignment of xcb_destroy_notify_event_t"]
        [::std::mem::align_of::<xcb_destroy_notify_event_t>() - 4usize];
    ["Offset of field: xcb_destroy_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_destroy_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_destroy_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_destroy_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_destroy_notify_event_t, window) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub from_configure: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_notify_event_t"]
        [::std::mem::size_of::<xcb_unmap_notify_event_t>() - 16usize];
    ["Alignment of xcb_unmap_notify_event_t"]
        [::std::mem::align_of::<xcb_unmap_notify_event_t>() - 4usize];
    ["Offset of field: xcb_unmap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_unmap_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_unmap_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_unmap_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_unmap_notify_event_t::from_configure"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, from_configure) - 12usize];
    ["Offset of field: xcb_unmap_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_unmap_notify_event_t, pad1) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub override_redirect: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_notify_event_t"][::std::mem::size_of::<xcb_map_notify_event_t>() - 16usize];
    ["Alignment of xcb_map_notify_event_t"]
        [::std::mem::align_of::<xcb_map_notify_event_t>() - 4usize];
    ["Offset of field: xcb_map_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_map_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_map_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_map_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_map_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_map_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, override_redirect) - 12usize];
    ["Offset of field: xcb_map_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_map_notify_event_t, pad1) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_request_event_t"][::std::mem::size_of::<xcb_map_request_event_t>() - 12usize];
    ["Alignment of xcb_map_request_event_t"]
        [::std::mem::align_of::<xcb_map_request_event_t>() - 4usize];
    ["Offset of field: xcb_map_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_map_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_map_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_map_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_map_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_map_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_map_request_event_t::parent"]
        [::std::mem::offset_of!(xcb_map_request_event_t, parent) - 4usize];
    ["Offset of field: xcb_map_request_event_t::window"]
        [::std::mem::offset_of!(xcb_map_request_event_t, window) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_reparent_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub override_redirect: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_reparent_notify_event_t"]
        [::std::mem::size_of::<xcb_reparent_notify_event_t>() - 24usize];
    ["Alignment of xcb_reparent_notify_event_t"]
        [::std::mem::align_of::<xcb_reparent_notify_event_t>() - 4usize];
    ["Offset of field: xcb_reparent_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_reparent_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_reparent_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_reparent_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_reparent_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_reparent_notify_event_t::parent"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, parent) - 12usize];
    ["Offset of field: xcb_reparent_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, x) - 16usize];
    ["Offset of field: xcb_reparent_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, y) - 18usize];
    ["Offset of field: xcb_reparent_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, override_redirect) - 20usize];
    ["Offset of field: xcb_reparent_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_reparent_notify_event_t, pad1) - 21usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub above_sibling: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub override_redirect: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_notify_event_t"]
        [::std::mem::size_of::<xcb_configure_notify_event_t>() - 28usize];
    ["Alignment of xcb_configure_notify_event_t"]
        [::std::mem::align_of::<xcb_configure_notify_event_t>() - 4usize];
    ["Offset of field: xcb_configure_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_configure_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_configure_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_configure_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_configure_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_configure_notify_event_t::above_sibling"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, above_sibling) - 12usize];
    ["Offset of field: xcb_configure_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, x) - 16usize];
    ["Offset of field: xcb_configure_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, y) - 18usize];
    ["Offset of field: xcb_configure_notify_event_t::width"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, width) - 20usize];
    ["Offset of field: xcb_configure_notify_event_t::height"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, height) - 22usize];
    ["Offset of field: xcb_configure_notify_event_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, border_width) - 24usize];
    ["Offset of field: xcb_configure_notify_event_t::override_redirect"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, override_redirect) - 26usize];
    ["Offset of field: xcb_configure_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_configure_notify_event_t, pad1) - 27usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_request_event_t {
    pub response_type: u8,
    pub stack_mode: u8,
    pub sequence: u16,
    pub parent: xcb_window_t,
    pub window: xcb_window_t,
    pub sibling: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub value_mask: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_request_event_t"]
        [::std::mem::size_of::<xcb_configure_request_event_t>() - 28usize];
    ["Alignment of xcb_configure_request_event_t"]
        [::std::mem::align_of::<xcb_configure_request_event_t>() - 4usize];
    ["Offset of field: xcb_configure_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_configure_request_event_t::stack_mode"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, stack_mode) - 1usize];
    ["Offset of field: xcb_configure_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_configure_request_event_t::parent"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, parent) - 4usize];
    ["Offset of field: xcb_configure_request_event_t::window"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, window) - 8usize];
    ["Offset of field: xcb_configure_request_event_t::sibling"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, sibling) - 12usize];
    ["Offset of field: xcb_configure_request_event_t::x"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, x) - 16usize];
    ["Offset of field: xcb_configure_request_event_t::y"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, y) - 18usize];
    ["Offset of field: xcb_configure_request_event_t::width"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, width) - 20usize];
    ["Offset of field: xcb_configure_request_event_t::height"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, height) - 22usize];
    ["Offset of field: xcb_configure_request_event_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, border_width) - 24usize];
    ["Offset of field: xcb_configure_request_event_t::value_mask"]
        [::std::mem::offset_of!(xcb_configure_request_event_t, value_mask) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_gravity_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_gravity_notify_event_t"]
        [::std::mem::size_of::<xcb_gravity_notify_event_t>() - 16usize];
    ["Alignment of xcb_gravity_notify_event_t"]
        [::std::mem::align_of::<xcb_gravity_notify_event_t>() - 4usize];
    ["Offset of field: xcb_gravity_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_gravity_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_gravity_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_gravity_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_gravity_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_gravity_notify_event_t::x"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, x) - 12usize];
    ["Offset of field: xcb_gravity_notify_event_t::y"]
        [::std::mem::offset_of!(xcb_gravity_notify_event_t, y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_resize_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_resize_request_event_t"]
        [::std::mem::size_of::<xcb_resize_request_event_t>() - 12usize];
    ["Alignment of xcb_resize_request_event_t"]
        [::std::mem::align_of::<xcb_resize_request_event_t>() - 4usize];
    ["Offset of field: xcb_resize_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_resize_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_resize_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_resize_request_event_t::window"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, window) - 4usize];
    ["Offset of field: xcb_resize_request_event_t::width"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, width) - 8usize];
    ["Offset of field: xcb_resize_request_event_t::height"]
        [::std::mem::offset_of!(xcb_resize_request_event_t, height) - 10usize];
};
pub const xcb_place_t_XCB_PLACE_ON_TOP: xcb_place_t = 0;
pub const xcb_place_t_XCB_PLACE_ON_BOTTOM: xcb_place_t = 1;
pub type xcb_place_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_circulate_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub event: xcb_window_t,
    pub window: xcb_window_t,
    pub pad1: [u8; 4usize],
    pub place: u8,
    pub pad2: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_circulate_notify_event_t"]
        [::std::mem::size_of::<xcb_circulate_notify_event_t>() - 20usize];
    ["Alignment of xcb_circulate_notify_event_t"]
        [::std::mem::align_of::<xcb_circulate_notify_event_t>() - 4usize];
    ["Offset of field: xcb_circulate_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_circulate_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_circulate_notify_event_t::event"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, event) - 4usize];
    ["Offset of field: xcb_circulate_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, window) - 8usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad1) - 12usize];
    ["Offset of field: xcb_circulate_notify_event_t::place"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, place) - 16usize];
    ["Offset of field: xcb_circulate_notify_event_t::pad2"]
        [::std::mem::offset_of!(xcb_circulate_notify_event_t, pad2) - 17usize];
};
pub type xcb_circulate_request_event_t = xcb_circulate_notify_event_t;
pub const xcb_property_t_XCB_PROPERTY_NEW_VALUE: xcb_property_t = 0;
pub const xcb_property_t_XCB_PROPERTY_DELETE: xcb_property_t = 1;
pub type xcb_property_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_property_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub atom: xcb_atom_t,
    pub time: xcb_timestamp_t,
    pub state: u8,
    pub pad1: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_property_notify_event_t"]
        [::std::mem::size_of::<xcb_property_notify_event_t>() - 20usize];
    ["Alignment of xcb_property_notify_event_t"]
        [::std::mem::align_of::<xcb_property_notify_event_t>() - 4usize];
    ["Offset of field: xcb_property_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_property_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_property_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_property_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_property_notify_event_t::atom"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, atom) - 8usize];
    ["Offset of field: xcb_property_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, time) - 12usize];
    ["Offset of field: xcb_property_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, state) - 16usize];
    ["Offset of field: xcb_property_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_property_notify_event_t, pad1) - 17usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_clear_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub owner: xcb_window_t,
    pub selection: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_clear_event_t"]
        [::std::mem::size_of::<xcb_selection_clear_event_t>() - 16usize];
    ["Alignment of xcb_selection_clear_event_t"]
        [::std::mem::align_of::<xcb_selection_clear_event_t>() - 4usize];
    ["Offset of field: xcb_selection_clear_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_clear_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_clear_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_clear_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_clear_event_t::owner"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, owner) - 8usize];
    ["Offset of field: xcb_selection_clear_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_clear_event_t, selection) - 12usize];
};
pub const xcb_time_t_XCB_TIME_CURRENT_TIME: xcb_time_t = 0;
pub type xcb_time_t = ::std::os::raw::c_uint;
pub const xcb_atom_enum_t_XCB_ATOM_NONE: xcb_atom_enum_t = 0;
pub const xcb_atom_enum_t_XCB_ATOM_ANY: xcb_atom_enum_t = 0;
pub const xcb_atom_enum_t_XCB_ATOM_PRIMARY: xcb_atom_enum_t = 1;
pub const xcb_atom_enum_t_XCB_ATOM_SECONDARY: xcb_atom_enum_t = 2;
pub const xcb_atom_enum_t_XCB_ATOM_ARC: xcb_atom_enum_t = 3;
pub const xcb_atom_enum_t_XCB_ATOM_ATOM: xcb_atom_enum_t = 4;
pub const xcb_atom_enum_t_XCB_ATOM_BITMAP: xcb_atom_enum_t = 5;
pub const xcb_atom_enum_t_XCB_ATOM_CARDINAL: xcb_atom_enum_t = 6;
pub const xcb_atom_enum_t_XCB_ATOM_COLORMAP: xcb_atom_enum_t = 7;
pub const xcb_atom_enum_t_XCB_ATOM_CURSOR: xcb_atom_enum_t = 8;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER0: xcb_atom_enum_t = 9;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER1: xcb_atom_enum_t = 10;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER2: xcb_atom_enum_t = 11;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER3: xcb_atom_enum_t = 12;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER4: xcb_atom_enum_t = 13;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER5: xcb_atom_enum_t = 14;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER6: xcb_atom_enum_t = 15;
pub const xcb_atom_enum_t_XCB_ATOM_CUT_BUFFER7: xcb_atom_enum_t = 16;
pub const xcb_atom_enum_t_XCB_ATOM_DRAWABLE: xcb_atom_enum_t = 17;
pub const xcb_atom_enum_t_XCB_ATOM_FONT: xcb_atom_enum_t = 18;
pub const xcb_atom_enum_t_XCB_ATOM_INTEGER: xcb_atom_enum_t = 19;
pub const xcb_atom_enum_t_XCB_ATOM_PIXMAP: xcb_atom_enum_t = 20;
pub const xcb_atom_enum_t_XCB_ATOM_POINT: xcb_atom_enum_t = 21;
pub const xcb_atom_enum_t_XCB_ATOM_RECTANGLE: xcb_atom_enum_t = 22;
pub const xcb_atom_enum_t_XCB_ATOM_RESOURCE_MANAGER: xcb_atom_enum_t = 23;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_COLOR_MAP: xcb_atom_enum_t = 24;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_BEST_MAP: xcb_atom_enum_t = 25;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_BLUE_MAP: xcb_atom_enum_t = 26;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_DEFAULT_MAP: xcb_atom_enum_t = 27;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_GRAY_MAP: xcb_atom_enum_t = 28;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_GREEN_MAP: xcb_atom_enum_t = 29;
pub const xcb_atom_enum_t_XCB_ATOM_RGB_RED_MAP: xcb_atom_enum_t = 30;
pub const xcb_atom_enum_t_XCB_ATOM_STRING: xcb_atom_enum_t = 31;
pub const xcb_atom_enum_t_XCB_ATOM_VISUALID: xcb_atom_enum_t = 32;
pub const xcb_atom_enum_t_XCB_ATOM_WINDOW: xcb_atom_enum_t = 33;
pub const xcb_atom_enum_t_XCB_ATOM_WM_COMMAND: xcb_atom_enum_t = 34;
pub const xcb_atom_enum_t_XCB_ATOM_WM_HINTS: xcb_atom_enum_t = 35;
pub const xcb_atom_enum_t_XCB_ATOM_WM_CLIENT_MACHINE: xcb_atom_enum_t = 36;
pub const xcb_atom_enum_t_XCB_ATOM_WM_ICON_NAME: xcb_atom_enum_t = 37;
pub const xcb_atom_enum_t_XCB_ATOM_WM_ICON_SIZE: xcb_atom_enum_t = 38;
pub const xcb_atom_enum_t_XCB_ATOM_WM_NAME: xcb_atom_enum_t = 39;
pub const xcb_atom_enum_t_XCB_ATOM_WM_NORMAL_HINTS: xcb_atom_enum_t = 40;
pub const xcb_atom_enum_t_XCB_ATOM_WM_SIZE_HINTS: xcb_atom_enum_t = 41;
pub const xcb_atom_enum_t_XCB_ATOM_WM_ZOOM_HINTS: xcb_atom_enum_t = 42;
pub const xcb_atom_enum_t_XCB_ATOM_MIN_SPACE: xcb_atom_enum_t = 43;
pub const xcb_atom_enum_t_XCB_ATOM_NORM_SPACE: xcb_atom_enum_t = 44;
pub const xcb_atom_enum_t_XCB_ATOM_MAX_SPACE: xcb_atom_enum_t = 45;
pub const xcb_atom_enum_t_XCB_ATOM_END_SPACE: xcb_atom_enum_t = 46;
pub const xcb_atom_enum_t_XCB_ATOM_SUPERSCRIPT_X: xcb_atom_enum_t = 47;
pub const xcb_atom_enum_t_XCB_ATOM_SUPERSCRIPT_Y: xcb_atom_enum_t = 48;
pub const xcb_atom_enum_t_XCB_ATOM_SUBSCRIPT_X: xcb_atom_enum_t = 49;
pub const xcb_atom_enum_t_XCB_ATOM_SUBSCRIPT_Y: xcb_atom_enum_t = 50;
pub const xcb_atom_enum_t_XCB_ATOM_UNDERLINE_POSITION: xcb_atom_enum_t = 51;
pub const xcb_atom_enum_t_XCB_ATOM_UNDERLINE_THICKNESS: xcb_atom_enum_t = 52;
pub const xcb_atom_enum_t_XCB_ATOM_STRIKEOUT_ASCENT: xcb_atom_enum_t = 53;
pub const xcb_atom_enum_t_XCB_ATOM_STRIKEOUT_DESCENT: xcb_atom_enum_t = 54;
pub const xcb_atom_enum_t_XCB_ATOM_ITALIC_ANGLE: xcb_atom_enum_t = 55;
pub const xcb_atom_enum_t_XCB_ATOM_X_HEIGHT: xcb_atom_enum_t = 56;
pub const xcb_atom_enum_t_XCB_ATOM_QUAD_WIDTH: xcb_atom_enum_t = 57;
pub const xcb_atom_enum_t_XCB_ATOM_WEIGHT: xcb_atom_enum_t = 58;
pub const xcb_atom_enum_t_XCB_ATOM_POINT_SIZE: xcb_atom_enum_t = 59;
pub const xcb_atom_enum_t_XCB_ATOM_RESOLUTION: xcb_atom_enum_t = 60;
pub const xcb_atom_enum_t_XCB_ATOM_COPYRIGHT: xcb_atom_enum_t = 61;
pub const xcb_atom_enum_t_XCB_ATOM_NOTICE: xcb_atom_enum_t = 62;
pub const xcb_atom_enum_t_XCB_ATOM_FONT_NAME: xcb_atom_enum_t = 63;
pub const xcb_atom_enum_t_XCB_ATOM_FAMILY_NAME: xcb_atom_enum_t = 64;
pub const xcb_atom_enum_t_XCB_ATOM_FULL_NAME: xcb_atom_enum_t = 65;
pub const xcb_atom_enum_t_XCB_ATOM_CAP_HEIGHT: xcb_atom_enum_t = 66;
pub const xcb_atom_enum_t_XCB_ATOM_WM_CLASS: xcb_atom_enum_t = 67;
pub const xcb_atom_enum_t_XCB_ATOM_WM_TRANSIENT_FOR: xcb_atom_enum_t = 68;
pub type xcb_atom_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_request_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub owner: xcb_window_t,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_request_event_t"]
        [::std::mem::size_of::<xcb_selection_request_event_t>() - 28usize];
    ["Alignment of xcb_selection_request_event_t"]
        [::std::mem::align_of::<xcb_selection_request_event_t>() - 4usize];
    ["Offset of field: xcb_selection_request_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_request_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_request_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_request_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_request_event_t::owner"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, owner) - 8usize];
    ["Offset of field: xcb_selection_request_event_t::requestor"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, requestor) - 12usize];
    ["Offset of field: xcb_selection_request_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, selection) - 16usize];
    ["Offset of field: xcb_selection_request_event_t::target"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, target) - 20usize];
    ["Offset of field: xcb_selection_request_event_t::property"]
        [::std::mem::offset_of!(xcb_selection_request_event_t, property) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_selection_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub time: xcb_timestamp_t,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_selection_notify_event_t"]
        [::std::mem::size_of::<xcb_selection_notify_event_t>() - 24usize];
    ["Alignment of xcb_selection_notify_event_t"]
        [::std::mem::align_of::<xcb_selection_notify_event_t>() - 4usize];
    ["Offset of field: xcb_selection_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_selection_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_selection_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_selection_notify_event_t::time"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, time) - 4usize];
    ["Offset of field: xcb_selection_notify_event_t::requestor"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, requestor) - 8usize];
    ["Offset of field: xcb_selection_notify_event_t::selection"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, selection) - 12usize];
    ["Offset of field: xcb_selection_notify_event_t::target"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, target) - 16usize];
    ["Offset of field: xcb_selection_notify_event_t::property"]
        [::std::mem::offset_of!(xcb_selection_notify_event_t, property) - 20usize];
};
pub const xcb_colormap_state_t_XCB_COLORMAP_STATE_UNINSTALLED: xcb_colormap_state_t = 0;
pub const xcb_colormap_state_t_XCB_COLORMAP_STATE_INSTALLED: xcb_colormap_state_t = 1;
pub type xcb_colormap_state_t = ::std::os::raw::c_uint;
pub const xcb_colormap_enum_t_XCB_COLORMAP_NONE: xcb_colormap_enum_t = 0;
pub type xcb_colormap_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_colormap_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub colormap: xcb_colormap_t,
    pub _new: u8,
    pub state: u8,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_colormap_notify_event_t"]
        [::std::mem::size_of::<xcb_colormap_notify_event_t>() - 16usize];
    ["Alignment of xcb_colormap_notify_event_t"]
        [::std::mem::align_of::<xcb_colormap_notify_event_t>() - 4usize];
    ["Offset of field: xcb_colormap_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_colormap_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_colormap_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_colormap_notify_event_t::window"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, window) - 4usize];
    ["Offset of field: xcb_colormap_notify_event_t::colormap"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, colormap) - 8usize];
    ["Offset of field: xcb_colormap_notify_event_t::_new"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, _new) - 12usize];
    ["Offset of field: xcb_colormap_notify_event_t::state"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, state) - 13usize];
    ["Offset of field: xcb_colormap_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_colormap_notify_event_t, pad1) - 14usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union xcb_client_message_data_t {
    pub data8: [u8; 20usize],
    pub data16: [u16; 10usize],
    pub data32: [u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_data_t"]
        [::std::mem::size_of::<xcb_client_message_data_t>() - 20usize];
    ["Alignment of xcb_client_message_data_t"]
        [::std::mem::align_of::<xcb_client_message_data_t>() - 4usize];
    ["Offset of field: xcb_client_message_data_t::data8"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data8) - 0usize];
    ["Offset of field: xcb_client_message_data_t::data16"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data16) - 0usize];
    ["Offset of field: xcb_client_message_data_t::data32"]
        [::std::mem::offset_of!(xcb_client_message_data_t, data32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_client_message_data_iterator_t {
    pub data: *mut xcb_client_message_data_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_data_iterator_t"]
        [::std::mem::size_of::<xcb_client_message_data_iterator_t>() - 16usize];
    ["Alignment of xcb_client_message_data_iterator_t"]
        [::std::mem::align_of::<xcb_client_message_data_iterator_t>() - 8usize];
    ["Offset of field: xcb_client_message_data_iterator_t::data"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, data) - 0usize];
    ["Offset of field: xcb_client_message_data_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_client_message_data_iterator_t::index"]
        [::std::mem::offset_of!(xcb_client_message_data_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xcb_client_message_event_t {
    pub response_type: u8,
    pub format: u8,
    pub sequence: u16,
    pub window: xcb_window_t,
    pub type_: xcb_atom_t,
    pub data: xcb_client_message_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_client_message_event_t"]
        [::std::mem::size_of::<xcb_client_message_event_t>() - 32usize];
    ["Alignment of xcb_client_message_event_t"]
        [::std::mem::align_of::<xcb_client_message_event_t>() - 4usize];
    ["Offset of field: xcb_client_message_event_t::response_type"]
        [::std::mem::offset_of!(xcb_client_message_event_t, response_type) - 0usize];
    ["Offset of field: xcb_client_message_event_t::format"]
        [::std::mem::offset_of!(xcb_client_message_event_t, format) - 1usize];
    ["Offset of field: xcb_client_message_event_t::sequence"]
        [::std::mem::offset_of!(xcb_client_message_event_t, sequence) - 2usize];
    ["Offset of field: xcb_client_message_event_t::window"]
        [::std::mem::offset_of!(xcb_client_message_event_t, window) - 4usize];
    ["Offset of field: xcb_client_message_event_t::type_"]
        [::std::mem::offset_of!(xcb_client_message_event_t, type_) - 8usize];
    ["Offset of field: xcb_client_message_event_t::data"]
        [::std::mem::offset_of!(xcb_client_message_event_t, data) - 12usize];
};
pub const xcb_mapping_t_XCB_MAPPING_MODIFIER: xcb_mapping_t = 0;
pub const xcb_mapping_t_XCB_MAPPING_KEYBOARD: xcb_mapping_t = 1;
pub const xcb_mapping_t_XCB_MAPPING_POINTER: xcb_mapping_t = 2;
pub type xcb_mapping_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_mapping_notify_event_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub request: u8,
    pub first_keycode: xcb_keycode_t,
    pub count: u8,
    pub pad1: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_mapping_notify_event_t"]
        [::std::mem::size_of::<xcb_mapping_notify_event_t>() - 8usize];
    ["Alignment of xcb_mapping_notify_event_t"]
        [::std::mem::align_of::<xcb_mapping_notify_event_t>() - 2usize];
    ["Offset of field: xcb_mapping_notify_event_t::response_type"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, response_type) - 0usize];
    ["Offset of field: xcb_mapping_notify_event_t::pad0"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, pad0) - 1usize];
    ["Offset of field: xcb_mapping_notify_event_t::sequence"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, sequence) - 2usize];
    ["Offset of field: xcb_mapping_notify_event_t::request"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, request) - 4usize];
    ["Offset of field: xcb_mapping_notify_event_t::first_keycode"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, first_keycode) - 5usize];
    ["Offset of field: xcb_mapping_notify_event_t::count"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, count) - 6usize];
    ["Offset of field: xcb_mapping_notify_event_t::pad1"]
        [::std::mem::offset_of!(xcb_mapping_notify_event_t, pad1) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ge_generic_event_t {
    pub response_type: u8,
    pub extension: u8,
    pub sequence: u16,
    pub length: u32,
    pub event_type: u16,
    pub pad0: [u8; 22usize],
    pub full_sequence: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ge_generic_event_t"][::std::mem::size_of::<xcb_ge_generic_event_t>() - 36usize];
    ["Alignment of xcb_ge_generic_event_t"]
        [::std::mem::align_of::<xcb_ge_generic_event_t>() - 4usize];
    ["Offset of field: xcb_ge_generic_event_t::response_type"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, response_type) - 0usize];
    ["Offset of field: xcb_ge_generic_event_t::extension"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, extension) - 1usize];
    ["Offset of field: xcb_ge_generic_event_t::sequence"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, sequence) - 2usize];
    ["Offset of field: xcb_ge_generic_event_t::length"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, length) - 4usize];
    ["Offset of field: xcb_ge_generic_event_t::event_type"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, event_type) - 8usize];
    ["Offset of field: xcb_ge_generic_event_t::pad0"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, pad0) - 10usize];
    ["Offset of field: xcb_ge_generic_event_t::full_sequence"]
        [::std::mem::offset_of!(xcb_ge_generic_event_t, full_sequence) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_request_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub bad_value: u32,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_request_error_t"][::std::mem::size_of::<xcb_request_error_t>() - 12usize];
    ["Alignment of xcb_request_error_t"][::std::mem::align_of::<xcb_request_error_t>() - 4usize];
    ["Offset of field: xcb_request_error_t::response_type"]
        [::std::mem::offset_of!(xcb_request_error_t, response_type) - 0usize];
    ["Offset of field: xcb_request_error_t::error_code"]
        [::std::mem::offset_of!(xcb_request_error_t, error_code) - 1usize];
    ["Offset of field: xcb_request_error_t::sequence"]
        [::std::mem::offset_of!(xcb_request_error_t, sequence) - 2usize];
    ["Offset of field: xcb_request_error_t::bad_value"]
        [::std::mem::offset_of!(xcb_request_error_t, bad_value) - 4usize];
    ["Offset of field: xcb_request_error_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_request_error_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_request_error_t::major_opcode"]
        [::std::mem::offset_of!(xcb_request_error_t, major_opcode) - 10usize];
    ["Offset of field: xcb_request_error_t::pad0"]
        [::std::mem::offset_of!(xcb_request_error_t, pad0) - 11usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_value_error_t {
    pub response_type: u8,
    pub error_code: u8,
    pub sequence: u16,
    pub bad_value: u32,
    pub minor_opcode: u16,
    pub major_opcode: u8,
    pub pad0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_value_error_t"][::std::mem::size_of::<xcb_value_error_t>() - 12usize];
    ["Alignment of xcb_value_error_t"][::std::mem::align_of::<xcb_value_error_t>() - 4usize];
    ["Offset of field: xcb_value_error_t::response_type"]
        [::std::mem::offset_of!(xcb_value_error_t, response_type) - 0usize];
    ["Offset of field: xcb_value_error_t::error_code"]
        [::std::mem::offset_of!(xcb_value_error_t, error_code) - 1usize];
    ["Offset of field: xcb_value_error_t::sequence"]
        [::std::mem::offset_of!(xcb_value_error_t, sequence) - 2usize];
    ["Offset of field: xcb_value_error_t::bad_value"]
        [::std::mem::offset_of!(xcb_value_error_t, bad_value) - 4usize];
    ["Offset of field: xcb_value_error_t::minor_opcode"]
        [::std::mem::offset_of!(xcb_value_error_t, minor_opcode) - 8usize];
    ["Offset of field: xcb_value_error_t::major_opcode"]
        [::std::mem::offset_of!(xcb_value_error_t, major_opcode) - 10usize];
    ["Offset of field: xcb_value_error_t::pad0"]
        [::std::mem::offset_of!(xcb_value_error_t, pad0) - 11usize];
};
pub type xcb_window_error_t = xcb_value_error_t;
pub type xcb_pixmap_error_t = xcb_value_error_t;
pub type xcb_atom_error_t = xcb_value_error_t;
pub type xcb_cursor_error_t = xcb_value_error_t;
pub type xcb_font_error_t = xcb_value_error_t;
pub type xcb_match_error_t = xcb_request_error_t;
pub type xcb_drawable_error_t = xcb_value_error_t;
pub type xcb_access_error_t = xcb_request_error_t;
pub type xcb_alloc_error_t = xcb_request_error_t;
pub type xcb_colormap_error_t = xcb_value_error_t;
pub type xcb_g_context_error_t = xcb_value_error_t;
pub type xcb_id_choice_error_t = xcb_value_error_t;
pub type xcb_name_error_t = xcb_request_error_t;
pub type xcb_length_error_t = xcb_request_error_t;
pub type xcb_implementation_error_t = xcb_request_error_t;
pub const xcb_window_class_t_XCB_WINDOW_CLASS_COPY_FROM_PARENT: xcb_window_class_t = 0;
pub const xcb_window_class_t_XCB_WINDOW_CLASS_INPUT_OUTPUT: xcb_window_class_t = 1;
pub const xcb_window_class_t_XCB_WINDOW_CLASS_INPUT_ONLY: xcb_window_class_t = 2;
pub type xcb_window_class_t = ::std::os::raw::c_uint;
pub const xcb_cw_t_XCB_CW_BACK_PIXMAP: xcb_cw_t = 1;
pub const xcb_cw_t_XCB_CW_BACK_PIXEL: xcb_cw_t = 2;
pub const xcb_cw_t_XCB_CW_BORDER_PIXMAP: xcb_cw_t = 4;
pub const xcb_cw_t_XCB_CW_BORDER_PIXEL: xcb_cw_t = 8;
pub const xcb_cw_t_XCB_CW_BIT_GRAVITY: xcb_cw_t = 16;
pub const xcb_cw_t_XCB_CW_WIN_GRAVITY: xcb_cw_t = 32;
pub const xcb_cw_t_XCB_CW_BACKING_STORE: xcb_cw_t = 64;
pub const xcb_cw_t_XCB_CW_BACKING_PLANES: xcb_cw_t = 128;
pub const xcb_cw_t_XCB_CW_BACKING_PIXEL: xcb_cw_t = 256;
pub const xcb_cw_t_XCB_CW_OVERRIDE_REDIRECT: xcb_cw_t = 512;
pub const xcb_cw_t_XCB_CW_SAVE_UNDER: xcb_cw_t = 1024;
pub const xcb_cw_t_XCB_CW_EVENT_MASK: xcb_cw_t = 2048;
pub const xcb_cw_t_XCB_CW_DONT_PROPAGATE: xcb_cw_t = 4096;
pub const xcb_cw_t_XCB_CW_COLORMAP: xcb_cw_t = 8192;
pub const xcb_cw_t_XCB_CW_CURSOR: xcb_cw_t = 16384;
pub type xcb_cw_t = ::std::os::raw::c_uint;
pub const xcb_back_pixmap_t_XCB_BACK_PIXMAP_NONE: xcb_back_pixmap_t = 0;
pub const xcb_back_pixmap_t_XCB_BACK_PIXMAP_PARENT_RELATIVE: xcb_back_pixmap_t = 1;
pub type xcb_back_pixmap_t = ::std::os::raw::c_uint;
pub const xcb_gravity_t_XCB_GRAVITY_BIT_FORGET: xcb_gravity_t = 0;
pub const xcb_gravity_t_XCB_GRAVITY_WIN_UNMAP: xcb_gravity_t = 0;
pub const xcb_gravity_t_XCB_GRAVITY_NORTH_WEST: xcb_gravity_t = 1;
pub const xcb_gravity_t_XCB_GRAVITY_NORTH: xcb_gravity_t = 2;
pub const xcb_gravity_t_XCB_GRAVITY_NORTH_EAST: xcb_gravity_t = 3;
pub const xcb_gravity_t_XCB_GRAVITY_WEST: xcb_gravity_t = 4;
pub const xcb_gravity_t_XCB_GRAVITY_CENTER: xcb_gravity_t = 5;
pub const xcb_gravity_t_XCB_GRAVITY_EAST: xcb_gravity_t = 6;
pub const xcb_gravity_t_XCB_GRAVITY_SOUTH_WEST: xcb_gravity_t = 7;
pub const xcb_gravity_t_XCB_GRAVITY_SOUTH: xcb_gravity_t = 8;
pub const xcb_gravity_t_XCB_GRAVITY_SOUTH_EAST: xcb_gravity_t = 9;
pub const xcb_gravity_t_XCB_GRAVITY_STATIC: xcb_gravity_t = 10;
pub type xcb_gravity_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_window_value_list_t {
    pub background_pixmap: xcb_pixmap_t,
    pub background_pixel: u32,
    pub border_pixmap: xcb_pixmap_t,
    pub border_pixel: u32,
    pub bit_gravity: u32,
    pub win_gravity: u32,
    pub backing_store: u32,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub override_redirect: xcb_bool32_t,
    pub save_under: xcb_bool32_t,
    pub event_mask: u32,
    pub do_not_propogate_mask: u32,
    pub colormap: xcb_colormap_t,
    pub cursor: xcb_cursor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_window_value_list_t"]
        [::std::mem::size_of::<xcb_create_window_value_list_t>() - 60usize];
    ["Alignment of xcb_create_window_value_list_t"]
        [::std::mem::align_of::<xcb_create_window_value_list_t>() - 4usize];
    ["Offset of field: xcb_create_window_value_list_t::background_pixmap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, background_pixmap) - 0usize];
    ["Offset of field: xcb_create_window_value_list_t::background_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, background_pixel) - 4usize];
    ["Offset of field: xcb_create_window_value_list_t::border_pixmap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, border_pixmap) - 8usize];
    ["Offset of field: xcb_create_window_value_list_t::border_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, border_pixel) - 12usize];
    ["Offset of field: xcb_create_window_value_list_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, bit_gravity) - 16usize];
    ["Offset of field: xcb_create_window_value_list_t::win_gravity"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, win_gravity) - 20usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_store"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_store) - 24usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_planes"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_planes) - 28usize];
    ["Offset of field: xcb_create_window_value_list_t::backing_pixel"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, backing_pixel) - 32usize];
    ["Offset of field: xcb_create_window_value_list_t::override_redirect"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, override_redirect) - 36usize];
    ["Offset of field: xcb_create_window_value_list_t::save_under"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, save_under) - 40usize];
    ["Offset of field: xcb_create_window_value_list_t::event_mask"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, event_mask) - 44usize];
    ["Offset of field: xcb_create_window_value_list_t::do_not_propogate_mask"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, do_not_propogate_mask) - 48usize];
    ["Offset of field: xcb_create_window_value_list_t::colormap"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, colormap) - 52usize];
    ["Offset of field: xcb_create_window_value_list_t::cursor"]
        [::std::mem::offset_of!(xcb_create_window_value_list_t, cursor) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_create_window_request_t {
    pub major_opcode: u8,
    pub depth: u8,
    pub length: u16,
    pub wid: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub _class: u16,
    pub visual: xcb_visualid_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_create_window_request_t"]
        [::std::mem::size_of::<xcb_create_window_request_t>() - 32usize];
    ["Alignment of xcb_create_window_request_t"]
        [::std::mem::align_of::<xcb_create_window_request_t>() - 4usize];
    ["Offset of field: xcb_create_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_create_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_create_window_request_t::depth"]
        [::std::mem::offset_of!(xcb_create_window_request_t, depth) - 1usize];
    ["Offset of field: xcb_create_window_request_t::length"]
        [::std::mem::offset_of!(xcb_create_window_request_t, length) - 2usize];
    ["Offset of field: xcb_create_window_request_t::wid"]
        [::std::mem::offset_of!(xcb_create_window_request_t, wid) - 4usize];
    ["Offset of field: xcb_create_window_request_t::parent"]
        [::std::mem::offset_of!(xcb_create_window_request_t, parent) - 8usize];
    ["Offset of field: xcb_create_window_request_t::x"]
        [::std::mem::offset_of!(xcb_create_window_request_t, x) - 12usize];
    ["Offset of field: xcb_create_window_request_t::y"]
        [::std::mem::offset_of!(xcb_create_window_request_t, y) - 14usize];
    ["Offset of field: xcb_create_window_request_t::width"]
        [::std::mem::offset_of!(xcb_create_window_request_t, width) - 16usize];
    ["Offset of field: xcb_create_window_request_t::height"]
        [::std::mem::offset_of!(xcb_create_window_request_t, height) - 18usize];
    ["Offset of field: xcb_create_window_request_t::border_width"]
        [::std::mem::offset_of!(xcb_create_window_request_t, border_width) - 20usize];
    ["Offset of field: xcb_create_window_request_t::_class"]
        [::std::mem::offset_of!(xcb_create_window_request_t, _class) - 22usize];
    ["Offset of field: xcb_create_window_request_t::visual"]
        [::std::mem::offset_of!(xcb_create_window_request_t, visual) - 24usize];
    ["Offset of field: xcb_create_window_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_create_window_request_t, value_mask) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_window_attributes_value_list_t {
    pub background_pixmap: xcb_pixmap_t,
    pub background_pixel: u32,
    pub border_pixmap: xcb_pixmap_t,
    pub border_pixel: u32,
    pub bit_gravity: u32,
    pub win_gravity: u32,
    pub backing_store: u32,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub override_redirect: xcb_bool32_t,
    pub save_under: xcb_bool32_t,
    pub event_mask: u32,
    pub do_not_propogate_mask: u32,
    pub colormap: xcb_colormap_t,
    pub cursor: xcb_cursor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_window_attributes_value_list_t"]
        [::std::mem::size_of::<xcb_change_window_attributes_value_list_t>() - 60usize];
    ["Alignment of xcb_change_window_attributes_value_list_t"]
        [::std::mem::align_of::<xcb_change_window_attributes_value_list_t>() - 4usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::background_pixmap"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        background_pixmap
    ) - 0usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::background_pixel"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        background_pixel
    ) - 4usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::border_pixmap"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, border_pixmap) - 8usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::border_pixel"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, border_pixel) - 12usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, bit_gravity) - 16usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::win_gravity"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, win_gravity) - 20usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_store"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_store
    ) - 24usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_planes"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_planes
    ) - 28usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::backing_pixel"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        backing_pixel
    ) - 32usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::override_redirect"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        override_redirect
    ) - 36usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::save_under"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, save_under) - 40usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::event_mask"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, event_mask) - 44usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::do_not_propogate_mask"][::std::mem::offset_of!(
        xcb_change_window_attributes_value_list_t,
        do_not_propogate_mask
    )
        - 48usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::colormap"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, colormap) - 52usize];
    ["Offset of field: xcb_change_window_attributes_value_list_t::cursor"]
        [::std::mem::offset_of!(xcb_change_window_attributes_value_list_t, cursor) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_window_attributes_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub value_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_window_attributes_request_t"]
        [::std::mem::size_of::<xcb_change_window_attributes_request_t>() - 12usize];
    ["Alignment of xcb_change_window_attributes_request_t"]
        [::std::mem::align_of::<xcb_change_window_attributes_request_t>() - 4usize];
    ["Offset of field: xcb_change_window_attributes_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_window_attributes_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, pad0) - 1usize];
    ["Offset of field: xcb_change_window_attributes_request_t::length"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, length) - 2usize];
    ["Offset of field: xcb_change_window_attributes_request_t::window"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, window) - 4usize];
    ["Offset of field: xcb_change_window_attributes_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_change_window_attributes_request_t, value_mask) - 8usize];
};
pub const xcb_map_state_t_XCB_MAP_STATE_UNMAPPED: xcb_map_state_t = 0;
pub const xcb_map_state_t_XCB_MAP_STATE_UNVIEWABLE: xcb_map_state_t = 1;
pub const xcb_map_state_t_XCB_MAP_STATE_VIEWABLE: xcb_map_state_t = 2;
pub type xcb_map_state_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_cookie_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_cookie_t>() - 4usize];
    ["Alignment of xcb_get_window_attributes_cookie_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_window_attributes_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_request_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_request_t>() - 8usize];
    ["Alignment of xcb_get_window_attributes_request_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_request_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_window_attributes_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_window_attributes_request_t::length"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, length) - 2usize];
    ["Offset of field: xcb_get_window_attributes_request_t::window"]
        [::std::mem::offset_of!(xcb_get_window_attributes_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_window_attributes_reply_t {
    pub response_type: u8,
    pub backing_store: u8,
    pub sequence: u16,
    pub length: u32,
    pub visual: xcb_visualid_t,
    pub _class: u16,
    pub bit_gravity: u8,
    pub win_gravity: u8,
    pub backing_planes: u32,
    pub backing_pixel: u32,
    pub save_under: u8,
    pub map_is_installed: u8,
    pub map_state: u8,
    pub override_redirect: u8,
    pub colormap: xcb_colormap_t,
    pub all_event_masks: u32,
    pub your_event_mask: u32,
    pub do_not_propagate_mask: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_window_attributes_reply_t"]
        [::std::mem::size_of::<xcb_get_window_attributes_reply_t>() - 44usize];
    ["Alignment of xcb_get_window_attributes_reply_t"]
        [::std::mem::align_of::<xcb_get_window_attributes_reply_t>() - 4usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_store"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_store) - 1usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::visual"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, visual) - 8usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::_class"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, _class) - 12usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::bit_gravity"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, bit_gravity) - 14usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::win_gravity"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, win_gravity) - 15usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_planes"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_planes) - 16usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::backing_pixel"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, backing_pixel) - 20usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::save_under"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, save_under) - 24usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::map_is_installed"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, map_is_installed) - 25usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::map_state"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, map_state) - 26usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::override_redirect"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, override_redirect) - 27usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::colormap"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, colormap) - 28usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::all_event_masks"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, all_event_masks) - 32usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::your_event_mask"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, your_event_mask) - 36usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::do_not_propagate_mask"][::std::mem::offset_of!(
        xcb_get_window_attributes_reply_t,
        do_not_propagate_mask
    ) - 40usize];
    ["Offset of field: xcb_get_window_attributes_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_window_attributes_reply_t, pad0) - 42usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_window_request_t"]
        [::std::mem::size_of::<xcb_destroy_window_request_t>() - 8usize];
    ["Alignment of xcb_destroy_window_request_t"]
        [::std::mem::align_of::<xcb_destroy_window_request_t>() - 4usize];
    ["Offset of field: xcb_destroy_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_destroy_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_window_request_t::length"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, length) - 2usize];
    ["Offset of field: xcb_destroy_window_request_t::window"]
        [::std::mem::offset_of!(xcb_destroy_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_destroy_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_destroy_subwindows_request_t"]
        [::std::mem::size_of::<xcb_destroy_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_destroy_subwindows_request_t"]
        [::std::mem::align_of::<xcb_destroy_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_destroy_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_destroy_subwindows_request_t, window) - 4usize];
};
pub const xcb_set_mode_t_XCB_SET_MODE_INSERT: xcb_set_mode_t = 0;
pub const xcb_set_mode_t_XCB_SET_MODE_DELETE: xcb_set_mode_t = 1;
pub type xcb_set_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_save_set_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_save_set_request_t"]
        [::std::mem::size_of::<xcb_change_save_set_request_t>() - 8usize];
    ["Alignment of xcb_change_save_set_request_t"]
        [::std::mem::align_of::<xcb_change_save_set_request_t>() - 4usize];
    ["Offset of field: xcb_change_save_set_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_save_set_request_t::mode"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, mode) - 1usize];
    ["Offset of field: xcb_change_save_set_request_t::length"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, length) - 2usize];
    ["Offset of field: xcb_change_save_set_request_t::window"]
        [::std::mem::offset_of!(xcb_change_save_set_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_reparent_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub parent: xcb_window_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_reparent_window_request_t"]
        [::std::mem::size_of::<xcb_reparent_window_request_t>() - 16usize];
    ["Alignment of xcb_reparent_window_request_t"]
        [::std::mem::align_of::<xcb_reparent_window_request_t>() - 4usize];
    ["Offset of field: xcb_reparent_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_reparent_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_reparent_window_request_t::length"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, length) - 2usize];
    ["Offset of field: xcb_reparent_window_request_t::window"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, window) - 4usize];
    ["Offset of field: xcb_reparent_window_request_t::parent"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, parent) - 8usize];
    ["Offset of field: xcb_reparent_window_request_t::x"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, x) - 12usize];
    ["Offset of field: xcb_reparent_window_request_t::y"]
        [::std::mem::offset_of!(xcb_reparent_window_request_t, y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_window_request_t"]
        [::std::mem::size_of::<xcb_map_window_request_t>() - 8usize];
    ["Alignment of xcb_map_window_request_t"]
        [::std::mem::align_of::<xcb_map_window_request_t>() - 4usize];
    ["Offset of field: xcb_map_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_map_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_map_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_map_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_map_window_request_t::length"]
        [::std::mem::offset_of!(xcb_map_window_request_t, length) - 2usize];
    ["Offset of field: xcb_map_window_request_t::window"]
        [::std::mem::offset_of!(xcb_map_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_map_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_map_subwindows_request_t"]
        [::std::mem::size_of::<xcb_map_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_map_subwindows_request_t"]
        [::std::mem::align_of::<xcb_map_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_map_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_map_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_map_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_map_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_map_subwindows_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_window_request_t"]
        [::std::mem::size_of::<xcb_unmap_window_request_t>() - 8usize];
    ["Alignment of xcb_unmap_window_request_t"]
        [::std::mem::align_of::<xcb_unmap_window_request_t>() - 4usize];
    ["Offset of field: xcb_unmap_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_unmap_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_window_request_t::length"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, length) - 2usize];
    ["Offset of field: xcb_unmap_window_request_t::window"]
        [::std::mem::offset_of!(xcb_unmap_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_unmap_subwindows_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_unmap_subwindows_request_t"]
        [::std::mem::size_of::<xcb_unmap_subwindows_request_t>() - 8usize];
    ["Alignment of xcb_unmap_subwindows_request_t"]
        [::std::mem::align_of::<xcb_unmap_subwindows_request_t>() - 4usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::pad0"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, pad0) - 1usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::length"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, length) - 2usize];
    ["Offset of field: xcb_unmap_subwindows_request_t::window"]
        [::std::mem::offset_of!(xcb_unmap_subwindows_request_t, window) - 4usize];
};
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_X: xcb_config_window_t = 1;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_Y: xcb_config_window_t = 2;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_WIDTH: xcb_config_window_t = 4;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_HEIGHT: xcb_config_window_t = 8;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_BORDER_WIDTH: xcb_config_window_t = 16;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_SIBLING: xcb_config_window_t = 32;
pub const xcb_config_window_t_XCB_CONFIG_WINDOW_STACK_MODE: xcb_config_window_t = 64;
pub type xcb_config_window_t = ::std::os::raw::c_uint;
pub const xcb_stack_mode_t_XCB_STACK_MODE_ABOVE: xcb_stack_mode_t = 0;
pub const xcb_stack_mode_t_XCB_STACK_MODE_BELOW: xcb_stack_mode_t = 1;
pub const xcb_stack_mode_t_XCB_STACK_MODE_TOP_IF: xcb_stack_mode_t = 2;
pub const xcb_stack_mode_t_XCB_STACK_MODE_BOTTOM_IF: xcb_stack_mode_t = 3;
pub const xcb_stack_mode_t_XCB_STACK_MODE_OPPOSITE: xcb_stack_mode_t = 4;
pub type xcb_stack_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_window_value_list_t {
    pub x: i32,
    pub y: i32,
    pub width: u32,
    pub height: u32,
    pub border_width: u32,
    pub sibling: xcb_window_t,
    pub stack_mode: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_window_value_list_t"]
        [::std::mem::size_of::<xcb_configure_window_value_list_t>() - 28usize];
    ["Alignment of xcb_configure_window_value_list_t"]
        [::std::mem::align_of::<xcb_configure_window_value_list_t>() - 4usize];
    ["Offset of field: xcb_configure_window_value_list_t::x"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, x) - 0usize];
    ["Offset of field: xcb_configure_window_value_list_t::y"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, y) - 4usize];
    ["Offset of field: xcb_configure_window_value_list_t::width"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, width) - 8usize];
    ["Offset of field: xcb_configure_window_value_list_t::height"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, height) - 12usize];
    ["Offset of field: xcb_configure_window_value_list_t::border_width"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, border_width) - 16usize];
    ["Offset of field: xcb_configure_window_value_list_t::sibling"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, sibling) - 20usize];
    ["Offset of field: xcb_configure_window_value_list_t::stack_mode"]
        [::std::mem::offset_of!(xcb_configure_window_value_list_t, stack_mode) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_configure_window_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub value_mask: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_configure_window_request_t"]
        [::std::mem::size_of::<xcb_configure_window_request_t>() - 12usize];
    ["Alignment of xcb_configure_window_request_t"]
        [::std::mem::align_of::<xcb_configure_window_request_t>() - 4usize];
    ["Offset of field: xcb_configure_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_configure_window_request_t::pad0"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, pad0) - 1usize];
    ["Offset of field: xcb_configure_window_request_t::length"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, length) - 2usize];
    ["Offset of field: xcb_configure_window_request_t::window"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, window) - 4usize];
    ["Offset of field: xcb_configure_window_request_t::value_mask"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, value_mask) - 8usize];
    ["Offset of field: xcb_configure_window_request_t::pad1"]
        [::std::mem::offset_of!(xcb_configure_window_request_t, pad1) - 10usize];
};
pub const xcb_circulate_t_XCB_CIRCULATE_RAISE_LOWEST: xcb_circulate_t = 0;
pub const xcb_circulate_t_XCB_CIRCULATE_LOWER_HIGHEST: xcb_circulate_t = 1;
pub type xcb_circulate_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_circulate_window_request_t {
    pub major_opcode: u8,
    pub direction: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_circulate_window_request_t"]
        [::std::mem::size_of::<xcb_circulate_window_request_t>() - 8usize];
    ["Alignment of xcb_circulate_window_request_t"]
        [::std::mem::align_of::<xcb_circulate_window_request_t>() - 4usize];
    ["Offset of field: xcb_circulate_window_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_circulate_window_request_t::direction"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, direction) - 1usize];
    ["Offset of field: xcb_circulate_window_request_t::length"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, length) - 2usize];
    ["Offset of field: xcb_circulate_window_request_t::window"]
        [::std::mem::offset_of!(xcb_circulate_window_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_cookie_t"]
        [::std::mem::size_of::<xcb_get_geometry_cookie_t>() - 4usize];
    ["Alignment of xcb_get_geometry_cookie_t"]
        [::std::mem::align_of::<xcb_get_geometry_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_geometry_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub drawable: xcb_drawable_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_request_t"]
        [::std::mem::size_of::<xcb_get_geometry_request_t>() - 8usize];
    ["Alignment of xcb_get_geometry_request_t"]
        [::std::mem::align_of::<xcb_get_geometry_request_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_geometry_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_geometry_request_t::length"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, length) - 2usize];
    ["Offset of field: xcb_get_geometry_request_t::drawable"]
        [::std::mem::offset_of!(xcb_get_geometry_request_t, drawable) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_geometry_reply_t {
    pub response_type: u8,
    pub depth: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
    pub border_width: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_geometry_reply_t"]
        [::std::mem::size_of::<xcb_get_geometry_reply_t>() - 24usize];
    ["Alignment of xcb_get_geometry_reply_t"]
        [::std::mem::align_of::<xcb_get_geometry_reply_t>() - 4usize];
    ["Offset of field: xcb_get_geometry_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_geometry_reply_t::depth"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, depth) - 1usize];
    ["Offset of field: xcb_get_geometry_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_geometry_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_geometry_reply_t::root"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, root) - 8usize];
    ["Offset of field: xcb_get_geometry_reply_t::x"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, x) - 12usize];
    ["Offset of field: xcb_get_geometry_reply_t::y"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, y) - 14usize];
    ["Offset of field: xcb_get_geometry_reply_t::width"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, width) - 16usize];
    ["Offset of field: xcb_get_geometry_reply_t::height"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, height) - 18usize];
    ["Offset of field: xcb_get_geometry_reply_t::border_width"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, border_width) - 20usize];
    ["Offset of field: xcb_get_geometry_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_geometry_reply_t, pad0) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_cookie_t"][::std::mem::size_of::<xcb_query_tree_cookie_t>() - 4usize];
    ["Alignment of xcb_query_tree_cookie_t"]
        [::std::mem::align_of::<xcb_query_tree_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_tree_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_tree_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_request_t"]
        [::std::mem::size_of::<xcb_query_tree_request_t>() - 8usize];
    ["Alignment of xcb_query_tree_request_t"]
        [::std::mem::align_of::<xcb_query_tree_request_t>() - 4usize];
    ["Offset of field: xcb_query_tree_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_tree_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_tree_request_t::length"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, length) - 2usize];
    ["Offset of field: xcb_query_tree_request_t::window"]
        [::std::mem::offset_of!(xcb_query_tree_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_tree_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub parent: xcb_window_t,
    pub children_len: u16,
    pub pad1: [u8; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_tree_reply_t"][::std::mem::size_of::<xcb_query_tree_reply_t>() - 32usize];
    ["Alignment of xcb_query_tree_reply_t"]
        [::std::mem::align_of::<xcb_query_tree_reply_t>() - 4usize];
    ["Offset of field: xcb_query_tree_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_tree_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_query_tree_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_tree_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_tree_reply_t::root"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, root) - 8usize];
    ["Offset of field: xcb_query_tree_reply_t::parent"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, parent) - 12usize];
    ["Offset of field: xcb_query_tree_reply_t::children_len"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, children_len) - 16usize];
    ["Offset of field: xcb_query_tree_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_query_tree_reply_t, pad1) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_cookie_t"]
        [::std::mem::size_of::<xcb_intern_atom_cookie_t>() - 4usize];
    ["Alignment of xcb_intern_atom_cookie_t"]
        [::std::mem::align_of::<xcb_intern_atom_cookie_t>() - 4usize];
    ["Offset of field: xcb_intern_atom_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_intern_atom_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_request_t {
    pub major_opcode: u8,
    pub only_if_exists: u8,
    pub length: u16,
    pub name_len: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_request_t"]
        [::std::mem::size_of::<xcb_intern_atom_request_t>() - 8usize];
    ["Alignment of xcb_intern_atom_request_t"]
        [::std::mem::align_of::<xcb_intern_atom_request_t>() - 2usize];
    ["Offset of field: xcb_intern_atom_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_intern_atom_request_t::only_if_exists"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, only_if_exists) - 1usize];
    ["Offset of field: xcb_intern_atom_request_t::length"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, length) - 2usize];
    ["Offset of field: xcb_intern_atom_request_t::name_len"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, name_len) - 4usize];
    ["Offset of field: xcb_intern_atom_request_t::pad0"]
        [::std::mem::offset_of!(xcb_intern_atom_request_t, pad0) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_intern_atom_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub atom: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_intern_atom_reply_t"][::std::mem::size_of::<xcb_intern_atom_reply_t>() - 12usize];
    ["Alignment of xcb_intern_atom_reply_t"]
        [::std::mem::align_of::<xcb_intern_atom_reply_t>() - 4usize];
    ["Offset of field: xcb_intern_atom_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_intern_atom_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_intern_atom_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_intern_atom_reply_t::length"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, length) - 4usize];
    ["Offset of field: xcb_intern_atom_reply_t::atom"]
        [::std::mem::offset_of!(xcb_intern_atom_reply_t, atom) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_cookie_t"]
        [::std::mem::size_of::<xcb_get_atom_name_cookie_t>() - 4usize];
    ["Alignment of xcb_get_atom_name_cookie_t"]
        [::std::mem::align_of::<xcb_get_atom_name_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_atom_name_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub atom: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_request_t"]
        [::std::mem::size_of::<xcb_get_atom_name_request_t>() - 8usize];
    ["Alignment of xcb_get_atom_name_request_t"]
        [::std::mem::align_of::<xcb_get_atom_name_request_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_atom_name_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_atom_name_request_t::length"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, length) - 2usize];
    ["Offset of field: xcb_get_atom_name_request_t::atom"]
        [::std::mem::offset_of!(xcb_get_atom_name_request_t, atom) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_atom_name_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub name_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_atom_name_reply_t"]
        [::std::mem::size_of::<xcb_get_atom_name_reply_t>() - 32usize];
    ["Alignment of xcb_get_atom_name_reply_t"]
        [::std::mem::align_of::<xcb_get_atom_name_reply_t>() - 4usize];
    ["Offset of field: xcb_get_atom_name_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_atom_name_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_atom_name_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_atom_name_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_atom_name_reply_t::name_len"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, name_len) - 8usize];
    ["Offset of field: xcb_get_atom_name_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_get_atom_name_reply_t, pad1) - 10usize];
};
pub const xcb_prop_mode_t_XCB_PROP_MODE_REPLACE: xcb_prop_mode_t = 0;
pub const xcb_prop_mode_t_XCB_PROP_MODE_PREPEND: xcb_prop_mode_t = 1;
pub const xcb_prop_mode_t_XCB_PROP_MODE_APPEND: xcb_prop_mode_t = 2;
pub type xcb_prop_mode_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_property_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
    pub type_: xcb_atom_t,
    pub format: u8,
    pub pad0: [u8; 3usize],
    pub data_len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_property_request_t"]
        [::std::mem::size_of::<xcb_change_property_request_t>() - 24usize];
    ["Alignment of xcb_change_property_request_t"]
        [::std::mem::align_of::<xcb_change_property_request_t>() - 4usize];
    ["Offset of field: xcb_change_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_property_request_t::mode"]
        [::std::mem::offset_of!(xcb_change_property_request_t, mode) - 1usize];
    ["Offset of field: xcb_change_property_request_t::length"]
        [::std::mem::offset_of!(xcb_change_property_request_t, length) - 2usize];
    ["Offset of field: xcb_change_property_request_t::window"]
        [::std::mem::offset_of!(xcb_change_property_request_t, window) - 4usize];
    ["Offset of field: xcb_change_property_request_t::property"]
        [::std::mem::offset_of!(xcb_change_property_request_t, property) - 8usize];
    ["Offset of field: xcb_change_property_request_t::type_"]
        [::std::mem::offset_of!(xcb_change_property_request_t, type_) - 12usize];
    ["Offset of field: xcb_change_property_request_t::format"]
        [::std::mem::offset_of!(xcb_change_property_request_t, format) - 16usize];
    ["Offset of field: xcb_change_property_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_property_request_t, pad0) - 17usize];
    ["Offset of field: xcb_change_property_request_t::data_len"]
        [::std::mem::offset_of!(xcb_change_property_request_t, data_len) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_delete_property_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_delete_property_request_t"]
        [::std::mem::size_of::<xcb_delete_property_request_t>() - 12usize];
    ["Alignment of xcb_delete_property_request_t"]
        [::std::mem::align_of::<xcb_delete_property_request_t>() - 4usize];
    ["Offset of field: xcb_delete_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_delete_property_request_t::pad0"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, pad0) - 1usize];
    ["Offset of field: xcb_delete_property_request_t::length"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, length) - 2usize];
    ["Offset of field: xcb_delete_property_request_t::window"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, window) - 4usize];
    ["Offset of field: xcb_delete_property_request_t::property"]
        [::std::mem::offset_of!(xcb_delete_property_request_t, property) - 8usize];
};
pub const xcb_get_property_type_t_XCB_GET_PROPERTY_TYPE_ANY: xcb_get_property_type_t = 0;
pub type xcb_get_property_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_cookie_t"]
        [::std::mem::size_of::<xcb_get_property_cookie_t>() - 4usize];
    ["Alignment of xcb_get_property_cookie_t"]
        [::std::mem::align_of::<xcb_get_property_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_property_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_property_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_request_t {
    pub major_opcode: u8,
    pub _delete: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub property: xcb_atom_t,
    pub type_: xcb_atom_t,
    pub long_offset: u32,
    pub long_length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_request_t"]
        [::std::mem::size_of::<xcb_get_property_request_t>() - 24usize];
    ["Alignment of xcb_get_property_request_t"]
        [::std::mem::align_of::<xcb_get_property_request_t>() - 4usize];
    ["Offset of field: xcb_get_property_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_property_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_property_request_t::_delete"]
        [::std::mem::offset_of!(xcb_get_property_request_t, _delete) - 1usize];
    ["Offset of field: xcb_get_property_request_t::length"]
        [::std::mem::offset_of!(xcb_get_property_request_t, length) - 2usize];
    ["Offset of field: xcb_get_property_request_t::window"]
        [::std::mem::offset_of!(xcb_get_property_request_t, window) - 4usize];
    ["Offset of field: xcb_get_property_request_t::property"]
        [::std::mem::offset_of!(xcb_get_property_request_t, property) - 8usize];
    ["Offset of field: xcb_get_property_request_t::type_"]
        [::std::mem::offset_of!(xcb_get_property_request_t, type_) - 12usize];
    ["Offset of field: xcb_get_property_request_t::long_offset"]
        [::std::mem::offset_of!(xcb_get_property_request_t, long_offset) - 16usize];
    ["Offset of field: xcb_get_property_request_t::long_length"]
        [::std::mem::offset_of!(xcb_get_property_request_t, long_length) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_property_reply_t {
    pub response_type: u8,
    pub format: u8,
    pub sequence: u16,
    pub length: u32,
    pub type_: xcb_atom_t,
    pub bytes_after: u32,
    pub value_len: u32,
    pub pad0: [u8; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_property_reply_t"]
        [::std::mem::size_of::<xcb_get_property_reply_t>() - 32usize];
    ["Alignment of xcb_get_property_reply_t"]
        [::std::mem::align_of::<xcb_get_property_reply_t>() - 4usize];
    ["Offset of field: xcb_get_property_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_property_reply_t::format"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, format) - 1usize];
    ["Offset of field: xcb_get_property_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_property_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_property_reply_t::type_"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, type_) - 8usize];
    ["Offset of field: xcb_get_property_reply_t::bytes_after"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, bytes_after) - 12usize];
    ["Offset of field: xcb_get_property_reply_t::value_len"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, value_len) - 16usize];
    ["Offset of field: xcb_get_property_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_property_reply_t, pad0) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_cookie_t"]
        [::std::mem::size_of::<xcb_list_properties_cookie_t>() - 4usize];
    ["Alignment of xcb_list_properties_cookie_t"]
        [::std::mem::align_of::<xcb_list_properties_cookie_t>() - 4usize];
    ["Offset of field: xcb_list_properties_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_list_properties_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_request_t"]
        [::std::mem::size_of::<xcb_list_properties_request_t>() - 8usize];
    ["Alignment of xcb_list_properties_request_t"]
        [::std::mem::align_of::<xcb_list_properties_request_t>() - 4usize];
    ["Offset of field: xcb_list_properties_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_list_properties_request_t::pad0"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, pad0) - 1usize];
    ["Offset of field: xcb_list_properties_request_t::length"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, length) - 2usize];
    ["Offset of field: xcb_list_properties_request_t::window"]
        [::std::mem::offset_of!(xcb_list_properties_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_list_properties_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub atoms_len: u16,
    pub pad1: [u8; 22usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_list_properties_reply_t"]
        [::std::mem::size_of::<xcb_list_properties_reply_t>() - 32usize];
    ["Alignment of xcb_list_properties_reply_t"]
        [::std::mem::align_of::<xcb_list_properties_reply_t>() - 4usize];
    ["Offset of field: xcb_list_properties_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_list_properties_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_list_properties_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_list_properties_reply_t::length"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, length) - 4usize];
    ["Offset of field: xcb_list_properties_reply_t::atoms_len"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, atoms_len) - 8usize];
    ["Offset of field: xcb_list_properties_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_list_properties_reply_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_selection_owner_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub owner: xcb_window_t,
    pub selection: xcb_atom_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_selection_owner_request_t"]
        [::std::mem::size_of::<xcb_set_selection_owner_request_t>() - 16usize];
    ["Alignment of xcb_set_selection_owner_request_t"]
        [::std::mem::align_of::<xcb_set_selection_owner_request_t>() - 4usize];
    ["Offset of field: xcb_set_selection_owner_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_selection_owner_request_t::pad0"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, pad0) - 1usize];
    ["Offset of field: xcb_set_selection_owner_request_t::length"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, length) - 2usize];
    ["Offset of field: xcb_set_selection_owner_request_t::owner"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, owner) - 4usize];
    ["Offset of field: xcb_set_selection_owner_request_t::selection"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, selection) - 8usize];
    ["Offset of field: xcb_set_selection_owner_request_t::time"]
        [::std::mem::offset_of!(xcb_set_selection_owner_request_t, time) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_cookie_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_cookie_t>() - 4usize];
    ["Alignment of xcb_get_selection_owner_cookie_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_selection_owner_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub selection: xcb_atom_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_request_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_request_t>() - 8usize];
    ["Alignment of xcb_get_selection_owner_request_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_request_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_selection_owner_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_selection_owner_request_t::length"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, length) - 2usize];
    ["Offset of field: xcb_get_selection_owner_request_t::selection"]
        [::std::mem::offset_of!(xcb_get_selection_owner_request_t, selection) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_selection_owner_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub owner: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_selection_owner_reply_t"]
        [::std::mem::size_of::<xcb_get_selection_owner_reply_t>() - 12usize];
    ["Alignment of xcb_get_selection_owner_reply_t"]
        [::std::mem::align_of::<xcb_get_selection_owner_reply_t>() - 4usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_selection_owner_reply_t::owner"]
        [::std::mem::offset_of!(xcb_get_selection_owner_reply_t, owner) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_convert_selection_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub requestor: xcb_window_t,
    pub selection: xcb_atom_t,
    pub target: xcb_atom_t,
    pub property: xcb_atom_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_convert_selection_request_t"]
        [::std::mem::size_of::<xcb_convert_selection_request_t>() - 24usize];
    ["Alignment of xcb_convert_selection_request_t"]
        [::std::mem::align_of::<xcb_convert_selection_request_t>() - 4usize];
    ["Offset of field: xcb_convert_selection_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_convert_selection_request_t::pad0"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, pad0) - 1usize];
    ["Offset of field: xcb_convert_selection_request_t::length"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, length) - 2usize];
    ["Offset of field: xcb_convert_selection_request_t::requestor"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, requestor) - 4usize];
    ["Offset of field: xcb_convert_selection_request_t::selection"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, selection) - 8usize];
    ["Offset of field: xcb_convert_selection_request_t::target"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, target) - 12usize];
    ["Offset of field: xcb_convert_selection_request_t::property"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, property) - 16usize];
    ["Offset of field: xcb_convert_selection_request_t::time"]
        [::std::mem::offset_of!(xcb_convert_selection_request_t, time) - 20usize];
};
pub const xcb_send_event_dest_t_XCB_SEND_EVENT_DEST_POINTER_WINDOW: xcb_send_event_dest_t = 0;
pub const xcb_send_event_dest_t_XCB_SEND_EVENT_DEST_ITEM_FOCUS: xcb_send_event_dest_t = 1;
pub type xcb_send_event_dest_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_send_event_request_t {
    pub major_opcode: u8,
    pub propagate: u8,
    pub length: u16,
    pub destination: xcb_window_t,
    pub event_mask: u32,
    pub event: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_send_event_request_t"]
        [::std::mem::size_of::<xcb_send_event_request_t>() - 44usize];
    ["Alignment of xcb_send_event_request_t"]
        [::std::mem::align_of::<xcb_send_event_request_t>() - 4usize];
    ["Offset of field: xcb_send_event_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_send_event_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_send_event_request_t::propagate"]
        [::std::mem::offset_of!(xcb_send_event_request_t, propagate) - 1usize];
    ["Offset of field: xcb_send_event_request_t::length"]
        [::std::mem::offset_of!(xcb_send_event_request_t, length) - 2usize];
    ["Offset of field: xcb_send_event_request_t::destination"]
        [::std::mem::offset_of!(xcb_send_event_request_t, destination) - 4usize];
    ["Offset of field: xcb_send_event_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_send_event_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_send_event_request_t::event"]
        [::std::mem::offset_of!(xcb_send_event_request_t, event) - 12usize];
};
pub const xcb_grab_mode_t_XCB_GRAB_MODE_SYNC: xcb_grab_mode_t = 0;
pub const xcb_grab_mode_t_XCB_GRAB_MODE_ASYNC: xcb_grab_mode_t = 1;
pub type xcb_grab_mode_t = ::std::os::raw::c_uint;
pub const xcb_grab_status_t_XCB_GRAB_STATUS_SUCCESS: xcb_grab_status_t = 0;
pub const xcb_grab_status_t_XCB_GRAB_STATUS_ALREADY_GRABBED: xcb_grab_status_t = 1;
pub const xcb_grab_status_t_XCB_GRAB_STATUS_INVALID_TIME: xcb_grab_status_t = 2;
pub const xcb_grab_status_t_XCB_GRAB_STATUS_NOT_VIEWABLE: xcb_grab_status_t = 3;
pub const xcb_grab_status_t_XCB_GRAB_STATUS_FROZEN: xcb_grab_status_t = 4;
pub type xcb_grab_status_t = ::std::os::raw::c_uint;
pub const xcb_cursor_enum_t_XCB_CURSOR_NONE: xcb_cursor_enum_t = 0;
pub type xcb_cursor_enum_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_cookie_t"]
        [::std::mem::size_of::<xcb_grab_pointer_cookie_t>() - 4usize];
    ["Alignment of xcb_grab_pointer_cookie_t"]
        [::std::mem::align_of::<xcb_grab_pointer_cookie_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_pointer_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub event_mask: u16,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub confine_to: xcb_window_t,
    pub cursor: xcb_cursor_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_request_t"]
        [::std::mem::size_of::<xcb_grab_pointer_request_t>() - 24usize];
    ["Alignment of xcb_grab_pointer_request_t"]
        [::std::mem::align_of::<xcb_grab_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_pointer_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_pointer_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_pointer_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_grab_pointer_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, pointer_mode) - 10usize];
    ["Offset of field: xcb_grab_pointer_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, keyboard_mode) - 11usize];
    ["Offset of field: xcb_grab_pointer_request_t::confine_to"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, confine_to) - 12usize];
    ["Offset of field: xcb_grab_pointer_request_t::cursor"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, cursor) - 16usize];
    ["Offset of field: xcb_grab_pointer_request_t::time"]
        [::std::mem::offset_of!(xcb_grab_pointer_request_t, time) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_pointer_reply_t {
    pub response_type: u8,
    pub status: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_pointer_reply_t"]
        [::std::mem::size_of::<xcb_grab_pointer_reply_t>() - 8usize];
    ["Alignment of xcb_grab_pointer_reply_t"]
        [::std::mem::align_of::<xcb_grab_pointer_reply_t>() - 4usize];
    ["Offset of field: xcb_grab_pointer_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_grab_pointer_reply_t::status"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, status) - 1usize];
    ["Offset of field: xcb_grab_pointer_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_grab_pointer_reply_t::length"]
        [::std::mem::offset_of!(xcb_grab_pointer_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_pointer_request_t"]
        [::std::mem::size_of::<xcb_ungrab_pointer_request_t>() - 8usize];
    ["Alignment of xcb_ungrab_pointer_request_t"]
        [::std::mem::align_of::<xcb_ungrab_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_pointer_request_t::time"]
        [::std::mem::offset_of!(xcb_ungrab_pointer_request_t, time) - 4usize];
};
pub const xcb_button_index_t_XCB_BUTTON_INDEX_ANY: xcb_button_index_t = 0;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_1: xcb_button_index_t = 1;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_2: xcb_button_index_t = 2;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_3: xcb_button_index_t = 3;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_4: xcb_button_index_t = 4;
pub const xcb_button_index_t_XCB_BUTTON_INDEX_5: xcb_button_index_t = 5;
pub type xcb_button_index_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_button_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub event_mask: u16,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub confine_to: xcb_window_t,
    pub cursor: xcb_cursor_t,
    pub button: u8,
    pub pad0: u8,
    pub modifiers: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_button_request_t"]
        [::std::mem::size_of::<xcb_grab_button_request_t>() - 24usize];
    ["Alignment of xcb_grab_button_request_t"]
        [::std::mem::align_of::<xcb_grab_button_request_t>() - 4usize];
    ["Offset of field: xcb_grab_button_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_button_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_button_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_button_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_button_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, event_mask) - 8usize];
    ["Offset of field: xcb_grab_button_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, pointer_mode) - 10usize];
    ["Offset of field: xcb_grab_button_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, keyboard_mode) - 11usize];
    ["Offset of field: xcb_grab_button_request_t::confine_to"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, confine_to) - 12usize];
    ["Offset of field: xcb_grab_button_request_t::cursor"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, cursor) - 16usize];
    ["Offset of field: xcb_grab_button_request_t::button"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, button) - 20usize];
    ["Offset of field: xcb_grab_button_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, pad0) - 21usize];
    ["Offset of field: xcb_grab_button_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_grab_button_request_t, modifiers) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_button_request_t {
    pub major_opcode: u8,
    pub button: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_button_request_t"]
        [::std::mem::size_of::<xcb_ungrab_button_request_t>() - 12usize];
    ["Alignment of xcb_ungrab_button_request_t"]
        [::std::mem::align_of::<xcb_ungrab_button_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_button_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_button_request_t::button"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, button) - 1usize];
    ["Offset of field: xcb_ungrab_button_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_button_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_ungrab_button_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_ungrab_button_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_button_request_t, pad0) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_change_active_pointer_grab_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub cursor: xcb_cursor_t,
    pub time: xcb_timestamp_t,
    pub event_mask: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_change_active_pointer_grab_request_t"]
        [::std::mem::size_of::<xcb_change_active_pointer_grab_request_t>() - 16usize];
    ["Alignment of xcb_change_active_pointer_grab_request_t"]
        [::std::mem::align_of::<xcb_change_active_pointer_grab_request_t>() - 4usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::pad0"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, pad0) - 1usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::length"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, length) - 2usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::cursor"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, cursor) - 4usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::time"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, time) - 8usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::event_mask"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, event_mask) - 12usize];
    ["Offset of field: xcb_change_active_pointer_grab_request_t::pad1"]
        [::std::mem::offset_of!(xcb_change_active_pointer_grab_request_t, pad1) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_cookie_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_cookie_t>() - 4usize];
    ["Alignment of xcb_grab_keyboard_cookie_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_cookie_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_keyboard_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub time: xcb_timestamp_t,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_request_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_request_t>() - 16usize];
    ["Alignment of xcb_grab_keyboard_request_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_request_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_keyboard_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_keyboard_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_keyboard_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_keyboard_request_t::time"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, time) - 8usize];
    ["Offset of field: xcb_grab_keyboard_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, pointer_mode) - 12usize];
    ["Offset of field: xcb_grab_keyboard_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, keyboard_mode) - 13usize];
    ["Offset of field: xcb_grab_keyboard_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_keyboard_request_t, pad0) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_keyboard_reply_t {
    pub response_type: u8,
    pub status: u8,
    pub sequence: u16,
    pub length: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_keyboard_reply_t"]
        [::std::mem::size_of::<xcb_grab_keyboard_reply_t>() - 8usize];
    ["Alignment of xcb_grab_keyboard_reply_t"]
        [::std::mem::align_of::<xcb_grab_keyboard_reply_t>() - 4usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::status"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, status) - 1usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_grab_keyboard_reply_t::length"]
        [::std::mem::offset_of!(xcb_grab_keyboard_reply_t, length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_keyboard_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_keyboard_request_t"]
        [::std::mem::size_of::<xcb_ungrab_keyboard_request_t>() - 8usize];
    ["Alignment of xcb_ungrab_keyboard_request_t"]
        [::std::mem::align_of::<xcb_ungrab_keyboard_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_keyboard_request_t::time"]
        [::std::mem::offset_of!(xcb_ungrab_keyboard_request_t, time) - 4usize];
};
pub const xcb_grab_t_XCB_GRAB_ANY: xcb_grab_t = 0;
pub type xcb_grab_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_key_request_t {
    pub major_opcode: u8,
    pub owner_events: u8,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub key: xcb_keycode_t,
    pub pointer_mode: u8,
    pub keyboard_mode: u8,
    pub pad0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_key_request_t"][::std::mem::size_of::<xcb_grab_key_request_t>() - 16usize];
    ["Alignment of xcb_grab_key_request_t"]
        [::std::mem::align_of::<xcb_grab_key_request_t>() - 4usize];
    ["Offset of field: xcb_grab_key_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_key_request_t::owner_events"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, owner_events) - 1usize];
    ["Offset of field: xcb_grab_key_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, length) - 2usize];
    ["Offset of field: xcb_grab_key_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_grab_key_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_grab_key_request_t::key"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, key) - 10usize];
    ["Offset of field: xcb_grab_key_request_t::pointer_mode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, pointer_mode) - 11usize];
    ["Offset of field: xcb_grab_key_request_t::keyboard_mode"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, keyboard_mode) - 12usize];
    ["Offset of field: xcb_grab_key_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_key_request_t, pad0) - 13usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_key_request_t {
    pub major_opcode: u8,
    pub key: xcb_keycode_t,
    pub length: u16,
    pub grab_window: xcb_window_t,
    pub modifiers: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_key_request_t"]
        [::std::mem::size_of::<xcb_ungrab_key_request_t>() - 12usize];
    ["Alignment of xcb_ungrab_key_request_t"]
        [::std::mem::align_of::<xcb_ungrab_key_request_t>() - 4usize];
    ["Offset of field: xcb_ungrab_key_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_key_request_t::key"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, key) - 1usize];
    ["Offset of field: xcb_ungrab_key_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, length) - 2usize];
    ["Offset of field: xcb_ungrab_key_request_t::grab_window"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, grab_window) - 4usize];
    ["Offset of field: xcb_ungrab_key_request_t::modifiers"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, modifiers) - 8usize];
    ["Offset of field: xcb_ungrab_key_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_key_request_t, pad0) - 10usize];
};
pub const xcb_allow_t_XCB_ALLOW_ASYNC_POINTER: xcb_allow_t = 0;
pub const xcb_allow_t_XCB_ALLOW_SYNC_POINTER: xcb_allow_t = 1;
pub const xcb_allow_t_XCB_ALLOW_REPLAY_POINTER: xcb_allow_t = 2;
pub const xcb_allow_t_XCB_ALLOW_ASYNC_KEYBOARD: xcb_allow_t = 3;
pub const xcb_allow_t_XCB_ALLOW_SYNC_KEYBOARD: xcb_allow_t = 4;
pub const xcb_allow_t_XCB_ALLOW_REPLAY_KEYBOARD: xcb_allow_t = 5;
pub const xcb_allow_t_XCB_ALLOW_ASYNC_BOTH: xcb_allow_t = 6;
pub const xcb_allow_t_XCB_ALLOW_SYNC_BOTH: xcb_allow_t = 7;
pub type xcb_allow_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_allow_events_request_t {
    pub major_opcode: u8,
    pub mode: u8,
    pub length: u16,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_allow_events_request_t"]
        [::std::mem::size_of::<xcb_allow_events_request_t>() - 8usize];
    ["Alignment of xcb_allow_events_request_t"]
        [::std::mem::align_of::<xcb_allow_events_request_t>() - 4usize];
    ["Offset of field: xcb_allow_events_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_allow_events_request_t::mode"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, mode) - 1usize];
    ["Offset of field: xcb_allow_events_request_t::length"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, length) - 2usize];
    ["Offset of field: xcb_allow_events_request_t::time"]
        [::std::mem::offset_of!(xcb_allow_events_request_t, time) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_grab_server_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_grab_server_request_t"]
        [::std::mem::size_of::<xcb_grab_server_request_t>() - 4usize];
    ["Alignment of xcb_grab_server_request_t"]
        [::std::mem::align_of::<xcb_grab_server_request_t>() - 2usize];
    ["Offset of field: xcb_grab_server_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_grab_server_request_t::pad0"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, pad0) - 1usize];
    ["Offset of field: xcb_grab_server_request_t::length"]
        [::std::mem::offset_of!(xcb_grab_server_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_ungrab_server_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_ungrab_server_request_t"]
        [::std::mem::size_of::<xcb_ungrab_server_request_t>() - 4usize];
    ["Alignment of xcb_ungrab_server_request_t"]
        [::std::mem::align_of::<xcb_ungrab_server_request_t>() - 2usize];
    ["Offset of field: xcb_ungrab_server_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_ungrab_server_request_t::pad0"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, pad0) - 1usize];
    ["Offset of field: xcb_ungrab_server_request_t::length"]
        [::std::mem::offset_of!(xcb_ungrab_server_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_cookie_t"]
        [::std::mem::size_of::<xcb_query_pointer_cookie_t>() - 4usize];
    ["Alignment of xcb_query_pointer_cookie_t"]
        [::std::mem::align_of::<xcb_query_pointer_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_pointer_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_request_t"]
        [::std::mem::size_of::<xcb_query_pointer_request_t>() - 8usize];
    ["Alignment of xcb_query_pointer_request_t"]
        [::std::mem::align_of::<xcb_query_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_query_pointer_request_t::window"]
        [::std::mem::offset_of!(xcb_query_pointer_request_t, window) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_pointer_reply_t {
    pub response_type: u8,
    pub same_screen: u8,
    pub sequence: u16,
    pub length: u32,
    pub root: xcb_window_t,
    pub child: xcb_window_t,
    pub root_x: i16,
    pub root_y: i16,
    pub win_x: i16,
    pub win_y: i16,
    pub mask: u16,
    pub pad0: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_pointer_reply_t"]
        [::std::mem::size_of::<xcb_query_pointer_reply_t>() - 28usize];
    ["Alignment of xcb_query_pointer_reply_t"]
        [::std::mem::align_of::<xcb_query_pointer_reply_t>() - 4usize];
    ["Offset of field: xcb_query_pointer_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_pointer_reply_t::same_screen"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, same_screen) - 1usize];
    ["Offset of field: xcb_query_pointer_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_pointer_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_pointer_reply_t::root"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root) - 8usize];
    ["Offset of field: xcb_query_pointer_reply_t::child"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, child) - 12usize];
    ["Offset of field: xcb_query_pointer_reply_t::root_x"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root_x) - 16usize];
    ["Offset of field: xcb_query_pointer_reply_t::root_y"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, root_y) - 18usize];
    ["Offset of field: xcb_query_pointer_reply_t::win_x"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, win_x) - 20usize];
    ["Offset of field: xcb_query_pointer_reply_t::win_y"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, win_y) - 22usize];
    ["Offset of field: xcb_query_pointer_reply_t::mask"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, mask) - 24usize];
    ["Offset of field: xcb_query_pointer_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_pointer_reply_t, pad0) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timecoord_t {
    pub time: xcb_timestamp_t,
    pub x: i16,
    pub y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timecoord_t"][::std::mem::size_of::<xcb_timecoord_t>() - 8usize];
    ["Alignment of xcb_timecoord_t"][::std::mem::align_of::<xcb_timecoord_t>() - 4usize];
    ["Offset of field: xcb_timecoord_t::time"]
        [::std::mem::offset_of!(xcb_timecoord_t, time) - 0usize];
    ["Offset of field: xcb_timecoord_t::x"][::std::mem::offset_of!(xcb_timecoord_t, x) - 4usize];
    ["Offset of field: xcb_timecoord_t::y"][::std::mem::offset_of!(xcb_timecoord_t, y) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_timecoord_iterator_t {
    pub data: *mut xcb_timecoord_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_timecoord_iterator_t"]
        [::std::mem::size_of::<xcb_timecoord_iterator_t>() - 16usize];
    ["Alignment of xcb_timecoord_iterator_t"]
        [::std::mem::align_of::<xcb_timecoord_iterator_t>() - 8usize];
    ["Offset of field: xcb_timecoord_iterator_t::data"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, data) - 0usize];
    ["Offset of field: xcb_timecoord_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_timecoord_iterator_t::index"]
        [::std::mem::offset_of!(xcb_timecoord_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_cookie_t"]
        [::std::mem::size_of::<xcb_get_motion_events_cookie_t>() - 4usize];
    ["Alignment of xcb_get_motion_events_cookie_t"]
        [::std::mem::align_of::<xcb_get_motion_events_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_motion_events_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub window: xcb_window_t,
    pub start: xcb_timestamp_t,
    pub stop: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_request_t"]
        [::std::mem::size_of::<xcb_get_motion_events_request_t>() - 16usize];
    ["Alignment of xcb_get_motion_events_request_t"]
        [::std::mem::align_of::<xcb_get_motion_events_request_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_motion_events_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_motion_events_request_t::length"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, length) - 2usize];
    ["Offset of field: xcb_get_motion_events_request_t::window"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, window) - 4usize];
    ["Offset of field: xcb_get_motion_events_request_t::start"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, start) - 8usize];
    ["Offset of field: xcb_get_motion_events_request_t::stop"]
        [::std::mem::offset_of!(xcb_get_motion_events_request_t, stop) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_motion_events_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub events_len: u32,
    pub pad1: [u8; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_motion_events_reply_t"]
        [::std::mem::size_of::<xcb_get_motion_events_reply_t>() - 32usize];
    ["Alignment of xcb_get_motion_events_reply_t"]
        [::std::mem::align_of::<xcb_get_motion_events_reply_t>() - 4usize];
    ["Offset of field: xcb_get_motion_events_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_motion_events_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_get_motion_events_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_motion_events_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_motion_events_reply_t::events_len"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, events_len) - 8usize];
    ["Offset of field: xcb_get_motion_events_reply_t::pad1"]
        [::std::mem::offset_of!(xcb_get_motion_events_reply_t, pad1) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_cookie_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_cookie_t>() - 4usize];
    ["Alignment of xcb_translate_coordinates_cookie_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_cookie_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_translate_coordinates_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_window: xcb_window_t,
    pub dst_window: xcb_window_t,
    pub src_x: i16,
    pub src_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_request_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_request_t>() - 16usize];
    ["Alignment of xcb_translate_coordinates_request_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_request_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_translate_coordinates_request_t::pad0"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, pad0) - 1usize];
    ["Offset of field: xcb_translate_coordinates_request_t::length"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, length) - 2usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_window"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_window) - 4usize];
    ["Offset of field: xcb_translate_coordinates_request_t::dst_window"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, dst_window) - 8usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_x"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_x) - 12usize];
    ["Offset of field: xcb_translate_coordinates_request_t::src_y"]
        [::std::mem::offset_of!(xcb_translate_coordinates_request_t, src_y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_translate_coordinates_reply_t {
    pub response_type: u8,
    pub same_screen: u8,
    pub sequence: u16,
    pub length: u32,
    pub child: xcb_window_t,
    pub dst_x: i16,
    pub dst_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_translate_coordinates_reply_t"]
        [::std::mem::size_of::<xcb_translate_coordinates_reply_t>() - 16usize];
    ["Alignment of xcb_translate_coordinates_reply_t"]
        [::std::mem::align_of::<xcb_translate_coordinates_reply_t>() - 4usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::same_screen"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, same_screen) - 1usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::length"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, length) - 4usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::child"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, child) - 8usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::dst_x"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, dst_x) - 12usize];
    ["Offset of field: xcb_translate_coordinates_reply_t::dst_y"]
        [::std::mem::offset_of!(xcb_translate_coordinates_reply_t, dst_y) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_warp_pointer_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub src_window: xcb_window_t,
    pub dst_window: xcb_window_t,
    pub src_x: i16,
    pub src_y: i16,
    pub src_width: u16,
    pub src_height: u16,
    pub dst_x: i16,
    pub dst_y: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_warp_pointer_request_t"]
        [::std::mem::size_of::<xcb_warp_pointer_request_t>() - 24usize];
    ["Alignment of xcb_warp_pointer_request_t"]
        [::std::mem::align_of::<xcb_warp_pointer_request_t>() - 4usize];
    ["Offset of field: xcb_warp_pointer_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_warp_pointer_request_t::pad0"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, pad0) - 1usize];
    ["Offset of field: xcb_warp_pointer_request_t::length"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, length) - 2usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_window"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_window) - 4usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_window"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_window) - 8usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_x"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_x) - 12usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_y"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_y) - 14usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_width"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_width) - 16usize];
    ["Offset of field: xcb_warp_pointer_request_t::src_height"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, src_height) - 18usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_x"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_x) - 20usize];
    ["Offset of field: xcb_warp_pointer_request_t::dst_y"]
        [::std::mem::offset_of!(xcb_warp_pointer_request_t, dst_y) - 22usize];
};
pub const xcb_input_focus_t_XCB_INPUT_FOCUS_NONE: xcb_input_focus_t = 0;
pub const xcb_input_focus_t_XCB_INPUT_FOCUS_POINTER_ROOT: xcb_input_focus_t = 1;
pub const xcb_input_focus_t_XCB_INPUT_FOCUS_PARENT: xcb_input_focus_t = 2;
pub const xcb_input_focus_t_XCB_INPUT_FOCUS_FOLLOW_KEYBOARD: xcb_input_focus_t = 3;
pub type xcb_input_focus_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_set_input_focus_request_t {
    pub major_opcode: u8,
    pub revert_to: u8,
    pub length: u16,
    pub focus: xcb_window_t,
    pub time: xcb_timestamp_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_set_input_focus_request_t"]
        [::std::mem::size_of::<xcb_set_input_focus_request_t>() - 12usize];
    ["Alignment of xcb_set_input_focus_request_t"]
        [::std::mem::align_of::<xcb_set_input_focus_request_t>() - 4usize];
    ["Offset of field: xcb_set_input_focus_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_set_input_focus_request_t::revert_to"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, revert_to) - 1usize];
    ["Offset of field: xcb_set_input_focus_request_t::length"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, length) - 2usize];
    ["Offset of field: xcb_set_input_focus_request_t::focus"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, focus) - 4usize];
    ["Offset of field: xcb_set_input_focus_request_t::time"]
        [::std::mem::offset_of!(xcb_set_input_focus_request_t, time) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_cookie_t"]
        [::std::mem::size_of::<xcb_get_input_focus_cookie_t>() - 4usize];
    ["Alignment of xcb_get_input_focus_cookie_t"]
        [::std::mem::align_of::<xcb_get_input_focus_cookie_t>() - 4usize];
    ["Offset of field: xcb_get_input_focus_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_get_input_focus_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_request_t"]
        [::std::mem::size_of::<xcb_get_input_focus_request_t>() - 4usize];
    ["Alignment of xcb_get_input_focus_request_t"]
        [::std::mem::align_of::<xcb_get_input_focus_request_t>() - 2usize];
    ["Offset of field: xcb_get_input_focus_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_get_input_focus_request_t::pad0"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, pad0) - 1usize];
    ["Offset of field: xcb_get_input_focus_request_t::length"]
        [::std::mem::offset_of!(xcb_get_input_focus_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_get_input_focus_reply_t {
    pub response_type: u8,
    pub revert_to: u8,
    pub sequence: u16,
    pub length: u32,
    pub focus: xcb_window_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_get_input_focus_reply_t"]
        [::std::mem::size_of::<xcb_get_input_focus_reply_t>() - 12usize];
    ["Alignment of xcb_get_input_focus_reply_t"]
        [::std::mem::align_of::<xcb_get_input_focus_reply_t>() - 4usize];
    ["Offset of field: xcb_get_input_focus_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_get_input_focus_reply_t::revert_to"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, revert_to) - 1usize];
    ["Offset of field: xcb_get_input_focus_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_get_input_focus_reply_t::length"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, length) - 4usize];
    ["Offset of field: xcb_get_input_focus_reply_t::focus"]
        [::std::mem::offset_of!(xcb_get_input_focus_reply_t, focus) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_cookie_t"]
        [::std::mem::size_of::<xcb_query_keymap_cookie_t>() - 4usize];
    ["Alignment of xcb_query_keymap_cookie_t"]
        [::std::mem::align_of::<xcb_query_keymap_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_keymap_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_keymap_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_request_t"]
        [::std::mem::size_of::<xcb_query_keymap_request_t>() - 4usize];
    ["Alignment of xcb_query_keymap_request_t"]
        [::std::mem::align_of::<xcb_query_keymap_request_t>() - 2usize];
    ["Offset of field: xcb_query_keymap_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_keymap_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_keymap_request_t::length"]
        [::std::mem::offset_of!(xcb_query_keymap_request_t, length) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_keymap_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
    pub keys: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_keymap_reply_t"]
        [::std::mem::size_of::<xcb_query_keymap_reply_t>() - 40usize];
    ["Alignment of xcb_query_keymap_reply_t"]
        [::std::mem::align_of::<xcb_query_keymap_reply_t>() - 4usize];
    ["Offset of field: xcb_query_keymap_reply_t::response_type"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, response_type) - 0usize];
    ["Offset of field: xcb_query_keymap_reply_t::pad0"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, pad0) - 1usize];
    ["Offset of field: xcb_query_keymap_reply_t::sequence"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, sequence) - 2usize];
    ["Offset of field: xcb_query_keymap_reply_t::length"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, length) - 4usize];
    ["Offset of field: xcb_query_keymap_reply_t::keys"]
        [::std::mem::offset_of!(xcb_query_keymap_reply_t, keys) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_open_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub fid: xcb_font_t,
    pub name_len: u16,
    pub pad1: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_open_font_request_t"][::std::mem::size_of::<xcb_open_font_request_t>() - 12usize];
    ["Alignment of xcb_open_font_request_t"]
        [::std::mem::align_of::<xcb_open_font_request_t>() - 4usize];
    ["Offset of field: xcb_open_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_open_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_open_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_open_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_open_font_request_t::length"]
        [::std::mem::offset_of!(xcb_open_font_request_t, length) - 2usize];
    ["Offset of field: xcb_open_font_request_t::fid"]
        [::std::mem::offset_of!(xcb_open_font_request_t, fid) - 4usize];
    ["Offset of field: xcb_open_font_request_t::name_len"]
        [::std::mem::offset_of!(xcb_open_font_request_t, name_len) - 8usize];
    ["Offset of field: xcb_open_font_request_t::pad1"]
        [::std::mem::offset_of!(xcb_open_font_request_t, pad1) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_close_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub font: xcb_font_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_close_font_request_t"]
        [::std::mem::size_of::<xcb_close_font_request_t>() - 8usize];
    ["Alignment of xcb_close_font_request_t"]
        [::std::mem::align_of::<xcb_close_font_request_t>() - 4usize];
    ["Offset of field: xcb_close_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_close_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_close_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_close_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_close_font_request_t::length"]
        [::std::mem::offset_of!(xcb_close_font_request_t, length) - 2usize];
    ["Offset of field: xcb_close_font_request_t::font"]
        [::std::mem::offset_of!(xcb_close_font_request_t, font) - 4usize];
};
pub const xcb_font_draw_t_XCB_FONT_DRAW_LEFT_TO_RIGHT: xcb_font_draw_t = 0;
pub const xcb_font_draw_t_XCB_FONT_DRAW_RIGHT_TO_LEFT: xcb_font_draw_t = 1;
pub type xcb_font_draw_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontprop_t {
    pub name: xcb_atom_t,
    pub value: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontprop_t"][::std::mem::size_of::<xcb_fontprop_t>() - 8usize];
    ["Alignment of xcb_fontprop_t"][::std::mem::align_of::<xcb_fontprop_t>() - 4usize];
    ["Offset of field: xcb_fontprop_t::name"]
        [::std::mem::offset_of!(xcb_fontprop_t, name) - 0usize];
    ["Offset of field: xcb_fontprop_t::value"]
        [::std::mem::offset_of!(xcb_fontprop_t, value) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_fontprop_iterator_t {
    pub data: *mut xcb_fontprop_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_fontprop_iterator_t"][::std::mem::size_of::<xcb_fontprop_iterator_t>() - 16usize];
    ["Alignment of xcb_fontprop_iterator_t"]
        [::std::mem::align_of::<xcb_fontprop_iterator_t>() - 8usize];
    ["Offset of field: xcb_fontprop_iterator_t::data"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, data) - 0usize];
    ["Offset of field: xcb_fontprop_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_fontprop_iterator_t::index"]
        [::std::mem::offset_of!(xcb_fontprop_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_charinfo_t {
    pub left_side_bearing: i16,
    pub right_side_bearing: i16,
    pub character_width: i16,
    pub ascent: i16,
    pub descent: i16,
    pub attributes: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_charinfo_t"][::std::mem::size_of::<xcb_charinfo_t>() - 12usize];
    ["Alignment of xcb_charinfo_t"][::std::mem::align_of::<xcb_charinfo_t>() - 2usize];
    ["Offset of field: xcb_charinfo_t::left_side_bearing"]
        [::std::mem::offset_of!(xcb_charinfo_t, left_side_bearing) - 0usize];
    ["Offset of field: xcb_charinfo_t::right_side_bearing"]
        [::std::mem::offset_of!(xcb_charinfo_t, right_side_bearing) - 2usize];
    ["Offset of field: xcb_charinfo_t::character_width"]
        [::std::mem::offset_of!(xcb_charinfo_t, character_width) - 4usize];
    ["Offset of field: xcb_charinfo_t::ascent"]
        [::std::mem::offset_of!(xcb_charinfo_t, ascent) - 6usize];
    ["Offset of field: xcb_charinfo_t::descent"]
        [::std::mem::offset_of!(xcb_charinfo_t, descent) - 8usize];
    ["Offset of field: xcb_charinfo_t::attributes"]
        [::std::mem::offset_of!(xcb_charinfo_t, attributes) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_charinfo_iterator_t {
    pub data: *mut xcb_charinfo_t,
    pub rem: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_charinfo_iterator_t"][::std::mem::size_of::<xcb_charinfo_iterator_t>() - 16usize];
    ["Alignment of xcb_charinfo_iterator_t"]
        [::std::mem::align_of::<xcb_charinfo_iterator_t>() - 8usize];
    ["Offset of field: xcb_charinfo_iterator_t::data"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, data) - 0usize];
    ["Offset of field: xcb_charinfo_iterator_t::rem"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, rem) - 8usize];
    ["Offset of field: xcb_charinfo_iterator_t::index"]
        [::std::mem::offset_of!(xcb_charinfo_iterator_t, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_cookie_t {
    pub sequence: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_font_cookie_t"][::std::mem::size_of::<xcb_query_font_cookie_t>() - 4usize];
    ["Alignment of xcb_query_font_cookie_t"]
        [::std::mem::align_of::<xcb_query_font_cookie_t>() - 4usize];
    ["Offset of field: xcb_query_font_cookie_t::sequence"]
        [::std::mem::offset_of!(xcb_query_font_cookie_t, sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_request_t {
    pub major_opcode: u8,
    pub pad0: u8,
    pub length: u16,
    pub font: xcb_fontable_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xcb_query_font_request_t"]
        [::std::mem::size_of::<xcb_query_font_request_t>() - 8usize];
    ["Alignment of xcb_query_font_request_t"]
        [::std::mem::align_of::<xcb_query_font_request_t>() - 4usize];
    ["Offset of field: xcb_query_font_request_t::major_opcode"]
        [::std::mem::offset_of!(xcb_query_font_request_t, major_opcode) - 0usize];
    ["Offset of field: xcb_query_font_request_t::pad0"]
        [::std::mem::offset_of!(xcb_query_font_request_t, pad0) - 1usize];
    ["Offset of field: xcb_query_font_request_t::length"]
        [::std::mem::offset_of!(xcb_query_font_request_t, length) - 2usize];
    ["Offset of field: xcb_query_font_request_t::font"]
        [::std::mem::offset_of!(xcb_query_font_request_t, font) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcb_query_font_reply_t {
    pub response_type: u8,
    pub pad0: u8,
    pub sequence: u16,
    pub length: u32,
